{
  "generatedAt": "2025-09-08T17:24:55.064Z",
  "totalItems": 782,
  "summaries": [
    {
      "id": "chapter-0",
      "type": "chapter",
      "level": 1,
      "title": "CHAPTER I - GENERAL PROVISIONS",
      "summary": "Foundational rules and basic legal framework for all subsequent provisions.",
      "hasChildren": true
    },
    {
      "id": "article-1",
      "type": "article",
      "level": 3,
      "title": "Article 1: Subject matter and scope",
      "summary": "Defines what EU data protection law covers and applies to.",
      "hasChildren": true
    },
    {
      "id": "paragraph-2",
      "type": "paragraph",
      "level": 4,
      "title": "1.This Regulation lays down uniform rules to address the misuse of relevant information society services for online child sexual abuse in the internal market.",
      "summary": "Rules to prevent and combat online child sexual abuse across EU digital services.",
      "hasChildren": true
    },
    {
      "id": "point-3",
      "type": "point",
      "level": 5,
      "title": "(a)obligations on providers of relevant information society services to minim...",
      "summary": "Online service providers must reduce risk of child sexual abuse on their platforms.",
      "hasChildren": false
    },
    {
      "id": "point-4",
      "type": "point",
      "level": 5,
      "title": "(b)obligations on providers of hosting services and providers of interpersona...",
      "summary": "Hosting and communication providers must detect and report child sexual abuse online.",
      "hasChildren": false
    },
    {
      "id": "point-5",
      "type": "point",
      "level": 5,
      "title": "(c)obligations on providers of hosting services to remove or disable access t...",
      "summary": "Hosting providers must remove child sexual abuse content from their services.",
      "hasChildren": false
    },
    {
      "id": "point-6",
      "type": "point",
      "level": 5,
      "title": "(d)obligations on providers of internet access services to disable access to ...",
      "summary": "Internet providers must block access to child abuse content.",
      "hasChildren": false
    },
    {
      "id": "point-7",
      "type": "point",
      "level": 5,
      "title": "(e)rules on the implementation and enforcement of this Regulation, including ...",
      "summary": "Rules for implementing and enforcing regulation through authorities, EU Child Abuse Centre.",
      "hasChildren": false
    },
    {
      "id": "paragraph-8",
      "type": "paragraph",
      "level": 4,
      "title": "2.This Regulation shall apply to providers of relevant information society services offering such services in the Union, irrespective of their place of main establishment.",
      "summary": "Regulation applies to all digital service providers operating in EU, regardless of location.",
      "hasChildren": false
    },
    {
      "id": "paragraph-9",
      "type": "paragraph",
      "level": 4,
      "title": "3.This Regulation shall not affect the rules laid down by the following legal acts:",
      "summary": "Regulation does not override or change rules established in subsequent listed acts.",
      "hasChildren": true
    },
    {
      "id": "point-10",
      "type": "point",
      "level": 5,
      "title": "(a)Directive 2011/93/EU on combating the sexual abuse and sexual exploitation...",
      "summary": "EU law combats child sexual abuse, exploitation and pornography, replacing previous framework.",
      "hasChildren": false
    },
    {
      "id": "point-11",
      "type": "point",
      "level": 5,
      "title": "(b)Directive 2000/31/EC and Regulation (EU) …/… [on a Single Market For Digit...",
      "summary": "EU Digital Services Act updates rules for online services and amends 2000 directive.",
      "hasChildren": false
    },
    {
      "id": "point-12",
      "type": "point",
      "level": 5,
      "title": "(c)Directive 2010/13/EU;",
      "summary": "EU rules for audiovisual media services and broadcasting.",
      "hasChildren": false
    },
    {
      "id": "point-13",
      "type": "point",
      "level": 5,
      "title": "(d)Regulation (EU) 2016/679, Directive 2016/680, Regulation (EU) 2018/1725, a...",
      "summary": "EU data protection laws and privacy directives must be followed.",
      "hasChildren": false
    },
    {
      "id": "paragraph-14",
      "type": "paragraph",
      "level": 4,
      "title": "4.This Regulation limits the exercise of the rights and obligations provided for in 5(1) and (3) and Article 6(1) of Directive 2002/58/EC insofar as necessary for the execution of the detection orders issued in accordance with Section 2 of Chapter 1 of this Regulation.",
      "summary": "Regulation restricts privacy rights from Directive 2002/58/EC when needed for detection order execution.",
      "hasChildren": false
    },
    {
      "id": "article-15",
      "type": "article",
      "level": 3,
      "title": "Article 2: Definitions",
      "summary": "Defines key terms and concepts used throughout the document.",
      "hasChildren": true
    },
    {
      "id": "point-16",
      "type": "point",
      "level": 5,
      "title": "(a)‘hosting service’ means an information society service as defined in Artic...",
      "summary": "Hosting service: Online platform storing and sharing user-generated content.",
      "hasChildren": false
    },
    {
      "id": "point-17",
      "type": "point",
      "level": 5,
      "title": "(b)‘interpersonal communications service’ means a publicly available service ...",
      "summary": "Service enabling direct communication between people, including minor communication features within other services.",
      "hasChildren": false
    },
    {
      "id": "point-18",
      "type": "point",
      "level": 5,
      "title": "(c)‘software application’ means a digital product or service as defined in Ar...",
      "summary": "Software application: any digital product or service under Digital Markets Act definition.",
      "hasChildren": false
    },
    {
      "id": "point-19",
      "type": "point",
      "level": 5,
      "title": "(d)‘software application store’ means a service as defined in Article 2, poin...",
      "summary": "Software application store: digital marketplace for downloading and purchasing software applications.",
      "hasChildren": false
    },
    {
      "id": "point-20",
      "type": "point",
      "level": 5,
      "title": "(e)‘internet access service’ means a service as defined in Article 2(2), poin...",
      "summary": "Internet access service follows definition from EU Regulation 2015/2120.",
      "hasChildren": false
    },
    {
      "id": "point-21",
      "type": "point",
      "level": 5,
      "title": "(f)‘relevant information society services’ means all of the following services:",
      "summary": "Defines which information society services are considered relevant under this regulation.",
      "hasChildren": false
    },
    {
      "id": "point-22",
      "type": "point",
      "level": 5,
      "title": "(i) a hosting service;",
      "summary": "Provide a hosting service",
      "hasChildren": false
    },
    {
      "id": "point-23",
      "type": "point",
      "level": 5,
      "title": "(ii) an interpersonal communications service;",
      "summary": "Service enabling direct communication between people.",
      "hasChildren": false
    },
    {
      "id": "point-24",
      "type": "point",
      "level": 5,
      "title": "(iii) a software applications store;",
      "summary": "Store for downloading and purchasing software applications",
      "hasChildren": false
    },
    {
      "id": "point-25",
      "type": "point",
      "level": 5,
      "title": "(iv) an internet access service.",
      "summary": "Internet access service",
      "hasChildren": false
    },
    {
      "id": "point-26",
      "type": "point",
      "level": 5,
      "title": "(g)‘to offer services in the Union’ means to offer services in the Union as d...",
      "summary": "Offering services within EU territory as defined by Digital Services Act regulations.",
      "hasChildren": false
    },
    {
      "id": "point-27",
      "type": "point",
      "level": 5,
      "title": "(h)‘user’ means any natural or legal person who uses a relevant information s...",
      "summary": "User: Any person or organization using an online service.",
      "hasChildren": false
    },
    {
      "id": "point-28",
      "type": "point",
      "level": 5,
      "title": "(i)‘child’ means any natural person below the age of 18 years;",
      "summary": "A child is anyone under 18 years old.",
      "hasChildren": false
    },
    {
      "id": "point-29",
      "type": "point",
      "level": 5,
      "title": "(j)‘child user’ means a natural person who uses a relevant information societ...",
      "summary": "Child user: Person under 17 years old who uses online services.",
      "hasChildren": false
    },
    {
      "id": "point-30",
      "type": "point",
      "level": 5,
      "title": "(k)‘micro, small or medium-sized enterprise’ means an enterprise as defined i...",
      "summary": "Micro, small and medium enterprises follow definitions from Commission Recommendation 2003/361.",
      "hasChildren": false
    },
    {
      "id": "point-31",
      "type": "point",
      "level": 5,
      "title": "(l)‘child sexual abuse material’ means material constituting child pornograph...",
      "summary": "Definition: Child sexual abuse material includes child pornography and pornographic performances.",
      "hasChildren": false
    },
    {
      "id": "point-32",
      "type": "point",
      "level": 5,
      "title": "(m)‘known child sexual abuse material’ means potential child sexual abuse mat...",
      "summary": "Known child sexual abuse material: content matching indicators in official database.",
      "hasChildren": false
    },
    {
      "id": "point-33",
      "type": "point",
      "level": 5,
      "title": "(n)‘new child sexual abuse material’ means potential child sexual abuse mater...",
      "summary": "New child abuse material: content detected using indicators from official database.",
      "hasChildren": false
    },
    {
      "id": "point-34",
      "type": "point",
      "level": 5,
      "title": "(o)‘solicitation of children’ means the solicitation of children for sexual p...",
      "summary": "Soliciting children for sexual purposes, as defined in EU Directive 2011/93.",
      "hasChildren": false
    },
    {
      "id": "point-35",
      "type": "point",
      "level": 5,
      "title": "(p)‘online child sexual abuse’ means the online dissemination of child sexual...",
      "summary": "Online sharing of child abuse content and soliciting children.",
      "hasChildren": false
    },
    {
      "id": "point-36",
      "type": "point",
      "level": 5,
      "title": "(q)‘child sexual abuse offences’ means offences as defined in Articles 3 to 7...",
      "summary": "Child sexual abuse offenses are defined in Articles 3-7 of Directive 2011/93/EU.",
      "hasChildren": false
    },
    {
      "id": "point-37",
      "type": "point",
      "level": 5,
      "title": "(r)‘recommender system’ means the system as defined in Article 2, point (o), ...",
      "summary": "Recommender system definition references Article 2(o) of Digital Services Act.",
      "hasChildren": false
    },
    {
      "id": "point-38",
      "type": "point",
      "level": 5,
      "title": "(s)‘content data’ means data as defined in Article 2, point 10, of Regulation...",
      "summary": "Content data follows definition from Article 2.10 of EU e-evidence Regulation.",
      "hasChildren": false
    },
    {
      "id": "point-39",
      "type": "point",
      "level": 5,
      "title": "(t)‘content moderation’ means the activities as defined in Article 2, point (...",
      "summary": "Content moderation follows definition in Article 2(p) of Digital Services Act.",
      "hasChildren": false
    },
    {
      "id": "point-40",
      "type": "point",
      "level": 5,
      "title": "(u)‘Coordinating Authority of establishment’ means the Coordinating Authority...",
      "summary": "Coordinating Authority oversees child abuse issues where service provider or representative is established.",
      "hasChildren": false
    },
    {
      "id": "point-41",
      "type": "point",
      "level": 5,
      "title": "(v)‘terms and conditions’ means terms and conditions as defined in Article 2,...",
      "summary": "Terms and conditions follow the definition in Article 2(q) of Digital Services Act.",
      "hasChildren": false
    },
    {
      "id": "point-42",
      "type": "point",
      "level": 5,
      "title": "(w)‘main establishment’ means the head office or registered office of the pro...",
      "summary": "Main establishment is provider's head office where financial and operational control occurs.",
      "hasChildren": false
    },
    {
      "id": "chapter-43",
      "type": "chapter",
      "level": 1,
      "title": "CHAPTER II - OBLIGATIONS OF PROVIDERS OF RELEVANT INFORMATION SOCIETY SERVICES TO PREVENT AND COMBAT ONLINE CHILD SEXUAL ABUSE",
      "summary": "Rules for online platforms to detect and stop child abuse.",
      "hasChildren": true
    },
    {
      "id": "section-44",
      "type": "section",
      "level": 2,
      "title": "Section 1: Risk assessment and mitigation obligations",
      "summary": "Assess risks and implement mitigation measures.",
      "hasChildren": true
    },
    {
      "id": "article-45",
      "type": "article",
      "level": 3,
      "title": "Article 3: Risk assessment",
      "summary": "Methods to identify, analyze and evaluate potential hazards and threats.",
      "hasChildren": true
    },
    {
      "id": "paragraph-46",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of hosting services and providers of interpersonal communications services shall identify, analyse and assess, for each such service that they offer, the risk of use of the service for the purpose of online child sexual abuse.",
      "summary": "Service providers must assess child sexual abuse risks in their hosting and communications platforms.",
      "hasChildren": false
    },
    {
      "id": "paragraph-47",
      "type": "paragraph",
      "level": 4,
      "title": "2.When carrying out a risk assessment, the provider shall take into account, in particular:",
      "summary": "Risk assessments must consider specific factors and details when evaluating potential hazards.",
      "hasChildren": true
    },
    {
      "id": "point-48",
      "type": "point",
      "level": 5,
      "title": "(a)any previously identified instances of use of its services for the purpose...",
      "summary": "Report past cases where services were used for online child sexual abuse.",
      "hasChildren": false
    },
    {
      "id": "point-49",
      "type": "point",
      "level": 5,
      "title": "(b)the existence and implementation by the provider of a policy and the avail...",
      "summary": "Provider must implement policies and tools to prevent child sexual abuse online.",
      "hasChildren": false
    },
    {
      "id": "point-50",
      "type": "point",
      "level": 5,
      "title": "(c)the manner in which users use the service and the impact thereof on that r...",
      "summary": "How users interact with service and resulting effects on risk.",
      "hasChildren": false
    },
    {
      "id": "point-51",
      "type": "point",
      "level": 5,
      "title": "(d)the manner in which the provider designed and operates the service, includ...",
      "summary": "How provider designs and runs service, including business model and processes.",
      "hasChildren": false
    },
    {
      "id": "point-52",
      "type": "point",
      "level": 5,
      "title": "(e)with respect to the risk of solicitation of children:",
      "summary": "Protect children from being solicited.",
      "hasChildren": false
    },
    {
      "id": "point-53",
      "type": "point",
      "level": 5,
      "title": "(i) the extent to which the service is used or is likely to be used by children;",
      "summary": "Assess how many children currently use or may use the service.",
      "hasChildren": false
    },
    {
      "id": "point-54",
      "type": "point",
      "level": 5,
      "title": "(ii) where the service is used by children, the different age groups of the c...",
      "summary": "Identify child user age groups and assess solicitation risks in service features.",
      "hasChildren": false
    },
    {
      "id": "point-55",
      "type": "point",
      "level": 5,
      "title": "(iii) the availability of functionalities creating or reinforcing the risk of...",
      "summary": "Features that let adults search for, contact, or share media with children privately.",
      "hasChildren": false
    },
    {
      "id": "paragraph-56",
      "type": "paragraph",
      "level": 4,
      "title": "3.The provider may request the EU Centre to perform an analysis of representative, anonymized data samples to identify potential online child sexual abuse, to support the risk assessment.",
      "summary": "Providers can ask EU Centre to analyze anonymous data samples for child abuse detection.",
      "hasChildren": false
    },
    {
      "id": "paragraph-57",
      "type": "paragraph",
      "level": 4,
      "title": "4.The provider shall carry out the first risk assessment by [Date of application of this Regulation + 3 months] or, where the provider did not offer the service in the Union by [Date of application of this Regulation], by three months from the date at which the provider started offering the service in the Union.",
      "summary": "Complete first risk assessment within 3 months of regulation start or service launch.",
      "hasChildren": true
    },
    {
      "id": "point-58",
      "type": "point",
      "level": 5,
      "title": "(a)for a service which is subject to a detection order issued in accordance w...",
      "summary": "Update risk assessment two months before detection order expires.",
      "hasChildren": false
    },
    {
      "id": "point-59",
      "type": "point",
      "level": 5,
      "title": "(b)the Coordinating Authority of establishment may require the provider to up...",
      "summary": "Authority can require earlier risk assessment update if child abuse risk changes substantially.",
      "hasChildren": false
    },
    {
      "id": "paragraph-60",
      "type": "paragraph",
      "level": 4,
      "title": "5.The risk assessment shall include an assessment of any potential remaining risk that, after taking the mitigation measures pursuant to Article 4, the service is used for the purpose of online child sexual abuse.",
      "summary": "Assess residual risk of child sexual abuse after implementing mitigation measures.",
      "hasChildren": false
    },
    {
      "id": "paragraph-61",
      "type": "paragraph",
      "level": 4,
      "title": "6.The Commission, in cooperation with Coordinating Authorities and the EU Centre and after having conducted a public consultation, may issue guidelines on the application of paragraphs 1 to 5, having due regard in particular to relevant technological developments and to the manners in which the services covered by those provisions are offered and used.",
      "summary": "Commission may issue guidelines after public consultation on applying technology-related service provisions.",
      "hasChildren": false
    },
    {
      "id": "article-62",
      "type": "article",
      "level": 3,
      "title": "Article 4: Risk mitigation",
      "summary": "Methods to identify, assess and reduce potential threats and dangers.",
      "hasChildren": true
    },
    {
      "id": "paragraph-63",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of hosting services and providers of interpersonal communications services shall take reasonable mitigation measures, tailored to the risk identified pursuant to Article 3, to minimise that risk. Such measures shall include some or all of the following:",
      "summary": "Hosting and communication providers must implement risk mitigation measures based on Article 3.",
      "hasChildren": true
    },
    {
      "id": "point-64",
      "type": "point",
      "level": 5,
      "title": "(a)adapting, through appropriate technical and operational measures and staff...",
      "summary": "Adapt content moderation, systems, operations, staffing, and terms to meet requirements.",
      "hasChildren": false
    },
    {
      "id": "point-65",
      "type": "point",
      "level": 5,
      "title": "(b)reinforcing the provider’s internal processes or the internal supervision ...",
      "summary": "Strengthen provider's internal processes and service supervision.",
      "hasChildren": false
    },
    {
      "id": "point-66",
      "type": "point",
      "level": 5,
      "title": "(c)initiating or adjusting cooperation, in accordance with competition law, w...",
      "summary": "Cooperate with hosting providers, authorities, and trusted organizations while following competition laws.",
      "hasChildren": false
    },
    {
      "id": "paragraph-67",
      "type": "paragraph",
      "level": 4,
      "title": "2.The mitigation measures shall be:",
      "summary": "Mitigation measures must effectively address risks while being proportionate, non-discriminatory, and regularly reviewed.",
      "hasChildren": true
    },
    {
      "id": "point-68",
      "type": "point",
      "level": 5,
      "title": "(a)effective in mitigating the identified risk;",
      "summary": "Must effectively reduce known risks.",
      "hasChildren": false
    },
    {
      "id": "point-69",
      "type": "point",
      "level": 5,
      "title": "(b)targeted and proportionate in relation to that risk, taking into account, ...",
      "summary": "Actions must match risk level, considering severity, resources, and user count.",
      "hasChildren": false
    },
    {
      "id": "point-70",
      "type": "point",
      "level": 5,
      "title": "(c)applied in a diligent and non-discriminatory manner, having due regard, in...",
      "summary": "Apply measures fairly and carefully while considering impacts on everyone's fundamental rights.",
      "hasChildren": false
    },
    {
      "id": "point-71",
      "type": "point",
      "level": 5,
      "title": "(d)introduced, reviewed, discontinued or expanded, as appropriate, each time ...",
      "summary": "Review and update measures within three months of each risk assessment.",
      "hasChildren": false
    },
    {
      "id": "paragraph-72",
      "type": "paragraph",
      "level": 4,
      "title": "3.Providers of interpersonal communications services that have identified, pursuant to the risk assessment conducted or updated in accordance with Article 3, a risk of use of their services for the purpose of the solicitation of children, shall take the necessary age verification and age assessment measures to reliably identify child users on their services, enabling them to take the mitigation measures.",
      "summary": "Communication services must verify user ages if child solicitation risks are identified.",
      "hasChildren": false
    },
    {
      "id": "paragraph-73",
      "type": "paragraph",
      "level": 4,
      "title": "4.Providers of hosting services and providers of interpersonal communications services shall clearly describe in their terms and conditions the mitigation measures that they have taken. That description shall not include information that may reduce the effectiveness of the mitigation measures.",
      "summary": "Hosting providers must describe safety measures in terms, excluding details that compromise effectiveness.",
      "hasChildren": false
    },
    {
      "id": "paragraph-74",
      "type": "paragraph",
      "level": 4,
      "title": "5.The Commission, in cooperation with Coordinating Authorities and the EU Centre and after having conducted a public consultation, may issue guidelines on the application of paragraphs 1, 2, 3 and 4, having due regard in particular to relevant technological developments and in the manners in which the services covered by those provisions are offered and used.",
      "summary": "Commission may issue guidelines after consultation, considering tech developments and service usage.",
      "hasChildren": false
    },
    {
      "id": "article-75",
      "type": "article",
      "level": 3,
      "title": "Article 5: Risk reporting",
      "summary": "Financial risk disclosure requirements and reporting standards for organizations.",
      "hasChildren": true
    },
    {
      "id": "paragraph-76",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of hosting services and providers of interpersonal communications services shall transmit, by three months from the date referred to in Article 3(4), to the Coordinating Authority of establishment a report specifying the following:",
      "summary": "Service providers must submit report to Coordinating Authority within three months.",
      "hasChildren": true
    },
    {
      "id": "point-77",
      "type": "point",
      "level": 5,
      "title": "(a)the process and the results of the risk assessment conducted or updated pu...",
      "summary": "Document risk assessment process, results, and any remaining risks identified.",
      "hasChildren": false
    },
    {
      "id": "point-78",
      "type": "point",
      "level": 5,
      "title": "(b)any mitigation measures taken pursuant to Article 4.",
      "summary": "Report mitigation actions taken under Article 4.",
      "hasChildren": false
    },
    {
      "id": "paragraph-79",
      "type": "paragraph",
      "level": 4,
      "title": "2.Within three months after receiving the report, the Coordinating Authority of establishment shall assess it and determine, on that basis and taking into account any other relevant information available to it, whether the risk assessment has been carried out or updated and the mitigation measures have been taken in accordance with the requirements of Articles 3 and 4.",
      "summary": "Authority must verify risk assessment and mitigation compliance within 3 months of report receipt.",
      "hasChildren": false
    },
    {
      "id": "paragraph-80",
      "type": "paragraph",
      "level": 4,
      "title": "3.Where necessary for that assessment, that Coordinating Authority may require further information from the provider, within a reasonable time period set by that Coordinating Authority. That time period shall not be longer than two weeks.",
      "summary": "Authority can request additional information from provider within maximum two-week deadline.",
      "hasChildren": false
    },
    {
      "id": "paragraph-81",
      "type": "paragraph",
      "level": 4,
      "title": "4.Without prejudice to Articles 7 and 27 to 29, where the requirements of Articles 3 and 4 have not been met, that Coordinating Authority shall require the provider to re-conduct or update the risk assessment or to introduce, review, discontinue or expand, as applicable, the mitigation measures, within a reasonable time period set by that Coordinating Authority. That time period shall not be longer than one month.",
      "summary": "Authority requires providers update risk assessment or mitigation measures within one month.",
      "hasChildren": false
    },
    {
      "id": "paragraph-82",
      "type": "paragraph",
      "level": 4,
      "title": "5.Providers shall, when transmitting the report to the Coordinating Authority of establishment in accordance with paragraph 1, transmit the report also to the EU Centre.",
      "summary": "Providers must send reports to both Coordinating Authority and EU Centre.",
      "hasChildren": false
    },
    {
      "id": "paragraph-83",
      "type": "paragraph",
      "level": 4,
      "title": "6.Providers shall, upon request, transmit the report to the providers of software application stores, insofar as necessary for the assessment referred to in Article 6(2). Where necessary, they may remove confidential information from the reports.",
      "summary": "Send reports to app stores when requested; confidential information can be removed.",
      "hasChildren": false
    },
    {
      "id": "article-84",
      "type": "article",
      "level": 3,
      "title": "Article 6: Obligations for software application stores",
      "summary": "App store rules for transparency, security and fair business practices.",
      "hasChildren": true
    },
    {
      "id": "paragraph-85",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of software application stores shall:",
      "summary": "App store providers must follow these rules.",
      "hasChildren": true
    },
    {
      "id": "point-86",
      "type": "point",
      "level": 5,
      "title": "(a)make reasonable efforts to assess, where possible together with the provid...",
      "summary": "Assess if apps could be used to solicit children, working with app providers.",
      "hasChildren": false
    },
    {
      "id": "point-87",
      "type": "point",
      "level": 5,
      "title": "(b)take reasonable measures to prevent child users from accessing the softwar...",
      "summary": "Prevent children from accessing software apps with high risk of child solicitation.",
      "hasChildren": false
    },
    {
      "id": "point-88",
      "type": "point",
      "level": 5,
      "title": "(c)take the necessary age verification and age assessment measures to reliabl...",
      "summary": "Verify and assess user ages to identify children on the service.",
      "hasChildren": false
    },
    {
      "id": "paragraph-89",
      "type": "paragraph",
      "level": 4,
      "title": "2.In assessing the risk referred to in paragraph 1, the provider shall take into account all the available information, including the results of the risk assessment conducted or updated pursuant to Article 3.",
      "summary": "Provider must consider all available information and risk assessment results from Article 3.",
      "hasChildren": false
    },
    {
      "id": "paragraph-90",
      "type": "paragraph",
      "level": 4,
      "title": "3.Providers of software application stores shall make publicly available information describing the process and criteria used to assess the risk and describing the measures referred to in paragraph 1. That description shall not include information that may reduce the effectiveness of the assessment of those measures.",
      "summary": "App store providers must publish risk assessment process details without compromising security measures.",
      "hasChildren": false
    },
    {
      "id": "paragraph-91",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Commission, in cooperation with Coordinating Authorities and the EU Centre and after having conducted a public consultation, may issue guidelines on the application of paragraphs 1, 2 and 3, having due regard in particular to relevant technological developments and to the manners in which the services covered by those provisions are offered and used.",
      "summary": "Commission may issue guidelines after consultation, considering tech developments and service usage.",
      "hasChildren": false
    },
    {
      "id": "section-92",
      "type": "section",
      "level": 2,
      "title": "Section 2: Detection obligations",
      "summary": "Providers must detect and report online child sexual abuse content.",
      "hasChildren": true
    },
    {
      "id": "article-93",
      "type": "article",
      "level": 3,
      "title": "Article 7: Issuance of detection orders",
      "summary": "Detection orders: legal process for monitoring criminal communications/activities",
      "hasChildren": true
    },
    {
      "id": "paragraph-94",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Coordinating Authority of establishment shall have the power to request the competent judicial authority of the Member State that designated it or another independent administrative authority of that Member State to issue a detection order requiring a provider of hosting services or a provider of interpersonal communications services under the jurisdiction of that Member State to take the measures specified in Article 10 to detect online child sexual abuse on a specific service.",
      "summary": "Coordinating Authority can request courts to order service providers to detect child abuse content.",
      "hasChildren": false
    },
    {
      "id": "paragraph-95",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Coordinating Authority of establishment shall, before requesting the issuance of a detection order, carry out the investigations and assessments necessary to determine whether the conditions of paragraph 4 have been met.",
      "summary": "Authority must investigate and verify paragraph 4 conditions before requesting detection order.",
      "hasChildren": false
    },
    {
      "id": "paragraph-96",
      "type": "paragraph",
      "level": 4,
      "title": "3.Where the Coordinating Authority of establishment takes the preliminary view that the conditions of paragraph 4 have been met, it shall:",
      "summary": "Authority must act when paragraph 4 conditions are satisfied.",
      "hasChildren": true
    },
    {
      "id": "point-97",
      "type": "point",
      "level": 5,
      "title": "(a)establish a draft request for the issuance of a detection order, specifyin...",
      "summary": "Draft detection order request with key elements and justification.",
      "hasChildren": false
    },
    {
      "id": "point-98",
      "type": "point",
      "level": 5,
      "title": "(b)submit the draft request to the provider and the EU Centre;",
      "summary": "Submit draft request to provider and EU Centre.",
      "hasChildren": false
    },
    {
      "id": "point-99",
      "type": "point",
      "level": 5,
      "title": "(c)afford the provider an opportunity to comment on the draft request, within...",
      "summary": "Allow provider time to review and comment on draft request.",
      "hasChildren": false
    },
    {
      "id": "point-100",
      "type": "point",
      "level": 5,
      "title": "(d)invite the EU Centre to provide its opinion on the draft request, within a...",
      "summary": "EU Centre must review draft request and provide opinion within 4 weeks.",
      "hasChildren": false
    },
    {
      "id": "point-101",
      "type": "point",
      "level": 5,
      "title": "(a)draft an implementation plan setting out the measures it envisages taking ...",
      "summary": "Create plan detailing measures and technologies to detect child abuse content.",
      "hasChildren": false
    },
    {
      "id": "point-102",
      "type": "point",
      "level": 5,
      "title": "(b)where the draft implementation plan concerns an intended detection order c...",
      "summary": "Conduct data protection assessment and consultation for new child solicitation detection orders.",
      "hasChildren": false
    },
    {
      "id": "point-103",
      "type": "point",
      "level": 5,
      "title": "(c)where point (b) applies, or where the conditions of Articles 35 and 36 of ...",
      "summary": "Adjust implementation plan based on data protection assessment and authority opinion.",
      "hasChildren": false
    },
    {
      "id": "point-104",
      "type": "point",
      "level": 5,
      "title": "(d)submit to that Coordinating Authority the implementation plan, where appli...",
      "summary": "Submit implementation plan with data protection opinion to Coordinating Authority for review.",
      "hasChildren": false
    },
    {
      "id": "paragraph-105",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Coordinating Authority of establishment shall request the issuance of the detection order, and the competent judicial authority or independent administrative authority shall issue the detection order where it considers that the following conditions are met:",
      "summary": "Coordinating Authority requests detection order; judicial/administrative authority issues if conditions met.",
      "hasChildren": true
    },
    {
      "id": "point-106",
      "type": "point",
      "level": 5,
      "title": "(a)there is evidence of a significant risk of the service being used for the ...",
      "summary": "Evidence shows significant risk of service enabling online child sexual abuse.",
      "hasChildren": false
    },
    {
      "id": "point-107",
      "type": "point",
      "level": 5,
      "title": "(b)the reasons for issuing the detection order outweigh negative consequences...",
      "summary": "Benefits of detection order must exceed harm to affected parties' rights and interests.",
      "hasChildren": false
    },
    {
      "id": "point-108",
      "type": "point",
      "level": 5,
      "title": "(a)the risk assessment conducted or updated and any mitigation measures taken...",
      "summary": "Document risk assessments and mitigation actions taken, including any changes made.",
      "hasChildren": false
    },
    {
      "id": "point-109",
      "type": "point",
      "level": 5,
      "title": "(b)any additional information obtained pursuant to paragraph 2 or any other r...",
      "summary": "Consider service details, provider capabilities, and impact when evaluating additional detection order information.",
      "hasChildren": false
    },
    {
      "id": "point-110",
      "type": "point",
      "level": 5,
      "title": "(c)the views and the implementation plan of the provider submitted in accorda...",
      "summary": "Provider must submit views and implementation plan.",
      "hasChildren": false
    },
    {
      "id": "point-111",
      "type": "point",
      "level": 5,
      "title": "(d)the opinions of the EU Centre and of the data protection authority submitt...",
      "summary": "Coordinating Authority must explain deviations from EU Centre opinions to Commission.",
      "hasChildren": false
    },
    {
      "id": "paragraph-112",
      "type": "paragraph",
      "level": 4,
      "title": "5.As regards detection orders concerning the dissemination of known child sexual abuse material, the significant risk referred to in paragraph 4, first subparagraph, point (a), shall be deemed to exist where the following conditions are met:",
      "summary": "Detection orders for child abuse material require specific conditions to establish significant risk.",
      "hasChildren": true
    },
    {
      "id": "point-113",
      "type": "point",
      "level": 5,
      "title": "(a)it is likely, despite any mitigation measures that the provider may have t...",
      "summary": "Service is significantly used to spread child abuse content despite provider's safeguards.",
      "hasChildren": false
    },
    {
      "id": "point-114",
      "type": "point",
      "level": 5,
      "title": "(b)there is evidence of the service, or of a comparable service if the servic...",
      "summary": "Service must show evidence of CSAM distribution in past 12 months.",
      "hasChildren": false
    },
    {
      "id": "paragraph-115",
      "type": "paragraph",
      "level": 4,
      "title": "6.As regards detection orders concerning the dissemination of new child sexual abuse material, the significant risk referred to in paragraph 4, first subparagraph, point (a), shall be deemed to exist where the following conditions are met:",
      "summary": "Detection orders for new child abuse material require specific risk conditions.",
      "hasChildren": true
    },
    {
      "id": "point-116",
      "type": "point",
      "level": 5,
      "title": "(a)it is likely that, despite any mitigation measures that the provider may h...",
      "summary": "Service is significantly used to spread child abuse content despite provider's preventive actions.",
      "hasChildren": false
    },
    {
      "id": "point-117",
      "type": "point",
      "level": 5,
      "title": "(b)there is evidence of the service, or of a comparable service if the servic...",
      "summary": "Evidence shows service was used to spread child abuse content within past year.",
      "hasChildren": false
    },
    {
      "id": "point-118",
      "type": "point",
      "level": 5,
      "title": "(c)for services other than those enabling the live transmission of pornograph...",
      "summary": "Detection orders for child abuse content must be specific, time-limited, and minimally intrusive.",
      "hasChildren": false
    },
    {
      "id": "point-119",
      "type": "point",
      "level": 5,
      "title": "(1)a detection order concerning the dissemination of known child sexual abuse...",
      "summary": "Detection order issued to monitor sharing of child abuse content on service.",
      "hasChildren": false
    },
    {
      "id": "point-120",
      "type": "point",
      "level": 5,
      "title": "(2)the provider submitted a significant number of reports concerning known ch...",
      "summary": "Provider submitted multiple reports about detected child abuse material per Article 12.",
      "hasChildren": false
    },
    {
      "id": "paragraph-121",
      "type": "paragraph",
      "level": 4,
      "title": "7.As regards detection orders concerning the solicitation of children, the significant risk referred to in paragraph 4, first subparagraph, point (a), shall be deemed to exist where the following conditions are met:",
      "summary": "Child solicitation detection orders require specific conditions to establish significant risk.",
      "hasChildren": true
    },
    {
      "id": "point-122",
      "type": "point",
      "level": 5,
      "title": "(a)the provider qualifies as a provider of interpersonal communication services;",
      "summary": "Provider must qualify as interpersonal communication service provider.",
      "hasChildren": false
    },
    {
      "id": "point-123",
      "type": "point",
      "level": 5,
      "title": "(b)it is likely that, despite any mitigation measures that the provider may h...",
      "summary": "Service is significantly used to solicit children despite provider's protective measures.",
      "hasChildren": false
    },
    {
      "id": "point-124",
      "type": "point",
      "level": 5,
      "title": "(c)there is evidence of the service, or of a comparable service if the servic...",
      "summary": "Service must show evidence of child solicitation within past year involving child users.",
      "hasChildren": false
    },
    {
      "id": "paragraph-125",
      "type": "paragraph",
      "level": 4,
      "title": "8.The Coordinating Authority of establishment when requesting the issuance of detection orders, and the competent judicial or independent administrative authority when issuing the detection order, shall target and specify it in such a manner that the negative consequences referred to in paragraph 4, first subparagraph, point (b), remain limited to what is strictly necessary to effectively address the significant risk referred to in point (a) thereof.",
      "summary": "Detection orders must minimize negative impacts while addressing risks effectively.",
      "hasChildren": true
    },
    {
      "id": "point-126",
      "type": "point",
      "level": 5,
      "title": "(a)where that risk is limited to an identifiable part or component of a servi...",
      "summary": "Apply required measures only to specific service components containing identified risks.",
      "hasChildren": false
    },
    {
      "id": "point-127",
      "type": "point",
      "level": 5,
      "title": "(b)where necessary, in particular to limit such negative consequences, effect...",
      "summary": "Implement additional safeguards when needed to reduce negative impacts.",
      "hasChildren": false
    },
    {
      "id": "point-128",
      "type": "point",
      "level": 5,
      "title": "(c)subject to paragraph 9, the period of application remains limited to what ...",
      "summary": "Period of application must stay within necessary limits, per paragraph 9.",
      "hasChildren": false
    },
    {
      "id": "paragraph-129",
      "type": "paragraph",
      "level": 4,
      "title": "9.The competent judicial authority or independent administrative authority shall specify in the detection order the period during which it applies, indicating the start date and the end date.",
      "summary": "Detection orders must specify start and end dates within allowed timeframes.",
      "hasChildren": false
    },
    {
      "id": "article-130",
      "type": "article",
      "level": 3,
      "title": "Article 8: Additional rules regarding detection orders",
      "summary": "Detection orders: procedures and requirements for digital surveillance operations",
      "hasChildren": true
    },
    {
      "id": "paragraph-131",
      "type": "paragraph",
      "level": 4,
      "title": "1.The competent judicial authority or independent administrative authority shall issue the detection orders referred to in Article 7 using the template set out in Annex I. Detection orders shall include:",
      "summary": "Authorities must issue detection orders using template from Annex I.",
      "hasChildren": true
    },
    {
      "id": "point-132",
      "type": "point",
      "level": 5,
      "title": "(a)information regarding the measures to be taken to execute the detection or...",
      "summary": "Specify detection order details, execution steps, and reporting requirements for child abuse material monitoring.",
      "hasChildren": false
    },
    {
      "id": "point-133",
      "type": "point",
      "level": 5,
      "title": "(b)identification details of the competent judicial authority or the independ...",
      "summary": "Provide identification and authentication details of authority issuing the detection order.",
      "hasChildren": false
    },
    {
      "id": "point-134",
      "type": "point",
      "level": 5,
      "title": "(c)the name of the provider and, where applicable, its legal representative;",
      "summary": "Provider's name and legal representative must be included.",
      "hasChildren": false
    },
    {
      "id": "point-135",
      "type": "point",
      "level": 5,
      "title": "(d)the specific service in respect of which the detection order is issued and...",
      "summary": "Specify which service and components the detection order applies to.",
      "hasChildren": false
    },
    {
      "id": "point-136",
      "type": "point",
      "level": 5,
      "title": "(e)whether the detection order issued concerns the dissemination of known or ...",
      "summary": "Detection order specifies if content involves known/new abuse material or child solicitation.",
      "hasChildren": false
    },
    {
      "id": "point-137",
      "type": "point",
      "level": 5,
      "title": "(f)the start date and the end date of the detection order;",
      "summary": "Specify start and end dates for detection order.",
      "hasChildren": false
    },
    {
      "id": "point-138",
      "type": "point",
      "level": 5,
      "title": "(g)a sufficiently detailed statement of reasons explaining why the detection ...",
      "summary": "Explain detailed reasons for issuing detection order.",
      "hasChildren": false
    },
    {
      "id": "point-139",
      "type": "point",
      "level": 5,
      "title": "(h)a reference to this Regulation as the legal basis for the detection order;",
      "summary": "Detection order must cite this Regulation as its legal basis.",
      "hasChildren": false
    },
    {
      "id": "point-140",
      "type": "point",
      "level": 5,
      "title": "(i)the date, time stamp and electronic signature of the judicial or independe...",
      "summary": "Detection order must include date, timestamp and authority's electronic signature.",
      "hasChildren": false
    },
    {
      "id": "point-141",
      "type": "point",
      "level": 5,
      "title": "(j)easily understandable information about the redress available to the addre...",
      "summary": "Explain redress options and court appeal deadlines clearly to detection order recipients.",
      "hasChildren": false
    },
    {
      "id": "paragraph-142",
      "type": "paragraph",
      "level": 4,
      "title": "2.The competent judicial authority or independent administrative authority issuing the detection order shall address it to the main establishment of the provider or, where applicable, to its legal representative designated in accordance with Article 24.",
      "summary": "Detection orders must be sent to provider's main office or legal representative.",
      "hasChildren": false
    },
    {
      "id": "paragraph-143",
      "type": "paragraph",
      "level": 4,
      "title": "3.If the provider cannot execute the detection order because it contains manifest errors or does not contain sufficient information for its execution, the provider shall, without undue delay, request the necessary clarification to the Coordinating Authority of establishment, using the template set out in Annex II.",
      "summary": "Provider must request clarification from Authority if detection order has errors or lacks information.",
      "hasChildren": false
    },
    {
      "id": "paragraph-144",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Commission shall be empowered to adopt delegated acts in accordance with Article 86 in order to amend Annexes I and II where necessary to improve the templates in view of relevant technological developments or practical experiences gained.",
      "summary": "Commission can update Annexes I and II templates based on tech changes and experience.",
      "hasChildren": false
    },
    {
      "id": "article-145",
      "type": "article",
      "level": 3,
      "title": "Article 9: Redress, information, reporting and modification of detection orders",
      "summary": "Detection orders: rules for appeals, transparency, and making changes.",
      "hasChildren": true
    },
    {
      "id": "paragraph-146",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of hosting services and providers of interpersonal communications services that have received a detection order, as well as users affected by the measures taken to execute it, shall have a right to effective redress. That right shall include the right to challenge the detection order before the courts of the Member State of the competent judicial authority or independent administrative authority that issued the detection order.",
      "summary": "Service providers and affected users can challenge detection orders in issuing member state's courts.",
      "hasChildren": false
    },
    {
      "id": "paragraph-147",
      "type": "paragraph",
      "level": 4,
      "title": "2.When the detection order becomes final, the competent judicial authority or independent administrative authority that issued the detection order shall, without undue delay, transmit a copy thereof to the Coordinating Authority of establishment. The Coordinating Authority of establishment shall then, without undue delay, transmit a copy thereof to all other Coordinating Authorities through the system established in accordance with Article 39(2).",
      "summary": "Authority must share final detection orders with Coordinating Authority, who distributes to others.",
      "hasChildren": false
    },
    {
      "id": "paragraph-148",
      "type": "paragraph",
      "level": 4,
      "title": "3.Where the period of application of the detection order exceeds 12 months, or six months in the case of a detection order concerning the solicitation of children, the Coordinating Authority of establishment shall require the provider to report to it on the execution of the detection order at least once, halfway through the period of application.",
      "summary": "Providers must report on detection order execution halfway through orders exceeding 12 months (6 months for child solicitation).",
      "hasChildren": false
    },
    {
      "id": "paragraph-149",
      "type": "paragraph",
      "level": 4,
      "title": "4.In respect of the detection orders that the competent judicial authority or independent administrative authority issued at its request, the Coordinating Authority of establishment shall, where necessary and in any event following reception of the reports referred to in paragraph 3, assess whether any substantial changes to the grounds for issuing the detection orders occurred and, in particular, whether the conditions of Article 7(4) continue to be met. In that regard, it shall take account of additional mitigation measures that the provider may take to address the significant risk identified at the time of the issuance of the detection order.",
      "summary": "Authority must review detection orders for changes and assess if original conditions still apply.",
      "hasChildren": false
    },
    {
      "id": "article-150",
      "type": "article",
      "level": 3,
      "title": "Article 10: Technologies and safeguards",
      "summary": "Privacy protections and security measures for handling personal data.",
      "hasChildren": true
    },
    {
      "id": "paragraph-151",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of hosting services and providers of interpersonal communication services that have received a detection order shall execute it by installing and operating technologies to detect the dissemination of known or new child sexual abuse material or the solicitation of children, as applicable, using the corresponding indicators provided by the EU Centre in accordance with Article 46.",
      "summary": "Service providers must install detection technology to identify child abuse content using EU indicators.",
      "hasChildren": false
    },
    {
      "id": "paragraph-152",
      "type": "paragraph",
      "level": 4,
      "title": "2.The provider shall be entitled to acquire, install and operate, free of charge, technologies made available by the EU Centre in accordance with Article 50(1), for the sole purpose of executing the detection order. The provider shall not be required to use any specific technology, including those made available by the EU Centre, as long as the requirements set out in this Article are met. The use of the technologies made available by the EU Centre shall not affect the responsibility of the provider to comply with those requirements and for any decisions it may take in connection to or as a result of the use of the technologies.",
      "summary": "Providers can use free EU Centre tech but remain responsible for detection compliance.",
      "hasChildren": false
    },
    {
      "id": "paragraph-153",
      "type": "paragraph",
      "level": 4,
      "title": "3.The technologies shall be:",
      "summary": "List required technologies.",
      "hasChildren": true
    },
    {
      "id": "point-154",
      "type": "point",
      "level": 5,
      "title": "(a)effective in detecting the dissemination of known or new child sexual abus...",
      "summary": "Must detect sharing of child abuse content and child solicitation attempts.",
      "hasChildren": false
    },
    {
      "id": "point-155",
      "type": "point",
      "level": 5,
      "title": "(b)not be able to extract any other information from the relevant communicati...",
      "summary": "Only extract information needed to detect child abuse patterns using specified indicators.",
      "hasChildren": false
    },
    {
      "id": "point-156",
      "type": "point",
      "level": 5,
      "title": "(c)in accordance with the state of the art in the industry and the least intr...",
      "summary": "Use latest industry standards while minimizing privacy and data protection impacts.",
      "hasChildren": false
    },
    {
      "id": "point-157",
      "type": "point",
      "level": 5,
      "title": "(d)sufficiently reliable, in that they limit to the maximum extent possible t...",
      "summary": "Limit error rates in detection systems as much as possible.",
      "hasChildren": false
    },
    {
      "id": "paragraph-158",
      "type": "paragraph",
      "level": 4,
      "title": "4.The provider shall:",
      "summary": "Missing content to summarize. Please provide the actual requirements to be summarized.",
      "hasChildren": true
    },
    {
      "id": "point-159",
      "type": "point",
      "level": 5,
      "title": "(a)take all the necessary measures to ensure that the technologies and indica...",
      "summary": "Use technologies and data processing only to detect child abuse content and grooming.",
      "hasChildren": false
    },
    {
      "id": "point-160",
      "type": "point",
      "level": 5,
      "title": "(b)establish effective internal procedures to prevent and, where necessary, d...",
      "summary": "Create procedures to prevent, detect and fix data misuse and unauthorized access.",
      "hasChildren": false
    },
    {
      "id": "point-161",
      "type": "point",
      "level": 5,
      "title": "(c)ensure regular human oversight as necessary to ensure that the technologie...",
      "summary": "Maintain human oversight to monitor technology reliability and respond to potential errors/child solicitation.",
      "hasChildren": false
    },
    {
      "id": "point-162",
      "type": "point",
      "level": 5,
      "title": "(d)establish and operate an accessible, age-appropriate and user-friendly mec...",
      "summary": "Create user-friendly complaint system for service decisions and content removals.",
      "hasChildren": false
    },
    {
      "id": "point-163",
      "type": "point",
      "level": 5,
      "title": "(e)inform the Coordinating Authority, at the latest one month before the star...",
      "summary": "Notify Coordinating Authority about implementation measures one month before detection order start date.",
      "hasChildren": false
    },
    {
      "id": "point-164",
      "type": "point",
      "level": 5,
      "title": "(f)regularly review the functioning of the measures referred to in points (a)...",
      "summary": "Regularly review and adjust security measures, document process and include in reports.",
      "hasChildren": false
    },
    {
      "id": "paragraph-165",
      "type": "paragraph",
      "level": 4,
      "title": "5.The provider shall inform users in a clear, prominent and comprehensible way of the following:",
      "summary": "Providers must clearly inform users about child abuse detection systems and their legal rights.",
      "hasChildren": true
    },
    {
      "id": "point-166",
      "type": "point",
      "level": 5,
      "title": "(a)the fact that it operates technologies to detect online child sexual abuse...",
      "summary": "Company uses technology to detect child abuse while considering user privacy impact.",
      "hasChildren": false
    },
    {
      "id": "point-167",
      "type": "point",
      "level": 5,
      "title": "(b)the fact that it is required to report potential online child sexual abuse...",
      "summary": "Must report suspected online child abuse to EU Centre.",
      "hasChildren": false
    },
    {
      "id": "point-168",
      "type": "point",
      "level": 5,
      "title": "(c)the users’ right of judicial redress referred to in Article 9(1) and their...",
      "summary": "Users can seek legal action, submit complaints to providers and Coordinating Authority.",
      "hasChildren": false
    },
    {
      "id": "paragraph-169",
      "type": "paragraph",
      "level": 4,
      "title": "6.Where a provider detects potential online child sexual abuse through the measures taken to execute the detection order, it shall inform the users concerned without undue delay, after Europol or the national law enforcement authority of a Member State that received the report pursuant to Article 48 has confirmed that the information to the users would not interfere with activities for the prevention, detection, investigation and prosecution of child sexual abuse offences.",
      "summary": "Notify users of detected abuse after law enforcement confirms it won't impede investigations.",
      "hasChildren": false
    },
    {
      "id": "article-170",
      "type": "article",
      "level": 3,
      "title": "Article 11: Guidelines regarding detection obligations",
      "summary": "Online platforms must detect and remove illegal content and disinformation.",
      "hasChildren": true
    },
    {
      "id": "paragraph-171",
      "type": "paragraph",
      "level": 4,
      "title": "The Commission, in cooperation with the Coordinating Authorities and the EU Centre and after havi...",
      "summary": "Commission may issue guidelines on Articles 7-10 after public consultation.",
      "hasChildren": false
    },
    {
      "id": "section-172",
      "type": "section",
      "level": 2,
      "title": "Section 3",
      "summary": "I don't see any content to summarize after \"Section 3\". Could you please provide the content you'd like me to summarize?",
      "hasChildren": true
    },
    {
      "id": "article-173",
      "type": "article",
      "level": 3,
      "title": "Article 12: Reporting obligations",
      "summary": "Member states must report data on waste collection and recycling.",
      "hasChildren": true
    },
    {
      "id": "paragraph-174",
      "type": "paragraph",
      "level": 4,
      "title": "1.Where a provider of hosting services or a provider of interpersonal communications services becomes aware in any manner other than through a removal order issued in accordance with this Regulation of any information indicating potential online child sexual abuse on its services, it shall promptly submit a report thereon to the EU Centre in accordance with Article 13. It shall do so through the system established in accordance with Article 39(2).",
      "summary": "Service providers must report potential child abuse content to EU Centre when discovered.",
      "hasChildren": false
    },
    {
      "id": "paragraph-175",
      "type": "paragraph",
      "level": 4,
      "title": "2.Where the provider submits a report pursuant to paragraph 1, it shall inform the user concerned, providing information on the main content of the report, on the manner in which the provider has become aware of the potential child sexual abuse concerned, on the follow-up given to the report insofar as such information is available to the provider and on the user’s possibilities of redress, including on the right to submit complaints to the Coordinating Authority in accordance with Article 34.",
      "summary": "Provider must inform user about abuse report details and available complaint options.",
      "hasChildren": false
    },
    {
      "id": "paragraph-176",
      "type": "paragraph",
      "level": 4,
      "title": "3.The provider shall establish and operate an accessible, age-appropriate and user-friendly mechanism that allows users to flag to the provider potential online child sexual abuse on the service.",
      "summary": "Create user-friendly system for reporting suspected child abuse content.",
      "hasChildren": false
    },
    {
      "id": "article-177",
      "type": "article",
      "level": 3,
      "title": "Article 13",
      "summary": "I need the actual article content to provide a concise summary. The text \"Article 13\" alone doesn't give me enough information to summarize. Please share the article you'd like me to summarize and I'll provide a 10-word or less summary following your requirements.",
      "hasChildren": true
    },
    {
      "id": "paragraph-178",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of hosting services and providers of interpersonal communications services shall submit the report referred to in Article 12 using the template set out in Annex III. The report shall include:",
      "summary": "Hosting and communication providers must submit Article 12 report using Annex III template.",
      "hasChildren": true
    },
    {
      "id": "point-179",
      "type": "point",
      "level": 5,
      "title": "(a)identification details of the provider and, where applicable, its legal re...",
      "summary": "Provider and legal representative identification details required.",
      "hasChildren": false
    },
    {
      "id": "point-180",
      "type": "point",
      "level": 5,
      "title": "(b)the date, time stamp and electronic signature of the provider;",
      "summary": "Provider must include date, timestamp and electronic signature.",
      "hasChildren": false
    },
    {
      "id": "point-181",
      "type": "point",
      "level": 5,
      "title": "(c)all content data, including images, videos and text;",
      "summary": "All content data including images, videos and text",
      "hasChildren": false
    },
    {
      "id": "point-182",
      "type": "point",
      "level": 5,
      "title": "(d)all available data other than content data related to the potential online...",
      "summary": "Provide all non-content data about potential online child abuse.",
      "hasChildren": false
    },
    {
      "id": "point-183",
      "type": "point",
      "level": 5,
      "title": "(e)whether the potential online child sexual abuse concerns the dissemination...",
      "summary": "Determine if abuse involves sharing existing/new abuse material or soliciting children.",
      "hasChildren": false
    },
    {
      "id": "point-184",
      "type": "point",
      "level": 5,
      "title": "(f)information concerning the geographic location related to the potential on...",
      "summary": "Geographic location details like IP address for potential online child abuse cases.",
      "hasChildren": false
    },
    {
      "id": "point-185",
      "type": "point",
      "level": 5,
      "title": "(g)information concerning the identity of any user involved in the potential ...",
      "summary": "Identify users connected to potential online child abuse cases.",
      "hasChildren": false
    },
    {
      "id": "point-186",
      "type": "point",
      "level": 5,
      "title": "(h)whether the provider has also reported, or will also report, the potential...",
      "summary": "Confirm if provider reported child abuse to foreign authorities and specify which ones.",
      "hasChildren": false
    },
    {
      "id": "point-187",
      "type": "point",
      "level": 5,
      "title": "(i)where the potential online child sexual abuse concerns the dissemination o...",
      "summary": "Provider must remove or block access to known/new child sexual abuse content.",
      "hasChildren": false
    },
    {
      "id": "point-188",
      "type": "point",
      "level": 5,
      "title": "(j)whether the provider considers that the report requires urgent action;",
      "summary": "State if report needs immediate action.",
      "hasChildren": false
    },
    {
      "id": "point-189",
      "type": "point",
      "level": 5,
      "title": "(k)a reference to this Regulation as the legal basis for reporting.",
      "summary": "Include this Regulation as reporting's legal basis.",
      "hasChildren": false
    },
    {
      "id": "paragraph-190",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Commission shall be empowered to adopt delegated acts in accordance with Article 86 in order to amend Annex III to improve the template where necessary in view of relevant technological developments or practical experiences gained.",
      "summary": "Commission can update Annex III template based on new technology and practical experience.",
      "hasChildren": false
    },
    {
      "id": "article-191",
      "type": "article",
      "level": 3,
      "title": "Article 14: Removal orders",
      "summary": "Content removal requirements and procedures for digital service providers.",
      "hasChildren": true
    },
    {
      "id": "paragraph-192",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Coordinating Authority of establishment shall have the power to request the competent judicial authority of the Member State that designated it or another independent administrative authority of that Member State to issue a removal order requiring a provider of hosting services under the jurisdiction of the Member State that designated that Coordinating Authority to remove or disable access in all Member States of one or more specific items of material that, after a diligent assessment, the Coordinating Authority or the courts or other independent administrative authorities referred to in Article 36(1) identified as constituting child sexual abuse material.",
      "summary": "Authorities can order hosting providers to remove child sexual abuse material across Member States.",
      "hasChildren": false
    },
    {
      "id": "paragraph-193",
      "type": "paragraph",
      "level": 4,
      "title": "2.The provider shall execute the removal order as soon as possible and in any event within 24 hours of receipt thereof.",
      "summary": "Provider must remove content within 24 hours of receiving order.",
      "hasChildren": false
    },
    {
      "id": "paragraph-194",
      "type": "paragraph",
      "level": 4,
      "title": "3.The competent judicial authority or the independent administrative authority shall issue a removal order using the template set out in Annex IV. Removal orders shall include:",
      "summary": "Authorities must issue removal orders using Annex IV template with specified identification details.",
      "hasChildren": true
    },
    {
      "id": "point-195",
      "type": "point",
      "level": 5,
      "title": "(a)identification details of the judicial or independent administrative autho...",
      "summary": "Include ID details and authentication from authority issuing removal order.",
      "hasChildren": false
    },
    {
      "id": "point-196",
      "type": "point",
      "level": 5,
      "title": "(b)the name of the provider and, where applicable, of its legal representative;",
      "summary": "Provider's name and legal representative must be included.",
      "hasChildren": false
    },
    {
      "id": "point-197",
      "type": "point",
      "level": 5,
      "title": "(c)the specific service for which the removal order is issued;",
      "summary": "State which service the removal order applies to.",
      "hasChildren": false
    },
    {
      "id": "point-198",
      "type": "point",
      "level": 5,
      "title": "(d)a sufficiently detailed statement of reasons explaining why the removal or...",
      "summary": "Explain specifically why content qualifies as child sexual abuse material.",
      "hasChildren": false
    },
    {
      "id": "point-199",
      "type": "point",
      "level": 5,
      "title": "(e)an exact uniform resource locator and, where necessary, additional informa...",
      "summary": "Provide exact URL and details to identify child abuse material.",
      "hasChildren": false
    },
    {
      "id": "point-200",
      "type": "point",
      "level": 5,
      "title": "(f)where applicable, the information about non-disclosure during a specified ...",
      "summary": "Disclose information about non-disclosure periods as required by Article 15(4)(c).",
      "hasChildren": false
    },
    {
      "id": "point-201",
      "type": "point",
      "level": 5,
      "title": "(g)a reference to this Regulation as the legal basis for the removal order;",
      "summary": "Must cite this Regulation when issuing removal orders.",
      "hasChildren": false
    },
    {
      "id": "point-202",
      "type": "point",
      "level": 5,
      "title": "(h)the date, time stamp and electronic signature of the judicial or independe...",
      "summary": "Document must include date, timestamp and authority's electronic signature.",
      "hasChildren": false
    },
    {
      "id": "point-203",
      "type": "point",
      "level": 5,
      "title": "(i)easily understandable information about the redress available to the addre...",
      "summary": "Explain available legal appeals process and deadlines for removal order recipients.",
      "hasChildren": false
    },
    {
      "id": "paragraph-204",
      "type": "paragraph",
      "level": 4,
      "title": "4.The judicial authority or the independent administrative issuing the removal order shall address it to the main establishment of the provider or, where applicable, to its legal representative designated in accordance with Article 24.",
      "summary": "Authorities must send removal orders to provider's main office or legal representative.",
      "hasChildren": false
    },
    {
      "id": "paragraph-205",
      "type": "paragraph",
      "level": 4,
      "title": "5.If the provider cannot execute the removal order on grounds of force majeure or de facto impossibility not attributable to it, including for objectively justifiable technical or operational reasons, it shall, without undue delay, inform the Coordinating Authority of establishment of those grounds, using the template set out in Annex V.",
      "summary": "Notify authority immediately if removal order cannot be executed due to technical issues.",
      "hasChildren": false
    },
    {
      "id": "paragraph-206",
      "type": "paragraph",
      "level": 4,
      "title": "6.If the provider cannot execute the removal order because it contains manifest errors or does not contain sufficient information for its execution, it shall, without undue delay, request the necessary clarification to the Coordinating Authority of establishment, using the template set out in Annex V.",
      "summary": "Request clarification from Authority if removal order has errors or lacks information.",
      "hasChildren": false
    },
    {
      "id": "paragraph-207",
      "type": "paragraph",
      "level": 4,
      "title": "7.The provider shall, without undue delay and using the template set out in Annex VI, inform the Coordinating Authority of establishment and the EU Centre, of the measures taken to execute the removal order, indicating, in particular, whether the provider removed the child sexual abuse material or disabled access thereto in all Member States and the date and time thereof.",
      "summary": "Provider must report CSAM removal actions and timing to authorities using Annex VI template.",
      "hasChildren": false
    },
    {
      "id": "paragraph-208",
      "type": "paragraph",
      "level": 4,
      "title": "8.The Commission shall be empowered to adopt delegated acts in accordance with Article 86 in order to amend Annexes IV, V and VI where necessary to improve the templates in view of relevant technological developments or practical experiences gained.",
      "summary": "Commission can update Annexes 4-6 templates based on tech advances and experience.",
      "hasChildren": false
    },
    {
      "id": "article-209",
      "type": "article",
      "level": 3,
      "title": "Article 15: Redress and provision of information",
      "summary": "Data privacy rights: requesting corrections and accessing personal information.",
      "hasChildren": true
    },
    {
      "id": "paragraph-210",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of hosting services that have received a removal order issued in accordance with Article 14, as well as the users who provided the material, shall have the right to an effective redress. That right shall include the right to challenge such a removal order before the courts of the Member State of the competent judicial authority or independent administrative authority that issued the removal order.",
      "summary": "Hosting providers and users can challenge removal orders in issuing member state's courts.",
      "hasChildren": false
    },
    {
      "id": "paragraph-211",
      "type": "paragraph",
      "level": 4,
      "title": "2.When the removal order becomes final, the competent judicial authority or independent administrative authority that issued the removal order shall, without undue delay, transmit a copy thereof to the Coordinating Authority of establishment. The Coordinating Authority of establishment shall then, without undue delay, transmit a copy thereof to all other Coordinating Authorities through the system established in accordance with Article 39(2).",
      "summary": "Authorities must share final removal orders with all Coordinating Authorities through official system.",
      "hasChildren": false
    },
    {
      "id": "paragraph-212",
      "type": "paragraph",
      "level": 4,
      "title": "3.Where a provider removes or disables access to child sexual abuse material pursuant to a removal order issued in accordance with Article 14, it shall without undue delay, inform the user who provided the material of the following:",
      "summary": "Provider must notify user when removing child abuse content after receiving removal order.",
      "hasChildren": true
    },
    {
      "id": "point-213",
      "type": "point",
      "level": 5,
      "title": "(a)the fact that it removed the material or disabled access thereto;",
      "summary": "Removed content or blocked access to it.",
      "hasChildren": false
    },
    {
      "id": "point-214",
      "type": "point",
      "level": 5,
      "title": "(b)the reasons for the removal or disabling, providing a copy of the removal ...",
      "summary": "Provide removal reasons and copy of removal order when user requests it.",
      "hasChildren": false
    },
    {
      "id": "point-215",
      "type": "point",
      "level": 5,
      "title": "(c)the users’ rights of judicial redress referred to in paragraph 1 and to su...",
      "summary": "Users can seek judicial redress and submit complaints to Coordinating Authority.",
      "hasChildren": false
    },
    {
      "id": "paragraph-216",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Coordinating Authority of establishment may request, when requesting the judicial authority or independent administrative authority issuing the removal order, and after having consulted with relevant public authorities, that the provider is not to disclose any information regarding the removal of or disabling of access to the child sexual abuse material, where and to the extent necessary to avoid interfering with activities for the prevention, detection, investigation and prosecution of child sexual abuse offences.",
      "summary": "Authority can require providers keep CSAM removal confidential to protect ongoing investigations.",
      "hasChildren": true
    },
    {
      "id": "point-217",
      "type": "point",
      "level": 5,
      "title": "(a)the judicial authority or independent administrative authority issuing the...",
      "summary": "Authority sets non-disclosure period up to 6 weeks for removal orders.",
      "hasChildren": false
    },
    {
      "id": "point-218",
      "type": "point",
      "level": 5,
      "title": "(b)the obligations set out in paragraph 3 shall not apply during that time pe...",
      "summary": "Paragraph 3 obligations suspended during specified timeframe.",
      "hasChildren": false
    },
    {
      "id": "point-219",
      "type": "point",
      "level": 5,
      "title": "(c)that judicial authority or independent administrative authority shall info...",
      "summary": "Authority must notify provider of decision and timeline for blocking requirements.",
      "hasChildren": false
    },
    {
      "id": "article-220",
      "type": "article",
      "level": 3,
      "title": "Article 16: Blocking orders",
      "summary": "Court orders to block illegal content and prevent future infringement.",
      "hasChildren": true
    },
    {
      "id": "paragraph-221",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Coordinating Authority of establishment shall have the power to request the competent judicial authority of the Member State that designated it or an independent administrative authority of that Member State to issue a blocking order requiring a provider of internet access services under the jurisdiction of that Member State to take reasonable measures to prevent users from accessing known child sexual abuse material indicated by all uniform resource locators on the list of uniform resource locators included in the database of indicators, in accordance with Article 44(2), point (b) and provided by the EU Centre.",
      "summary": "Authorities can order internet providers to block URLs containing child abuse material.",
      "hasChildren": false
    },
    {
      "id": "paragraph-222",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Coordinating Authority of establishment shall, before requesting the issuance of a blocking order, carry out all investigations and assessments necessary to determine whether the conditions of paragraph 4 have been met.",
      "summary": "Authority must investigate and verify paragraph 4 conditions before requesting blocking order.",
      "hasChildren": true
    },
    {
      "id": "point-223",
      "type": "point",
      "level": 5,
      "title": "(a)verify that, in respect of all or a representative sample of the uniform r...",
      "summary": "Verify URLs for child abuse content and request blocking orders if specific conditions met.",
      "hasChildren": false
    },
    {
      "id": "point-224",
      "type": "point",
      "level": 5,
      "title": "(b)require the provider to submit, within a reasonable time period set by tha...",
      "summary": "Provider must submit information about CSAM access, policies, and company capabilities when requested.",
      "hasChildren": false
    },
    {
      "id": "point-225",
      "type": "point",
      "level": 5,
      "title": "(c)request the EU Centre to provide the necessary information, in particular ...",
      "summary": "Request EU Centre verify accuracy of URLs indicating child abuse material and related audits.",
      "hasChildren": false
    },
    {
      "id": "point-226",
      "type": "point",
      "level": 5,
      "title": "(d)request any other relevant public authority or relevant experts or entitie...",
      "summary": "Request information from relevant authorities, experts, or entities.",
      "hasChildren": false
    },
    {
      "id": "paragraph-227",
      "type": "paragraph",
      "level": 4,
      "title": "3.The Coordinating Authority of establishment shall, before requesting the issuance of the blocking order, inform the provider of its intention to request the issuance of the blocking order, specifying the main elements of the content of the intended blocking order and the reasons to request the blocking order. It shall afford the provider an opportunity to comment on that information, within a reasonable time period set by that Coordinating Authority.",
      "summary": "Authority must notify provider about blocking order and allow time for response.",
      "hasChildren": false
    },
    {
      "id": "paragraph-228",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Coordinating Authority of establishment shall request the issuance of the blocking order, and the competent judicial authority or independent authority shall issue the blocking order, where it considers that the following conditions are met:",
      "summary": "Coordinating Authority requests blocking order; judicial authority issues if conditions met.",
      "hasChildren": true
    },
    {
      "id": "point-229",
      "type": "point",
      "level": 5,
      "title": "(a)there is evidence of the service having been used during the past 12 month...",
      "summary": "Service accessed child abuse content via URLs within past 12 months.",
      "hasChildren": false
    },
    {
      "id": "point-230",
      "type": "point",
      "level": 5,
      "title": "(b)the blocking order is necessary to prevent the dissemination of the child ...",
      "summary": "Blocking order needed to prevent sharing of child abuse content in EU.",
      "hasChildren": false
    },
    {
      "id": "point-231",
      "type": "point",
      "level": 5,
      "title": "(c)the uniform resource locators indicate, in a sufficiently reliable manner,...",
      "summary": "URLs must reliably identify child sexual abuse content.",
      "hasChildren": false
    },
    {
      "id": "point-232",
      "type": "point",
      "level": 5,
      "title": "(d)the reasons for issuing the blocking order outweigh negative consequences ...",
      "summary": "Benefits of blocking must exceed harm to affected parties' rights and interests.",
      "hasChildren": false
    },
    {
      "id": "paragraph-233",
      "type": "paragraph",
      "level": 4,
      "title": "5.The Coordinating Authority of establishment when requesting the issuance of blocking orders, and the competent judicial or independent administrative authority when issuing the blocking order, shall:",
      "summary": "Authorities must follow specific rules when requesting or issuing content blocking orders.",
      "hasChildren": true
    },
    {
      "id": "point-234",
      "type": "point",
      "level": 5,
      "title": "(a)specify effective and proportionate limits and safeguards necessary to ens...",
      "summary": "Set clear boundaries and protections to minimize negative impacts.",
      "hasChildren": false
    },
    {
      "id": "point-235",
      "type": "point",
      "level": 5,
      "title": "(b)subject to paragraph 6, ensure that the period of application remains limi...",
      "summary": "Keep application period as short as strictly needed, per paragraph 6.",
      "hasChildren": false
    },
    {
      "id": "paragraph-236",
      "type": "paragraph",
      "level": 4,
      "title": "6.The Coordinating Authority shall specify in the blocking order the period during which it applies, indicating the start date and the end date.",
      "summary": "Blocking orders must specify start and end dates, maximum duration 5 years.",
      "hasChildren": false
    },
    {
      "id": "paragraph-237",
      "type": "paragraph",
      "level": 4,
      "title": "7.In respect of the blocking orders that the competent judicial authority or independent administrative authority issued at its request, the Coordinating Authority shall, where necessary and at least once every year, assess whether any substantial changes to the grounds for issuing the blocking orders occurred and, in particular, whether the conditions of paragraph 4 continue to be met.",
      "summary": "Coordinating Authority must annually review blocking orders to check if original conditions still apply.",
      "hasChildren": false
    },
    {
      "id": "article-238",
      "type": "article",
      "level": 3,
      "title": "Article 17: Additional rules regarding blocking orders",
      "summary": "Regulations for issuing and enforcing online content blocking orders.",
      "hasChildren": true
    },
    {
      "id": "paragraph-239",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Coordinating Authority of establishment shall issue the blocking orders referred to in Article 16 using the template set out in Annex VII. Blocking orders shall include:",
      "summary": "Coordinating Authority must issue blocking orders using Annex VII template with specified details.",
      "hasChildren": true
    },
    {
      "id": "point-240",
      "type": "point",
      "level": 5,
      "title": "(a)the reference to the list of uniform resource locators, provided by the EU...",
      "summary": "EU Centre's URL list, safeguards, limits, and reporting requirements.",
      "hasChildren": false
    },
    {
      "id": "point-241",
      "type": "point",
      "level": 5,
      "title": "(b)identification details of the competent judicial authority or the independ...",
      "summary": "Provide identification and authentication of authority issuing the blocking order.",
      "hasChildren": false
    },
    {
      "id": "point-242",
      "type": "point",
      "level": 5,
      "title": "(c)the name of the provider and, where applicable, its legal representative;",
      "summary": "Provider's name and legal representative must be included.",
      "hasChildren": false
    },
    {
      "id": "point-243",
      "type": "point",
      "level": 5,
      "title": "(d)the specific service in respect of which the detection order is issued;",
      "summary": "State which service the detection order applies to.",
      "hasChildren": false
    },
    {
      "id": "point-244",
      "type": "point",
      "level": 5,
      "title": "(e)the start date and the end date of the blocking order;",
      "summary": "Specify when blocking order starts and ends.",
      "hasChildren": false
    },
    {
      "id": "point-245",
      "type": "point",
      "level": 5,
      "title": "(f)a sufficiently detailed statement of reasons explaining why the blocking o...",
      "summary": "Explain clearly why content was blocked.",
      "hasChildren": false
    },
    {
      "id": "point-246",
      "type": "point",
      "level": 5,
      "title": "(g)a reference to this Regulation as the legal basis for the blocking order;",
      "summary": "Must cite this Regulation when issuing blocking orders.",
      "hasChildren": false
    },
    {
      "id": "point-247",
      "type": "point",
      "level": 5,
      "title": "(h)the date, time stamp and electronic signature of the judicial authority or...",
      "summary": "Judicial authority must provide date, timestamp and electronic signature on blocking orders.",
      "hasChildren": false
    },
    {
      "id": "point-248",
      "type": "point",
      "level": 5,
      "title": "(i)easily understandable information about the redress available to the addre...",
      "summary": "Explain redress options and court appeal deadlines for blocking order recipients.",
      "hasChildren": false
    },
    {
      "id": "paragraph-249",
      "type": "paragraph",
      "level": 4,
      "title": "2.The competent judicial authority or independent administrative authority issuing the blocking order shall address it to the main establishment of the provider or, where applicable, to its legal representative designated in accordance with Article 24.",
      "summary": "Blocking orders must be sent to provider's main office or designated legal representative.",
      "hasChildren": false
    },
    {
      "id": "paragraph-250",
      "type": "paragraph",
      "level": 4,
      "title": "3.The blocking order shall be transmitted to the provider’s point of contact referred to in Article 23(1), to the Coordinating Authority of establishment and to the EU Centre, through the system established in accordance with Article 39(2).",
      "summary": "Send blocking order to provider contact, Coordinating Authority, and EU Centre via Article 39 system.",
      "hasChildren": false
    },
    {
      "id": "paragraph-251",
      "type": "paragraph",
      "level": 4,
      "title": "4.The blocking order shall be drafted in the language declared by the provider pursuant to Article 23(3).",
      "summary": "Blocking order must use language previously specified by provider under Article 23(3).",
      "hasChildren": false
    },
    {
      "id": "paragraph-252",
      "type": "paragraph",
      "level": 4,
      "title": "5.If the provider cannot execute the blocking order because it contains manifest errors or does not contain sufficient information for its execution, the provider shall, without undue delay, request the necessary clarification to the Coordinating Authority of establishment, using the template set out in Annex VIII.",
      "summary": "Request clarification from Authority if blocking order has errors or lacks information.",
      "hasChildren": false
    },
    {
      "id": "paragraph-253",
      "type": "paragraph",
      "level": 4,
      "title": "6.The Commission shall be empowered to adopt delegated acts in accordance with Article 86 in order to amend Annexes VII and VIII where necessary to improve the templates in view of relevant technological developments or practical experiences gained.",
      "summary": "Commission can update Annexes 7-8 templates based on tech changes and experience.",
      "hasChildren": false
    },
    {
      "id": "article-254",
      "type": "article",
      "level": 3,
      "title": "Article 18: Redress, information and reporting of blocking orders",
      "summary": "Procedures for appealing content blocks and reporting transparency requirements.",
      "hasChildren": true
    },
    {
      "id": "paragraph-255",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of internet access services that have received a blocking order, as well as users who provided or were prevented from accessing a specific item of material indicated by the uniform resource locators in execution of such orders, shall have a right to effective redress. That right shall include the right to challenge the blocking order before the courts of the Member State of the competent judicial authority or independent administrative authority that issued the blocking order.",
      "summary": "Internet providers and users can challenge website blocking orders in issuing country's courts.",
      "hasChildren": false
    },
    {
      "id": "paragraph-256",
      "type": "paragraph",
      "level": 4,
      "title": "2.When the blocking order becomes final, the competent judicial authority or independent administrative authority that issued the blocking order shall, without undue delay, transmit a copy thereof to the Coordinating Authority of establishment. The Coordinating Authority of establishment shall then, without undue delay, transmit a copy thereof to all other Coordinating Authorities through the system established in accordance with Article 39(2).",
      "summary": "Authorities must share final blocking orders with all Coordinating Authorities through official system.",
      "hasChildren": false
    },
    {
      "id": "paragraph-257",
      "type": "paragraph",
      "level": 4,
      "title": "3.The provider shall establish and operate an accessible, age-appropriate and user-friendly mechanism that allows users to submit to it, within a reasonable timeframe, complaints about alleged infringements of its obligations under this Section. It shall process such complaints in an objective, effective and timely manner.",
      "summary": "Create accessible complaint system for users to report violations and process complaints fairly.",
      "hasChildren": false
    },
    {
      "id": "paragraph-258",
      "type": "paragraph",
      "level": 4,
      "title": "4.Where a provider prevents users from accessing the uniform resource locators pursuant to a blocking order issued in accordance with Article 17, it shall take reasonable measures to inform the users of the following:",
      "summary": "Providers must notify users when URLs are blocked under Article 17 orders.",
      "hasChildren": true
    },
    {
      "id": "point-259",
      "type": "point",
      "level": 5,
      "title": "(a)the fact that it does so pursuant to a blocking order;",
      "summary": "Action taken due to blocking order.",
      "hasChildren": false
    },
    {
      "id": "point-260",
      "type": "point",
      "level": 5,
      "title": "(b)the reasons for doing so, providing, upon request, a copy of the blocking ...",
      "summary": "Provide blocking order reasons and copy when requested.",
      "hasChildren": false
    },
    {
      "id": "point-261",
      "type": "point",
      "level": 5,
      "title": "(c)the users’ right of judicial redress referred to in paragraph 1, their rig...",
      "summary": "Users can seek legal action, file complaints with providers and authorities, and submit requests.",
      "hasChildren": false
    },
    {
      "id": "paragraph-262",
      "type": "paragraph",
      "level": 4,
      "title": "5.The provider and the users referred to in paragraph 1 shall be entitled to request the Coordinating Authority that requested the issuance of the blocking order to assess whether users are wrongly prevented from accessing a specific item of material indicated by uniform resource locators pursuant to the blocking order. The provider shall also be entitled to request modification or revocation of the blocking order, where it considers it necessary due to substantial changes to the grounds for issuing the blocking orders that occurred after the issuance thereof, in particular substantial changes preventing the provider from taking the required reasonable measures to execute the blocking order,",
      "summary": "Providers and users can request review, modification or removal of incorrect URL blocking orders.",
      "hasChildren": false
    },
    {
      "id": "paragraph-263",
      "type": "paragraph",
      "level": 4,
      "title": "6.Where the period of application of the blocking order exceeds 24 months, the Coordinating Authority of establishment shall require the provider to report to it on the measures taken to execute the blocking order, including the safeguards provided for, at least once, halfway through the period of application.",
      "summary": "Providers must report blocking order execution measures halfway through orders lasting over 24 months.",
      "hasChildren": false
    },
    {
      "id": "article-264",
      "type": "article",
      "level": 3,
      "title": "Article 19: Liability of providers",
      "summary": "Online platform liability rules and obligations for illegal content.",
      "hasChildren": true
    },
    {
      "id": "paragraph-265",
      "type": "paragraph",
      "level": 4,
      "title": "Providers of relevant information society services shall not be liable for child sexual abuse off...",
      "summary": "Online service providers not liable when detecting/reporting child abuse in good faith.",
      "hasChildren": false
    },
    {
      "id": "article-266",
      "type": "article",
      "level": 3,
      "title": "Article 20: Victims’ right to information",
      "summary": "Victims must receive updates about criminal proceedings and offender status.",
      "hasChildren": true
    },
    {
      "id": "paragraph-267",
      "type": "paragraph",
      "level": 4,
      "title": "1.Persons residing in the Union shall have the right to receive, upon their request, from the Coordinating Authority designated by the Member State where they reside, information regarding any instances where the dissemination of known child sexual abuse material depicting them is reported to the EU Centre pursuant to Article 12. Persons with disabilities shall have the right to ask and receive such an information in a manner accessible to them.",
      "summary": "EU residents can request information about reported CSAM depicting them from national authorities.",
      "hasChildren": false
    },
    {
      "id": "paragraph-268",
      "type": "paragraph",
      "level": 4,
      "title": "2.The request referred to in paragraph 1 shall indicate:",
      "summary": "List required information in previous paragraph's request.",
      "hasChildren": true
    },
    {
      "id": "point-269",
      "type": "point",
      "level": 5,
      "title": "(a)the relevant item or items of known child sexual abuse material;",
      "summary": "Identified items of confirmed child sexual abuse content.",
      "hasChildren": false
    },
    {
      "id": "point-270",
      "type": "point",
      "level": 5,
      "title": "(b)where applicable, the individual or entity that is to receive the informat...",
      "summary": "Specify who will receive information on behalf of the requester.",
      "hasChildren": false
    },
    {
      "id": "point-271",
      "type": "point",
      "level": 5,
      "title": "(c)sufficient elements to demonstrate the identity of the person making the r...",
      "summary": "Must provide enough information to verify requester's identity.",
      "hasChildren": false
    },
    {
      "id": "paragraph-272",
      "type": "paragraph",
      "level": 4,
      "title": "3.The information referred to in paragraph 1 shall include:",
      "summary": "Required information includes provider ID, report date, EU Centre forwarding status, and removal status.",
      "hasChildren": true
    },
    {
      "id": "point-273",
      "type": "point",
      "level": 5,
      "title": "(a)the identification of the provider that submitted the report;",
      "summary": "Identify who submitted the report.",
      "hasChildren": false
    },
    {
      "id": "point-274",
      "type": "point",
      "level": 5,
      "title": "(b)the date of the report;",
      "summary": "Include the report date.",
      "hasChildren": false
    },
    {
      "id": "point-275",
      "type": "point",
      "level": 5,
      "title": "(c)whether the EU Centre forwarded the report in accordance with Article 48(3...",
      "summary": "Did EU Centre send report per Article 48(3) and to which authorities?",
      "hasChildren": false
    },
    {
      "id": "point-276",
      "type": "point",
      "level": 5,
      "title": "(d)whether the provider reported having removed or disabled access to the mat...",
      "summary": "Did provider report removing or blocking access to the material",
      "hasChildren": false
    },
    {
      "id": "article-277",
      "type": "article",
      "level": 3,
      "title": "Article 21: Victims’ right of assistance and support for removal",
      "summary": "Victim support services for leaving trafficking and exploitation situations.",
      "hasChildren": true
    },
    {
      "id": "paragraph-278",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of hosting services shall provide reasonable assistance, on request, to persons residing in the Union that seek to have one or more specific items of known child sexual abuse material depicting them removed or to have access thereto disabled by the provider.",
      "summary": "Hosting providers must help EU residents remove child abuse material depicting themselves.",
      "hasChildren": false
    },
    {
      "id": "paragraph-279",
      "type": "paragraph",
      "level": 4,
      "title": "2.Persons residing in the Union shall have the right to receive, upon their request, from the Coordinating Authority designated by the Member State where the person resides, support from the EU Centre when they seek to have a provider of hosting services remove or disable access to one or more specific items of known child sexual abuse material depicting them. Persons with disabilities shall have the right to ask and receive any information relating to such support in a manner accessible to them.",
      "summary": "EU residents can request help removing online child abuse material depicting themselves.",
      "hasChildren": false
    },
    {
      "id": "paragraph-280",
      "type": "paragraph",
      "level": 4,
      "title": "3.The requests referred to in paragraphs 1 and 2 shall indicate the relevant item or items of child sexual abuse material.",
      "summary": "Requests must specify which child sexual abuse materials are involved.",
      "hasChildren": false
    },
    {
      "id": "paragraph-281",
      "type": "paragraph",
      "level": 4,
      "title": "4.The EU Centre’s support referred to in paragraph 2 shall include, as applicable:",
      "summary": "EU Centre provides support services mentioned in paragraph 2.",
      "hasChildren": true
    },
    {
      "id": "point-282",
      "type": "point",
      "level": 5,
      "title": "(a)support in connection to requesting the provider’s assistance referred to ...",
      "summary": "Request provider support mentioned in paragraph 1",
      "hasChildren": false
    },
    {
      "id": "point-283",
      "type": "point",
      "level": 5,
      "title": "(b)verifying whether the provider removed or disabled access to that item or ...",
      "summary": "Check if provider blocked or removed flagged content through required searches.",
      "hasChildren": false
    },
    {
      "id": "point-284",
      "type": "point",
      "level": 5,
      "title": "(c)notifying the item or items of known child sexual abuse material depicting...",
      "summary": "Notify provider about abusive content and request removal or access disabling.",
      "hasChildren": false
    },
    {
      "id": "point-285",
      "type": "point",
      "level": 5,
      "title": "(d)where necessary, informing the Coordinating Authority of establishment of ...",
      "summary": "Notify Authority when items are found, so they can issue removal orders.",
      "hasChildren": false
    },
    {
      "id": "article-286",
      "type": "article",
      "level": 3,
      "title": "Article 22: Preservation of information",
      "summary": "Records management and data retention policies for business operations.",
      "hasChildren": true
    },
    {
      "id": "paragraph-287",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of hosting services and providers of interpersonal communications services shall preserve the content data and other data processed in connection to the measures taken to comply with this Regulation and the personal data generated through such processing, only for one or more of the following purposes, as applicable:",
      "summary": "Hosting and communication providers must save content data only for specified regulatory purposes.",
      "hasChildren": true
    },
    {
      "id": "point-288",
      "type": "point",
      "level": 5,
      "title": "(a)executing a detection order issued pursuant to Article 7, or a removal ord...",
      "summary": "Execute detection orders from Article 7 or removal orders from Article 14.",
      "hasChildren": false
    },
    {
      "id": "point-289",
      "type": "point",
      "level": 5,
      "title": "(b)reporting potential online child sexual abuse to the EU Centre pursuant to...",
      "summary": "Report suspected online child abuse to EU Centre.",
      "hasChildren": false
    },
    {
      "id": "point-290",
      "type": "point",
      "level": 5,
      "title": "(c)blocking the account of, or suspending or terminating the provision of the...",
      "summary": "Block, suspend, or terminate user account and services.",
      "hasChildren": false
    },
    {
      "id": "point-291",
      "type": "point",
      "level": 5,
      "title": "(d)handling users’ complaints to the provider or to the Coordinating Authorit...",
      "summary": "Handle user complaints about regulation violations to providers, authorities, or courts.",
      "hasChildren": false
    },
    {
      "id": "point-292",
      "type": "point",
      "level": 5,
      "title": "(e)responding to requests issued by competent law enforcement authorities and...",
      "summary": "Respond to law enforcement requests for data related to reported child abuse cases.",
      "hasChildren": false
    },
    {
      "id": "paragraph-293",
      "type": "paragraph",
      "level": 4,
      "title": "2.Providers shall preserve the information referred to in paragraph 1 for no longer than necessary for the applicable purpose and, in any event, no longer than 12 months from the date of the reporting or of the removal or disabling of access, whichever occurs first.",
      "summary": "Keep information maximum 12 months after reporting or removal date, whichever comes first.",
      "hasChildren": false
    },
    {
      "id": "article-294",
      "type": "article",
      "level": 3,
      "title": "Article 23: Points of contact",
      "summary": "Member states designate authorities for cross-border data exchange.",
      "hasChildren": true
    },
    {
      "id": "paragraph-295",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of relevant information society services shall establish a single point of contact allowing for direct communication, by electronic means, with the Coordinating Authorities, other competent authorities of the Member States, the Commission and the EU Centre, for the application of this Regulation.",
      "summary": "Service providers must create electronic contact point for EU authorities and regulators.",
      "hasChildren": false
    },
    {
      "id": "paragraph-296",
      "type": "paragraph",
      "level": 4,
      "title": "2.The providers shall communicate to the EU Centre and make public the information necessary to easily identify and communicate with their single points of contact, including their names, addresses, the electronic mail addresses and telephone numbers.",
      "summary": "Providers must share contact details of their representatives with EU Centre and public.",
      "hasChildren": false
    },
    {
      "id": "paragraph-297",
      "type": "paragraph",
      "level": 4,
      "title": "3.The providers shall specify in the information referred to in paragraph 2 the official language or languages of the Union, which can be used to communicate with their points of contact.",
      "summary": "Providers must specify which EU languages can be used to contact them.",
      "hasChildren": false
    },
    {
      "id": "article-298",
      "type": "article",
      "level": 3,
      "title": "Article 24: Legal representative",
      "summary": "Legal authority and duties of representatives in decision-making processes.",
      "hasChildren": true
    },
    {
      "id": "paragraph-299",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of relevant information society services which do not have their main establishment in the Union shall designate, in writing, a natural or legal person as its legal representative in the Union.",
      "summary": "Non-EU tech companies must appoint legal representative within EU.",
      "hasChildren": false
    },
    {
      "id": "paragraph-300",
      "type": "paragraph",
      "level": 4,
      "title": "2.The legal representative shall reside or be established in one of the Member States where the provider offers its services.",
      "summary": "Legal representative must be based in a Member State where services operate.",
      "hasChildren": false
    },
    {
      "id": "paragraph-301",
      "type": "paragraph",
      "level": 4,
      "title": "3.The provider shall mandate its legal representatives to be addressed in addition to or instead of the provider by the Coordinating Authorities, other competent authorities of the Member States and the Commission on all issues necessary for the receipt of, compliance with and enforcement of decisions issued in relation to this Regulation, including detection orders, removal orders and blocking orders.",
      "summary": "Legal representatives must be authorized to receive and handle regulatory orders for provider.",
      "hasChildren": false
    },
    {
      "id": "paragraph-302",
      "type": "paragraph",
      "level": 4,
      "title": "4.The provider shall provide its legal representative with the necessary powers and resources to cooperate with the Coordinating Authorities, other competent authorities of the Member States and the Commission and comply with the decisions referred to in paragraph 3.",
      "summary": "Legal representative must have resources to work with authorities and follow their decisions.",
      "hasChildren": false
    },
    {
      "id": "paragraph-303",
      "type": "paragraph",
      "level": 4,
      "title": "5.The designated legal representative may be held liable for non-compliance with obligations of the provider under this Regulation, without prejudice to the liability and legal actions that could be initiated against the provider.",
      "summary": "Legal representatives can be liable for provider's non-compliance with regulations.",
      "hasChildren": false
    },
    {
      "id": "paragraph-304",
      "type": "paragraph",
      "level": 4,
      "title": "6.The provider shall notify the name, address, the electronic mail address and telephone number of its legal representative designated pursuant to paragraph 1 to the Coordinating Authority in the Member State where that legal representative resides or is established, and to the EU Centre. They shall ensure that that information is up to date and publicly available.",
      "summary": "Notify legal representative's contact details to authorities and keep information publicly available.",
      "hasChildren": false
    },
    {
      "id": "paragraph-305",
      "type": "paragraph",
      "level": 4,
      "title": "7.The designation of a legal representative within the Union pursuant to paragraph 1 shall not amount to an establishment in the Union.",
      "summary": "Appointing an EU legal representative does not count as establishing presence in EU.",
      "hasChildren": false
    },
    {
      "id": "chapter-306",
      "type": "chapter",
      "level": 1,
      "title": "CHAPTER III - SUPERVISION, ENFORCEMENT AND COOPERATION",
      "summary": "Regulatory oversight, enforcement actions, and cross-border supervisory collaboration.",
      "hasChildren": true
    },
    {
      "id": "section-307",
      "type": "section",
      "level": 2,
      "title": "Section 1: Coordinating Authorities for child sexual abuse issues",
      "summary": "Report suspected child abuse to local law enforcement and child protective services immediately.",
      "hasChildren": true
    },
    {
      "id": "article-308",
      "type": "article",
      "level": 3,
      "title": "Article 25: Coordinating Authorities for child sexual abuse issues and other competent authorities",
      "summary": "National coordination and reporting systems for child sexual abuse cases.",
      "hasChildren": true
    },
    {
      "id": "paragraph-309",
      "type": "paragraph",
      "level": 4,
      "title": "1.Member States shall, by [Date - two months from the date of entry into force of this Regulation], designate one or more competent authorities as responsible for the application and enforcement of this Regulation (‘competent authorities’).",
      "summary": "Member States must designate authorities to enforce regulation within two months.",
      "hasChildren": false
    },
    {
      "id": "paragraph-310",
      "type": "paragraph",
      "level": 4,
      "title": "2.Member States shall, by the date referred to in paragraph 1, designate one of the competent authorities as their Coordinating Authority for child sexual abuse issues (‘Coordinating Authority’).",
      "summary": "Member States must appoint one authority to coordinate child sexual abuse enforcement.",
      "hasChildren": false
    },
    {
      "id": "paragraph-311",
      "type": "paragraph",
      "level": 4,
      "title": "3.Where a Member State designates more than one competent authority in addition to the Coordinating Authority, it shall ensure that the respective tasks of those authorities and of the Coordinating Authority are clearly defined and that they cooperate closely and effectively when performing their tasks. The Member State concerned shall communicate the name of the other competent authorities as well as their respective tasks to the EU Centre and the Commission.",
      "summary": "Member States must define authority roles clearly and notify EU Centre of additional authorities.",
      "hasChildren": false
    },
    {
      "id": "paragraph-312",
      "type": "paragraph",
      "level": 4,
      "title": "4.Within one week after the designation of the Coordinating Authorities and any other competent authorities pursuant to paragraph 1, Member States shall make publicly available, and communicate to the Commission and the EU Centre, the name of their Coordinating Authority. They shall keep that information updated.",
      "summary": "Member States must publish and share Coordinating Authority names within one week, keeping information current.",
      "hasChildren": false
    },
    {
      "id": "paragraph-313",
      "type": "paragraph",
      "level": 4,
      "title": "5.Each Member State shall ensure that a contact point is designated or established within the Coordinating Authority’s office to handle requests for clarification, feedback and other communications in relation to all matters related to the application and enforcement of this Regulation in that Member State. Member States shall make the information on the contact point publicly available and communicate it to the EU Centre. They shall keep that information updated.",
      "summary": "Member States must establish public contact point for regulation enforcement and keep details updated.",
      "hasChildren": false
    },
    {
      "id": "paragraph-314",
      "type": "paragraph",
      "level": 4,
      "title": "6.Within two weeks after the designation of the Coordinating Authorities pursuant to paragraph 2, the EU Centre shall set up an online register listing the Coordinating Authorities and their contact points. The EU Centre shall regularly publish any modification thereto.",
      "summary": "EU Centre must create and maintain online register of Coordinating Authorities within two weeks.",
      "hasChildren": false
    },
    {
      "id": "paragraph-315",
      "type": "paragraph",
      "level": 4,
      "title": "7.Coordinating Authorities may, where necessary for the performance of their tasks under this Regulation, request the assistance of the EU Centre in carrying out those tasks, in particular by requesting the EU Centre to:",
      "summary": "Coordinating Authorities can request EU Centre's help to perform their regulatory tasks.",
      "hasChildren": true
    },
    {
      "id": "point-316",
      "type": "point",
      "level": 5,
      "title": "(a)provide certain information or technical expertise on matters covered by t...",
      "summary": "Provide information and technical expertise related to regulation matters.",
      "hasChildren": false
    },
    {
      "id": "point-317",
      "type": "point",
      "level": 5,
      "title": "(b)assist in assessing, in accordance with Article 5(2), the risk assessment ...",
      "summary": "Help evaluate risk assessments and mitigation measures from hosting/communication service providers.",
      "hasChildren": false
    },
    {
      "id": "point-318",
      "type": "point",
      "level": 5,
      "title": "(c)verify the possible need to request competent national authorities to issu...",
      "summary": "Check if national authorities need to issue content removal or blocking orders.",
      "hasChildren": false
    },
    {
      "id": "point-319",
      "type": "point",
      "level": 5,
      "title": "(d)verify the effectiveness of a detection order or a removal order issued up...",
      "summary": "Verify effectiveness of detection or removal orders from Coordinating Authority.",
      "hasChildren": false
    },
    {
      "id": "paragraph-320",
      "type": "paragraph",
      "level": 4,
      "title": "8.The EU Centre shall provide such assistance free of charge and in accordance with its tasks and obligations under this Regulation and insofar as its resources and priorities allow.",
      "summary": "EU Centre provides free assistance within available resources and regulatory obligations.",
      "hasChildren": false
    },
    {
      "id": "paragraph-321",
      "type": "paragraph",
      "level": 4,
      "title": "9.The requirements applicable to Coordinating Authorities set out in Articles 26, 27, 28, 29 and 30 shall also apply to any other competent authorities that the Member States designate pursuant to paragraph 1.",
      "summary": "Articles 26-30 requirements apply to all authorities designated by Member States.",
      "hasChildren": false
    },
    {
      "id": "article-322",
      "type": "article",
      "level": 3,
      "title": "Article 26: Requirements for Coordinating Authorities",
      "summary": "National authorities coordinate and oversee AI system compliance activities.",
      "hasChildren": true
    },
    {
      "id": "paragraph-323",
      "type": "paragraph",
      "level": 4,
      "title": "1.Member States shall ensure that the Coordinating Authorities that they designated perform their tasks under this Regulation in an objective, impartial, transparent and timely manner, while fully respecting the fundamental rights of all parties affected. Member States shall ensure that their Coordinating Authorities have adequate technical, financial and human resources to carry out their tasks.",
      "summary": "Member States must ensure Coordinating Authorities work fairly and have sufficient resources.",
      "hasChildren": false
    },
    {
      "id": "paragraph-324",
      "type": "paragraph",
      "level": 4,
      "title": "2.When carrying out their tasks and exercising their powers in accordance with this Regulation, the Coordinating Authorities shall act with complete independence. To that aim, Member States shall ensure, in particular, that they:",
      "summary": "Coordinating Authorities must operate independently when performing regulatory duties.",
      "hasChildren": true
    },
    {
      "id": "point-325",
      "type": "point",
      "level": 5,
      "title": "(a)are legally and functionally independent from any other public authority;",
      "summary": "Must operate independently from all other government authorities.",
      "hasChildren": false
    },
    {
      "id": "point-326",
      "type": "point",
      "level": 5,
      "title": "(b)have a status enabling them to act objectively and impartially when carryi...",
      "summary": "Must maintain objectivity and impartiality when performing regulatory duties.",
      "hasChildren": false
    },
    {
      "id": "point-327",
      "type": "point",
      "level": 5,
      "title": "(c)are free from any external influence, whether direct or indirect;",
      "summary": "Must be independent and free from outside influences.",
      "hasChildren": false
    },
    {
      "id": "point-328",
      "type": "point",
      "level": 5,
      "title": "(d)neither seek nor take instructions from any other public authority or any ...",
      "summary": "Do not take orders from other authorities or private parties.",
      "hasChildren": false
    },
    {
      "id": "point-329",
      "type": "point",
      "level": 5,
      "title": "(e)are not charged with tasks relating to the prevention or combating of chil...",
      "summary": "Not responsible for preventing child abuse beyond tasks specified in this regulation.",
      "hasChildren": false
    },
    {
      "id": "paragraph-330",
      "type": "paragraph",
      "level": 4,
      "title": "3.Paragraph 2 shall not prevent supervision of the Coordinating Authorities in accordance with national constitutional law, to the extent that such supervision does not affect their independence as required under this Regulation.",
      "summary": "Constitutional supervision allowed if it doesn't compromise Coordinating Authorities' independence.",
      "hasChildren": false
    },
    {
      "id": "paragraph-331",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Coordinating Authorities shall ensure that relevant members of staff have the required qualifications, experience and technical skills to perform their duties.",
      "summary": "Staff must have proper qualifications and skills to perform their job duties.",
      "hasChildren": false
    },
    {
      "id": "paragraph-332",
      "type": "paragraph",
      "level": 4,
      "title": "5.The management and other staff of the Coordinating Authorities shall, in accordance with Union or national law, be subject to a duty of professional secrecy both during and after their term of office, with regard to any confidential information which has come to their knowledge in the course of the performance of their tasks. Member States shall ensure that the management and other staff are subject to rules guaranteeing that they can carry out their tasks in an objective, impartial and independent manner, in particular as regards their appointment, dismissal, remuneration and career prospects.",
      "summary": "Staff must maintain confidentiality and independence in their duties during and after employment.",
      "hasChildren": false
    },
    {
      "id": "section-333",
      "type": "section",
      "level": 2,
      "title": "Section 2: Powers of Coordinating Authorities",
      "summary": "Coordinating Authorities can make decisions and enforce regulations within their assigned jurisdictions.",
      "hasChildren": true
    },
    {
      "id": "article-334",
      "type": "article",
      "level": 3,
      "title": "Article 27: Investigatory powers",
      "summary": "Regulatory authority's powers to investigate data protection violations and breaches.",
      "hasChildren": true
    },
    {
      "id": "paragraph-335",
      "type": "paragraph",
      "level": 4,
      "title": "1.Where needed for carrying out their tasks, Coordinating Authorities shall have the following powers of investigation, in respect of providers of relevant information society services under the jurisdiction of the Member State that designated them:",
      "summary": "Coordinating Authorities can investigate service providers within their Member State's jurisdiction.",
      "hasChildren": true
    },
    {
      "id": "point-336",
      "type": "point",
      "level": 5,
      "title": "(a)the power to require those providers, as well as any other persons acting ...",
      "summary": "Authority to demand information from providers and business associates about suspected violations.",
      "hasChildren": false
    },
    {
      "id": "point-337",
      "type": "point",
      "level": 5,
      "title": "(b)the power to carry out on-site inspections of any premises that those prov...",
      "summary": "Authorities can inspect premises, seize evidence, and enforce compliance through fines and penalties.",
      "hasChildren": false
    },
    {
      "id": "point-338",
      "type": "point",
      "level": 5,
      "title": "(c)the power to ask any member of staff or representative of those providers ...",
      "summary": "Power to question staff and record answers about suspected regulation violations.",
      "hasChildren": false
    },
    {
      "id": "point-339",
      "type": "point",
      "level": 5,
      "title": "(d)the power to request information, including to assess whether the measures...",
      "summary": "Power to request information to verify compliance with detection, removal, and blocking orders.",
      "hasChildren": false
    },
    {
      "id": "paragraph-340",
      "type": "paragraph",
      "level": 4,
      "title": "2.Member States may grant additional investigative powers to the Coordinating Authorities.",
      "summary": "Member States can give Coordinating Authorities more investigative powers.",
      "hasChildren": false
    },
    {
      "id": "article-341",
      "type": "article",
      "level": 3,
      "title": "Article 28: Enforcement powers",
      "summary": "Data protection authorities can investigate, fine, and restrict data processing.",
      "hasChildren": true
    },
    {
      "id": "paragraph-342",
      "type": "paragraph",
      "level": 4,
      "title": "1.Where needed for carrying out their tasks, Coordinating Authorities shall have the following enforcement powers, in respect of providers of relevant information society services under the jurisdiction of the Member State that designated them:",
      "summary": "Coordinating Authorities have enforcement powers over digital service providers in their jurisdiction.",
      "hasChildren": true
    },
    {
      "id": "point-343",
      "type": "point",
      "level": 5,
      "title": "(a)the power to accept the commitments offered by those providers in relation...",
      "summary": "Power to accept and enforce provider commitments regarding regulatory compliance.",
      "hasChildren": false
    },
    {
      "id": "point-344",
      "type": "point",
      "level": 5,
      "title": "(b)the power to order the cessation of infringements of this Regulation and, ...",
      "summary": "Authority to stop violations and enforce appropriate remedies to end infringement.",
      "hasChildren": false
    },
    {
      "id": "point-345",
      "type": "point",
      "level": 5,
      "title": "(c)the power to impose fines, or request a judicial authority in their Member...",
      "summary": "Power to impose fines or request courts to issue fines for regulation violations.",
      "hasChildren": false
    },
    {
      "id": "point-346",
      "type": "point",
      "level": 5,
      "title": "(d)the power to impose a periodic penalty payment in accordance with Article ...",
      "summary": "Power to impose recurring fines for non-compliance with orders and regulations.",
      "hasChildren": false
    },
    {
      "id": "point-347",
      "type": "point",
      "level": 5,
      "title": "(e)the power to adopt interim measures to avoid the risk of serious harm.",
      "summary": "Can implement temporary measures to prevent serious harm.",
      "hasChildren": false
    },
    {
      "id": "paragraph-348",
      "type": "paragraph",
      "level": 4,
      "title": "2.Member States may grant additional enforcement powers to the Coordinating Authorities.",
      "summary": "Member States can give Coordinating Authorities more enforcement powers.",
      "hasChildren": false
    },
    {
      "id": "paragraph-349",
      "type": "paragraph",
      "level": 4,
      "title": "3.As regards paragraph 1, points (c) and (d), Coordinating Authorities shall have the enforcement powers set out in those points also in respect of the other persons referred to in Article 27, for failure to comply with any of the orders issued to them pursuant to that Article.",
      "summary": "Authorities can enforce penalties on Article 27 persons who don't follow orders.",
      "hasChildren": false
    },
    {
      "id": "paragraph-350",
      "type": "paragraph",
      "level": 4,
      "title": "4.They shall only exercise those enforcement powers after having provided those other persons in good time with all relevant information relating to such orders, including the applicable time period, the fines or periodic payments that may be imposed for failure to comply and redress possibilities.",
      "summary": "Enforcement powers require prior notification of deadlines, fines, and appeal options.",
      "hasChildren": false
    },
    {
      "id": "article-351",
      "type": "article",
      "level": 3,
      "title": "Article 29: Additional enforcement powers",
      "summary": "Regulatory powers to enforce data protection violations and issue penalties.",
      "hasChildren": true
    },
    {
      "id": "paragraph-352",
      "type": "paragraph",
      "level": 4,
      "title": "1.Where needed for carrying out their tasks, Coordinating Authorities shall have the additional enforcement powers referred to in paragraph 2, in respect of providers of relevant information society services under the jurisdiction of the Member State that designated them, provided that:",
      "summary": "Coordinating Authorities get extra enforcement powers over service providers within their jurisdiction.",
      "hasChildren": true
    },
    {
      "id": "point-353",
      "type": "point",
      "level": 5,
      "title": "(a)all other powers pursuant to Articles 27 and 28 to bring about the cessati...",
      "summary": "Use other Article 27/28 powers first before taking additional enforcement actions.",
      "hasChildren": false
    },
    {
      "id": "point-354",
      "type": "point",
      "level": 5,
      "title": "(b)the infringement persists;",
      "summary": "Violation continues to occur.",
      "hasChildren": false
    },
    {
      "id": "point-355",
      "type": "point",
      "level": 5,
      "title": "(c)the infringement causes serious harm which cannot be avoided through the e...",
      "summary": "Authorities can restrict service access if serious harm persists and other powers fail.",
      "hasChildren": false
    },
    {
      "id": "paragraph-356",
      "type": "paragraph",
      "level": 4,
      "title": "2.Coordinating Authorities shall have the additional enforcement powers to take the following measures:",
      "summary": "Coordinating Authorities receive extra enforcement powers for additional measures.",
      "hasChildren": true
    },
    {
      "id": "point-357",
      "type": "point",
      "level": 5,
      "title": "(a)require the management body of the providers to examine the situation with...",
      "summary": "Management must examine situation and respond within reasonable timeframe.",
      "hasChildren": false
    },
    {
      "id": "point-358",
      "type": "point",
      "level": 5,
      "title": "(i)adopt and submit an action plan setting out the necessary measures to term...",
      "summary": "Submit action plan detailing steps to stop the infringement.",
      "hasChildren": false
    },
    {
      "id": "point-359",
      "type": "point",
      "level": 5,
      "title": "(ii)ensure that the provider takes those measures;",
      "summary": "Verify provider implements required measures.",
      "hasChildren": false
    },
    {
      "id": "point-360",
      "type": "point",
      "level": 5,
      "title": "(iii)report on the measures taken;",
      "summary": "Report what actions were completed.",
      "hasChildren": false
    },
    {
      "id": "point-361",
      "type": "point",
      "level": 5,
      "title": "(b)request the competent judicial authority or independent administrative aut...",
      "summary": "Request authority to temporarily restrict user access when infringement occurs.",
      "hasChildren": false
    },
    {
      "id": "point-362",
      "type": "point",
      "level": 5,
      "title": "(i)the provider has not sufficiently complied with the requirements of point ...",
      "summary": "Provider failed to meet requirements of point A.",
      "hasChildren": false
    },
    {
      "id": "point-363",
      "type": "point",
      "level": 5,
      "title": "(ii)the infringement persists and causes serious harm;",
      "summary": "Ongoing infringement must cause significant damage.",
      "hasChildren": false
    },
    {
      "id": "point-364",
      "type": "point",
      "level": 5,
      "title": "(iii)the infringement results in the regular and structural facilitation of c...",
      "summary": "Infringement enables systematic facilitation of child sexual abuse.",
      "hasChildren": false
    },
    {
      "id": "paragraph-365",
      "type": "paragraph",
      "level": 4,
      "title": "3.The Coordinating Authority shall, prior to submitting the request referred to in paragraph 2, point (b), invite interested parties to submit written observations on its intention to submit that request within a reasonable time period set by that Coordinating Authority. That time period shall not be less than two weeks.",
      "summary": "Authority must allow 2+ weeks for interested parties to submit written feedback.",
      "hasChildren": true
    },
    {
      "id": "point-366",
      "type": "point",
      "level": 5,
      "title": "(a)describe the measures that it intends to request;",
      "summary": "List planned measures to be requested.",
      "hasChildren": false
    },
    {
      "id": "point-367",
      "type": "point",
      "level": 5,
      "title": "(b)identify the intended addressee or addressees thereof.",
      "summary": "Identify who the message is meant for.",
      "hasChildren": false
    },
    {
      "id": "paragraph-368",
      "type": "paragraph",
      "level": 4,
      "title": "4.Any measure ordered upon the request referred to in paragraph 2, point (b), shall be proportionate to the nature, gravity, recurrence and duration of the infringement, without unduly restricting access to lawful information by users of the service concerned.",
      "summary": "Enforcement measures must match violation severity while preserving users' access to legal content.",
      "hasChildren": true
    },
    {
      "id": "point-369",
      "type": "point",
      "level": 5,
      "title": "(a)the provider has failed to take the necessary measures to terminate the in...",
      "summary": "Provider failed to stop the infringement.",
      "hasChildren": false
    },
    {
      "id": "point-370",
      "type": "point",
      "level": 5,
      "title": "(b)the temporary restriction does not unduly restrict access to lawful inform...",
      "summary": "Temporary restrictions must not excessively limit users' access to legal information.",
      "hasChildren": false
    },
    {
      "id": "article-371",
      "type": "article",
      "level": 3,
      "title": "Article 30: Common provisions on investigatory and enforcement powers",
      "summary": "Regulatory powers for investigating and enforcing data protection violations.",
      "hasChildren": true
    },
    {
      "id": "paragraph-372",
      "type": "paragraph",
      "level": 4,
      "title": "1.The measures taken by the Coordinating Authorities in the exercise of their investigatory and enforcement powers referred to in Articles 27, 28 and 29 shall be effective, dissuasive and proportionate, having regard, in particular, to the nature, gravity, recurrence and duration of the infringement of this Regulation or suspected infringement to which those measures relate, as well as the economic, technical and operational capacity of the provider of relevant information society services concerned, where applicable.",
      "summary": "Enforcement actions must be effective, proportionate and consider service provider's capabilities.",
      "hasChildren": false
    },
    {
      "id": "paragraph-373",
      "type": "paragraph",
      "level": 4,
      "title": "2.Member States shall ensure that any exercise of the investigatory and enforcement powers referred to in Articles 27, 28 and 29 is subject to adequate safeguards laid down in the applicable national law to respect the fundamental rights of all parties affected. In particular, those measures shall only be taken in accordance with the right to respect for private life and the rights of defence, including the rights to be heard and of access to the file, and subject to the right to an effective judicial remedy of all parties affected.",
      "summary": "Investigatory powers must respect privacy rights, defense rights and judicial remedies.",
      "hasChildren": false
    },
    {
      "id": "article-374",
      "type": "article",
      "level": 3,
      "title": "Article 31: Searches to verify compliance",
      "summary": "Procedures for conducting compliance inspections and verification searches.",
      "hasChildren": true
    },
    {
      "id": "paragraph-375",
      "type": "paragraph",
      "level": 4,
      "title": "Coordinating Authorities shall have the power to carry out searches on publicly accessible materi...",
      "summary": "Authorities can search public content on hosting services to detect child abuse material.",
      "hasChildren": false
    },
    {
      "id": "article-376",
      "type": "article",
      "level": 3,
      "title": "Article 32: Notification of known child sexual abuse material",
      "summary": "Online platforms must report child sexual abuse content to authorities.",
      "hasChildren": true
    },
    {
      "id": "paragraph-377",
      "type": "paragraph",
      "level": 4,
      "title": "Coordinating Authorities shall have the power to notify providers of hosting services under the j...",
      "summary": "Authorities can notify hosting providers about child abuse content and request voluntary removal.",
      "hasChildren": false
    },
    {
      "id": "paragraph-378",
      "type": "paragraph",
      "level": 4,
      "title": "The request shall clearly set out the identification details of the Coordinating Authority making...",
      "summary": "Include Coordinating Authority ID, contact details, CSAM info and reasoning for voluntary request.",
      "hasChildren": false
    },
    {
      "id": "section-379",
      "type": "section",
      "level": 2,
      "title": "Section 3: Other provisions on enforcement",
      "summary": "Enforcement officers can inspect, investigate, and penalize violations of these regulations.",
      "hasChildren": true
    },
    {
      "id": "article-380",
      "type": "article",
      "level": 3,
      "title": "Article 33: Jurisdiction",
      "summary": "Criminal court jurisdiction over genocide, war crimes, crimes against humanity.",
      "hasChildren": true
    },
    {
      "id": "paragraph-381",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Member State in which the main establishment of the provider of relevant information society services is located shall have jurisdiction for the purposes of this Regulation.",
      "summary": "Member State where provider's main office is located has legal jurisdiction.",
      "hasChildren": false
    },
    {
      "id": "paragraph-382",
      "type": "paragraph",
      "level": 4,
      "title": "2.A provider of relevant information society services which does not have an establishment in the Union shall be deemed to be under the jurisdiction of the Member State where its legal representative resides or is established.",
      "summary": "Non-EU service providers fall under jurisdiction where their legal representative is located.",
      "hasChildren": false
    },
    {
      "id": "article-383",
      "type": "article",
      "level": 3,
      "title": "Article 34: Right of users of the service to lodge a complaint",
      "summary": "Users can file complaints about content moderation decisions.",
      "hasChildren": true
    },
    {
      "id": "paragraph-384",
      "type": "paragraph",
      "level": 4,
      "title": "1.Users shall have the right to lodge a complaint alleging an infringement of this Regulation affecting them against providers of relevant information society services with the Coordinating Authority designated by the Member State where the user resides or is established.",
      "summary": "Users can file complaints about service providers to their country's Coordinating Authority.",
      "hasChildren": false
    },
    {
      "id": "paragraph-385",
      "type": "paragraph",
      "level": 4,
      "title": "2.Coordinating Authorities shall provide child-friendly mechanisms to submit a complaint under this Article and adopt a child-sensitive approach when handling complaints submitted by children, taking due account of the child's age, maturity, views, needs and concerns.",
      "summary": "Authorities must create child-friendly complaint systems and handle complaints considering children's needs.",
      "hasChildren": false
    },
    {
      "id": "paragraph-386",
      "type": "paragraph",
      "level": 4,
      "title": "3.The Coordinating Authority receiving the complaint shall assess the complaint and, where appropriate, transmit it to the Coordinating Authority of establishment.",
      "summary": "Coordinating Authority assesses complaints and forwards them to appropriate establishment authority.",
      "hasChildren": false
    },
    {
      "id": "article-387",
      "type": "article",
      "level": 3,
      "title": "Article 35",
      "summary": "I don't see the actual article content to summarize. Please share the article text and I'll provide a concise 10-word summary following your requirements.",
      "hasChildren": true
    },
    {
      "id": "paragraph-388",
      "type": "paragraph",
      "level": 4,
      "title": "1.Member States shall lay down the rules on penalties applicable to infringements of the obligations pursuant to Chapters II and V of this Regulation by providers of relevant information society services under their jurisdiction and shall take all the necessary measures to ensure that they are implemented.",
      "summary": "Member States must create and enforce penalties for service providers violating Chapters II and V.",
      "hasChildren": false
    },
    {
      "id": "paragraph-389",
      "type": "paragraph",
      "level": 4,
      "title": "2.Member States shall ensure that the maximum amount of penalties imposed for an infringement of this Regulation shall not exceed 6 % of the annual income or global turnover of the preceding business year of the provider.",
      "summary": "Maximum penalty for violations: 6% of provider's previous year income/turnover.",
      "hasChildren": false
    },
    {
      "id": "paragraph-390",
      "type": "paragraph",
      "level": 4,
      "title": "3.Penalties for the supply of incorrect, incomplete or misleading information, failure to reply or rectify incorrect, incomplete or misleading information or to submit to an on-site inspection shall not exceed 1% of the annual income or global turnover of the preceding business year of the provider or the other person referred to in Article 27.",
      "summary": "Penalties for incorrect/incomplete information or inspection refusal capped at 1% annual turnover.",
      "hasChildren": false
    },
    {
      "id": "paragraph-391",
      "type": "paragraph",
      "level": 4,
      "title": "4.Member States shall ensure that the maximum amount of a periodic penalty payment shall not exceed 5 % of the average daily global turnover of the provider or the other person referred to in Article 27 in the preceding financial year per day, calculated from the date specified in the decision concerned.",
      "summary": "Daily penalty payments capped at 5% of provider's average daily global turnover.",
      "hasChildren": false
    },
    {
      "id": "paragraph-392",
      "type": "paragraph",
      "level": 4,
      "title": "5.Member States shall ensure that, when deciding whether to impose a penalty and when determining the type and level of penalty, account is taken of all relevant circumstances, including:",
      "summary": "Member States must consider all relevant circumstances when deciding penalties and their severity.",
      "hasChildren": true
    },
    {
      "id": "point-393",
      "type": "point",
      "level": 5,
      "title": "(a)the nature, gravity and duration of the infringement;",
      "summary": "Assess how serious the violation was and how long it lasted.",
      "hasChildren": false
    },
    {
      "id": "point-394",
      "type": "point",
      "level": 5,
      "title": "(b)whether the infringement was intentional or negligent;",
      "summary": "Determine if violation was done on purpose or by mistake.",
      "hasChildren": false
    },
    {
      "id": "point-395",
      "type": "point",
      "level": 5,
      "title": "(c)any previous infringements by the provider or the other person;",
      "summary": "Consider past violations by provider and other involved parties.",
      "hasChildren": false
    },
    {
      "id": "point-396",
      "type": "point",
      "level": 5,
      "title": "(d)the financial strength of the provider or the other person;",
      "summary": "Must assess financial strength of provider and other involved parties.",
      "hasChildren": false
    },
    {
      "id": "point-397",
      "type": "point",
      "level": 5,
      "title": "(e)the level of cooperation of the provider or the other person;",
      "summary": "How cooperative the provider or other person was",
      "hasChildren": false
    },
    {
      "id": "point-398",
      "type": "point",
      "level": 5,
      "title": "(f)the nature and size of the provider or the other person, in particular whe...",
      "summary": "Consider provider's size and type - whether micro, small, or medium enterprise.",
      "hasChildren": false
    },
    {
      "id": "point-399",
      "type": "point",
      "level": 5,
      "title": "(g)the degree of fault of the provider or other person, taking into account t...",
      "summary": "Assess provider's fault level based on their compliance measures and technical safeguards.",
      "hasChildren": false
    },
    {
      "id": "section-400",
      "type": "section",
      "level": 2,
      "title": "Section 4",
      "summary": "Authorities must submit child abuse material to EU Centre for database and enforcement actions.",
      "hasChildren": true
    },
    {
      "id": "article-401",
      "type": "article",
      "level": 3,
      "title": "Article 36",
      "summary": "I apologize, but I don't see the actual article content that needs to be summarized. Could you please provide the article text you'd like me to create a concise 10-word summary for?",
      "hasChildren": true
    },
    {
      "id": "paragraph-402",
      "type": "paragraph",
      "level": 4,
      "title": "1.Coordinating Authorities shall submit to the EU Centre, without undue delay and through the system established in accordance with Article 39(2):",
      "summary": "Coordinating Authorities must quickly submit information to EU Centre through Article 39(2) system.",
      "hasChildren": true
    },
    {
      "id": "point-403",
      "type": "point",
      "level": 5,
      "title": "(a)specific items of material and transcripts of conversations that Coordinat...",
      "summary": "Share identified child abuse content and solicitation evidence to generate detection indicators.",
      "hasChildren": false
    },
    {
      "id": "point-404",
      "type": "point",
      "level": 5,
      "title": "(b)exact uniform resource locators indicating specific items of material that...",
      "summary": "URLs of confirmed child abuse content hosted outside EU that can't be removed.",
      "hasChildren": false
    },
    {
      "id": "paragraph-405",
      "type": "paragraph",
      "level": 4,
      "title": "2.Upon the request of the EU Centre where necessary to ensure that the data contained in the databases referred to in Article 44(1) are complete, accurate and up-to-date, Coordinating Authorities shall verify or provide clarifications or additional information as to whether the conditions of paragraph 1, points (a) and (b) have been and, where relevant, continue to be met, in respect of a given submission to the EU Centre in accordance with that paragraph.",
      "summary": "Authorities must verify database information when EU Centre requests accuracy checks.",
      "hasChildren": false
    },
    {
      "id": "paragraph-406",
      "type": "paragraph",
      "level": 4,
      "title": "3.Member States shall ensure that, where their law enforcement authorities receive a report of the dissemination of new child sexual abuse material or of the solicitation of children forwarded to them by the EU Centre in accordance with Article 48(3), a diligent assessment is conducted in accordance with paragraph 1 and, if the material or conversation is identified as constituting child sexual abuse material or as the solicitation of children, the Coordinating Authority submits the material to the EU Centre, in accordance with that paragraph, within one month from the date of reception of the report or, where the assessment is particularly complex, two months from that date.",
      "summary": "Law enforcement must assess and submit child abuse reports to EU Centre within 1-2 months.",
      "hasChildren": false
    },
    {
      "id": "paragraph-407",
      "type": "paragraph",
      "level": 4,
      "title": "4.They shall also ensure that, where the diligent assessment indicates that the material does not constitute child sexual abuse material or the solicitation of children, the Coordinating Authority is informed of that outcome and subsequently informs the EU Centre thereof, within the time periods specified in the first subparagraph.",
      "summary": "Notify authorities when assessment confirms content is not child abuse material.",
      "hasChildren": false
    },
    {
      "id": "article-408",
      "type": "article",
      "level": 3,
      "title": "Article 37: Cross-border cooperation among Coordinating Authorities",
      "summary": "Coordinating authorities collaborate internationally to enforce data protection rules.",
      "hasChildren": true
    },
    {
      "id": "paragraph-409",
      "type": "paragraph",
      "level": 4,
      "title": "1.Where a Coordinating Authority that is not the Coordinating Authority of establishment has reasons to suspect that a provider of relevant information society services infringed this Regulation, it shall request the Coordinating Authority of establishment to assess the matter and take the necessary investigatory and enforcement measures to ensure compliance with this Regulation.",
      "summary": "Authorities must report suspected violations to provider's home authority for investigation and enforcement.",
      "hasChildren": false
    },
    {
      "id": "paragraph-410",
      "type": "paragraph",
      "level": 4,
      "title": "2.The request or recommendation referred to in paragraph 1 shall at least indicate:",
      "summary": "Paragraph 1's request/recommendation must specify minimum required information.",
      "hasChildren": true
    },
    {
      "id": "point-411",
      "type": "point",
      "level": 5,
      "title": "(a)the point of contact of the provider as set out in Article 23;",
      "summary": "Provider's contact details as specified in Article 23.",
      "hasChildren": false
    },
    {
      "id": "point-412",
      "type": "point",
      "level": 5,
      "title": "(b)a description of the relevant facts, the provisions of this Regulation con...",
      "summary": "Describe facts, regulations, and reasons for suspected provider violations.",
      "hasChildren": false
    },
    {
      "id": "point-413",
      "type": "point",
      "level": 5,
      "title": "(c)any other information that the Coordinating Authority that sent the reques...",
      "summary": "Include additional relevant information and suggested actions from requesting Authority or Commission.",
      "hasChildren": false
    },
    {
      "id": "paragraph-414",
      "type": "paragraph",
      "level": 4,
      "title": "3.The Coordinating Authority of establishment shall assess the suspected infringement, taking into utmost account the request or recommendation referred to in paragraph 1.",
      "summary": "Coordinating Authority must assess suspected violations based on received requests and recommendations.",
      "hasChildren": false
    },
    {
      "id": "paragraph-415",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Coordinating Authority of establishment shall, without undue delay and in any event not later than two months following receipt of the request or recommendation referred to in paragraph 1, communicate to the Coordinating Authority that sent the request, or the Commission, the outcome of its assessment of the suspected infringement, or that of any other competent authority pursuant to national law where relevant, and, where applicable, an explanation of the investigatory or enforcement measures taken or envisaged in relation thereto to ensure compliance with this Regulation.",
      "summary": "Authority must respond within 2 months with investigation results and planned enforcement actions.",
      "hasChildren": false
    },
    {
      "id": "article-416",
      "type": "article",
      "level": 3,
      "title": "Article 38: Joint investigations",
      "summary": "Cross-border cooperation between authorities to investigate criminal cases.",
      "hasChildren": true
    },
    {
      "id": "paragraph-417",
      "type": "paragraph",
      "level": 4,
      "title": "1.Coordinating Authorities may participate in joint investigations, which may be coordinated with the support of the EU Centre, of matters covered by this Regulation, concerning providers of relevant information society services that offer their services in several Member States.",
      "summary": "Authorities can conduct joint investigations of service providers operating across multiple EU states.",
      "hasChildren": false
    },
    {
      "id": "paragraph-418",
      "type": "paragraph",
      "level": 4,
      "title": "2.The participating Coordinating Authorities shall make the results of the joint investigations available to other Coordinating Authorities, the Commission and the EU Centre, through the system established in accordance with Article 39(2), for the fulfilment of their respective tasks under this Regulation.",
      "summary": "Authorities must share investigation results with EU bodies through Article 39(2) system.",
      "hasChildren": false
    },
    {
      "id": "article-419",
      "type": "article",
      "level": 3,
      "title": "Article 39: General cooperation and information-sharing system",
      "summary": "Member states share data and cooperate on cybersecurity incidents.",
      "hasChildren": true
    },
    {
      "id": "paragraph-420",
      "type": "paragraph",
      "level": 4,
      "title": "1.Coordinating Authorities shall cooperate with each other, any other competent authorities of the Member State that designated the Coordinating Authority, the Commission, the EU Centre and other relevant Union agencies, including Europol, to facilitate the performance of their respective tasks under this Regulation and ensure its effective, efficient and consistent application and enforcement.",
      "summary": "Coordinating Authorities must work with EU agencies to enforce regulations effectively.",
      "hasChildren": false
    },
    {
      "id": "paragraph-421",
      "type": "paragraph",
      "level": 4,
      "title": "2.The EU Centre shall establish and maintain one or more reliable and secure information sharing systems supporting communications between Coordinating Authorities, the Commission, the EU Centre, other relevant Union agencies and providers of relevant information society services.",
      "summary": "EU Centre must create secure systems for communication between authorities and service providers.",
      "hasChildren": false
    },
    {
      "id": "paragraph-422",
      "type": "paragraph",
      "level": 4,
      "title": "3.The Coordinating Authorities, the Commission, the EU Centre, other relevant Union agencies and providers of relevant information society services shall use the information-sharing systems referred to in paragraph 2 for all relevant communications pursuant to this Regulation.",
      "summary": "EU authorities and service providers must use designated systems for regulation-related communications.",
      "hasChildren": false
    },
    {
      "id": "paragraph-423",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Commission shall adopt implementing acts laying down the practical and operational arrangements for the functioning of the information-sharing systems referred to in paragraph 2 and their interoperability with other relevant systems. Those implementing acts shall be adopted in accordance with the advisory procedure referred to in Article 87.",
      "summary": "Commission must create rules for information systems' operation and compatibility per Article 87.",
      "hasChildren": false
    },
    {
      "id": "chapter-424",
      "type": "chapter",
      "level": 1,
      "title": "CHAPTER IV - EU CENTRE TO PREVENT AND COMBAT CHILD SEXUAL ABUSE",
      "summary": "Establishes EU agency to fight child sexual abuse and exploitation.",
      "hasChildren": true
    },
    {
      "id": "section-425",
      "type": "section",
      "level": 2,
      "title": "Section 1: Principles",
      "summary": "Follow these core principles: transparency, data security, user privacy, and ethical decision-making.",
      "hasChildren": true
    },
    {
      "id": "article-426",
      "type": "article",
      "level": 3,
      "title": "Article 40: Establishment and scope of action of the EU Centre",
      "summary": "EU Centre coordinates child sexual abuse prevention and victim support.",
      "hasChildren": true
    },
    {
      "id": "paragraph-427",
      "type": "paragraph",
      "level": 4,
      "title": "1.A European Union Agency to prevent and combat child sexual abuse, the EU Centre on Child Sexual Abuse, is established.",
      "summary": "EU establishes new agency to fight child sexual abuse.",
      "hasChildren": false
    },
    {
      "id": "paragraph-428",
      "type": "paragraph",
      "level": 4,
      "title": "2.The EU Centre shall contribute to the achievement of the objective of this Regulation by supporting and facilitating the implementation of its provisions concerning the detection, reporting, removal or disabling of access to, and blocking of online child sexual abuse and gather and share information and expertise and facilitate cooperation between relevant public and private parties in connection to the prevention and combating of child sexual abuse, in particular online.",
      "summary": "EU Centre detects, reports and removes online child sexual abuse through public-private cooperation.",
      "hasChildren": false
    },
    {
      "id": "article-429",
      "type": "article",
      "level": 3,
      "title": "Article 41: Legal status",
      "summary": "EU institutions and member states legally bound by Charter rights.",
      "hasChildren": true
    },
    {
      "id": "paragraph-430",
      "type": "paragraph",
      "level": 4,
      "title": "1.The EU Centre shall be a body of the Union with legal personality.",
      "summary": "EU Centre established as legal entity within Union.",
      "hasChildren": false
    },
    {
      "id": "paragraph-431",
      "type": "paragraph",
      "level": 4,
      "title": "2.In each of the Member States the EU Centre shall enjoy the most extensive legal capacity accorded to legal persons under their laws. It may, in particular, acquire and dispose of movable and immovable property and be party to legal proceedings.",
      "summary": "EU Centre has full legal rights to own property and participate in legal proceedings.",
      "hasChildren": false
    },
    {
      "id": "paragraph-432",
      "type": "paragraph",
      "level": 4,
      "title": "3.The EU Centre shall be represented by its Executive Director.",
      "summary": "Executive Director represents EU Centre.",
      "hasChildren": false
    },
    {
      "id": "article-433",
      "type": "article",
      "level": 3,
      "title": "Article 42",
      "summary": "I apologize, but I don't see the actual article content to summarize. Could you please share the article you'd like me to create a concise summary for?",
      "hasChildren": false
    },
    {
      "id": "section-434",
      "type": "section",
      "level": 2,
      "title": "Section 2: Tasks",
      "summary": "Complete all assigned tasks in order and submit by deadline.",
      "hasChildren": true
    },
    {
      "id": "article-435",
      "type": "article",
      "level": 3,
      "title": "Article 43: Tasks of the EU Centre",
      "summary": "EU Centre coordinates cybersecurity standards and threat intelligence across member states.",
      "hasChildren": true
    },
    {
      "id": "point-436",
      "type": "point",
      "level": 5,
      "title": "(1)facilitate the risk assessment process referred to in Section 1 of Chapter...",
      "summary": "Help complete risk assessment process outlined in Chapter II Section 1.",
      "hasChildren": false
    },
    {
      "id": "point-437",
      "type": "point",
      "level": 5,
      "title": "(a)supporting the Commission in the preparation of the guidelines referred to...",
      "summary": "Support Commission by providing information and expertise for guideline preparation.",
      "hasChildren": false
    },
    {
      "id": "point-438",
      "type": "point",
      "level": 5,
      "title": "(b)upon request from a provider of relevant information services, providing a...",
      "summary": "Provide anonymized data analysis to information service providers when requested.",
      "hasChildren": false
    },
    {
      "id": "point-439",
      "type": "point",
      "level": 5,
      "title": "(2)facilitate the detection process referred to in Section 2 of Chapter II, by:",
      "summary": "Support detection of illegal content by managing databases, providing tools, and facilitating reporting.",
      "hasChildren": false
    },
    {
      "id": "point-440",
      "type": "point",
      "level": 5,
      "title": "(a)providing the opinions on intended detection orders referred to in Article...",
      "summary": "Provide opinions on detection orders specified in Article 7(3)(d).",
      "hasChildren": false
    },
    {
      "id": "point-441",
      "type": "point",
      "level": 5,
      "title": "(b)maintaining and operating the databases of indicators referred to in Artic...",
      "summary": "Maintain and operate indicator databases specified in Article 44.",
      "hasChildren": false
    },
    {
      "id": "point-442",
      "type": "point",
      "level": 5,
      "title": "(c)giving providers of hosting services and providers of interpersonal commun...",
      "summary": "Give hosting and communication providers access to detection order indicator databases.",
      "hasChildren": false
    },
    {
      "id": "point-443",
      "type": "point",
      "level": 5,
      "title": "(d)making technologies available to providers for the execution of detection ...",
      "summary": "Make detection technologies available to providers to execute detection orders.",
      "hasChildren": false
    },
    {
      "id": "point-444",
      "type": "point",
      "level": 5,
      "title": "(3)facilitate the reporting process referred to in Section 3 of Chapter II, by:",
      "summary": "Help make Section 3 reporting easier and more efficient.",
      "hasChildren": false
    },
    {
      "id": "point-445",
      "type": "point",
      "level": 5,
      "title": "(a)maintaining and operating the database of reports referred to in Article 45;",
      "summary": "Maintain and operate the Article 45 reports database.",
      "hasChildren": false
    },
    {
      "id": "point-446",
      "type": "point",
      "level": 5,
      "title": "(b)assessing, processing and, where necessary, forwarding the reports and pro...",
      "summary": "Assess, process and forward reports, then provide feedback according to Article 48.",
      "hasChildren": false
    },
    {
      "id": "point-447",
      "type": "point",
      "level": 5,
      "title": "(4)facilitate the removal process referred to in Section 4 of Chapter II and ...",
      "summary": "Help with removal processes outlined in Sections 4, 5, and 6.",
      "hasChildren": false
    },
    {
      "id": "point-448",
      "type": "point",
      "level": 5,
      "title": "(a)receiving the removal orders transmitted to it pursuant to Article 14(4) i...",
      "summary": "Receive removal orders to verify compliance with Article 49(1).",
      "hasChildren": false
    },
    {
      "id": "point-449",
      "type": "point",
      "level": 5,
      "title": "(b)cooperating with and responding to requests of Coordinating Authorities in...",
      "summary": "Cooperate with authorities on blocking order requests.",
      "hasChildren": false
    },
    {
      "id": "point-450",
      "type": "point",
      "level": 5,
      "title": "(c)receiving and processing the blocking orders transmitted to it pursuant to...",
      "summary": "Receive and process blocking orders.",
      "hasChildren": false
    },
    {
      "id": "point-451",
      "type": "point",
      "level": 5,
      "title": "(d)providing information and support to victims in accordance with Articles 2...",
      "summary": "Provide victims with information and support as outlined in Articles 20-21.",
      "hasChildren": false
    },
    {
      "id": "point-452",
      "type": "point",
      "level": 5,
      "title": "(e)maintaining up-to-date records of contact points and legal representatives...",
      "summary": "Keep current records of service providers' contact details and legal representatives.",
      "hasChildren": false
    },
    {
      "id": "point-453",
      "type": "point",
      "level": 5,
      "title": "(5)support the Coordinating Authorities and the Commission in the performance...",
      "summary": "Support Coordinating Authorities and Commission with regulatory tasks and facilitate cooperation.",
      "hasChildren": false
    },
    {
      "id": "point-454",
      "type": "point",
      "level": 5,
      "title": "(a)creating and maintaining an online register listing the Coordinating Autho...",
      "summary": "Create and maintain online register of Coordinating Authorities with contact details.",
      "hasChildren": false
    },
    {
      "id": "point-455",
      "type": "point",
      "level": 5,
      "title": "(b)providing assistance to the Coordinating Authorities as provided for in Ar...",
      "summary": "Assist Coordinating Authorities according to Article 25(7).",
      "hasChildren": false
    },
    {
      "id": "point-456",
      "type": "point",
      "level": 5,
      "title": "(c)assisting the Commission, upon its request, in connection to its tasks und...",
      "summary": "Help Commission with cooperation tasks when requested under Article 37.",
      "hasChildren": false
    },
    {
      "id": "point-457",
      "type": "point",
      "level": 5,
      "title": "(d)creating, maintaining and operating the information-sharing system referre...",
      "summary": "Create and maintain information-sharing system per Article 39.",
      "hasChildren": false
    },
    {
      "id": "point-458",
      "type": "point",
      "level": 5,
      "title": "(e)assisting the Commission in the preparation of the delegated and implement...",
      "summary": "Help Commission prepare delegated acts, implementing acts and guidelines for this regulation.",
      "hasChildren": false
    },
    {
      "id": "point-459",
      "type": "point",
      "level": 5,
      "title": "(f)providing information to Coordinating Authorities, upon their request or o...",
      "summary": "Provide information to authorities and maintain databases of child abuse indicators and reports.",
      "hasChildren": false
    },
    {
      "id": "point-460",
      "type": "point",
      "level": 5,
      "title": "(6)facilitate the generation and sharing of knowledge with other Union instit...",
      "summary": "Share knowledge with EU bodies and member states to support regulation goals.",
      "hasChildren": false
    },
    {
      "id": "point-461",
      "type": "point",
      "level": 5,
      "title": "(a)collecting, recording, analysing and providing information, providing anal...",
      "summary": "Collect, analyze and share data to combat online child sexual abuse.",
      "hasChildren": false
    },
    {
      "id": "point-462",
      "type": "point",
      "level": 5,
      "title": "(b)supporting the development and dissemination of research and expertise on ...",
      "summary": "Support research and share expertise on victim assistance and evidence-based policy.",
      "hasChildren": false
    },
    {
      "id": "point-463",
      "type": "point",
      "level": 5,
      "title": "(c)drawing up the annual reports referred to in Article 84.",
      "summary": "Create annual reports as specified in Article 84.",
      "hasChildren": false
    },
    {
      "id": "article-464",
      "type": "article",
      "level": 3,
      "title": "Article 44: Databases of indicators",
      "summary": "Member states share and maintain databases tracking environmental indicators.",
      "hasChildren": true
    },
    {
      "id": "paragraph-465",
      "type": "paragraph",
      "level": 4,
      "title": "1.The EU Centre shall create, maintain and operate databases of the following three types of indicators of online child sexual abuse:",
      "summary": "EU Centre must create and maintain databases tracking online child sexual abuse indicators.",
      "hasChildren": true
    },
    {
      "id": "point-466",
      "type": "point",
      "level": 5,
      "title": "(a)indicators to detect the dissemination of child sexual abuse material prev...",
      "summary": "Detect previously identified child abuse material using established indicators.",
      "hasChildren": false
    },
    {
      "id": "point-467",
      "type": "point",
      "level": 5,
      "title": "(b)indicators to detect the dissemination of child sexual abuse material not ...",
      "summary": "Detect new instances of child sexual abuse content not previously identified.",
      "hasChildren": false
    },
    {
      "id": "point-468",
      "type": "point",
      "level": 5,
      "title": "(c)indicators to detect the solicitation of children.",
      "summary": "Identify signs that someone is trying to lure or groom children.",
      "hasChildren": false
    },
    {
      "id": "paragraph-469",
      "type": "paragraph",
      "level": 4,
      "title": "2.The databases of indicators shall solely contain:",
      "summary": "Databases must only include approved indicators - no other data allowed.",
      "hasChildren": true
    },
    {
      "id": "point-470",
      "type": "point",
      "level": 5,
      "title": "(a)relevant indicators, consisting of digital identifiers to be used to detec...",
      "summary": "Digital identifiers for detecting child abuse content and solicitation on online services.",
      "hasChildren": false
    },
    {
      "id": "point-471",
      "type": "point",
      "level": 5,
      "title": "(b)as regards paragraph 1, point (a), the relevant indicators shall include a...",
      "summary": "EU Centre must provide list of URLs per paragraph 3 requirements.",
      "hasChildren": false
    },
    {
      "id": "point-472",
      "type": "point",
      "level": 5,
      "title": "(c)the necessary additional information to facilitate the use of the indicato...",
      "summary": "Provide identifiers to detect child abuse content and solicitation across images, videos, and languages.",
      "hasChildren": false
    },
    {
      "id": "paragraph-473",
      "type": "paragraph",
      "level": 4,
      "title": "3.The EU Centre shall generate the indicators referred to in paragraph 2, point (a), solely on the basis of the child sexual abuse material and the solicitation of children identified as such by the Coordinating Authorities or the courts or other independent authorities of the Member States, submitted to it by the Coordinating Authorities pursuant to Article 36(1), point (a).",
      "summary": "EU Centre generates abuse indicators only from cases verified by Member State authorities.",
      "hasChildren": false
    },
    {
      "id": "paragraph-474",
      "type": "paragraph",
      "level": 4,
      "title": "4.The EU Centre shall keep records of the submissions and of the process applied to generate the indicators and compile the list referred to in the first and second subparagraphs. It shall keep those records for as long as the indicators, including the uniform resource locators, to which they correspond are contained in the databases of indicators referred to in paragraph 1.",
      "summary": "EU Centre must maintain records of submissions and processes while indicators remain in database.",
      "hasChildren": false
    },
    {
      "id": "article-475",
      "type": "article",
      "level": 3,
      "title": "Article 45: Database of reports",
      "summary": "Database stores and tracks all submitted compliance reports.",
      "hasChildren": true
    },
    {
      "id": "paragraph-476",
      "type": "paragraph",
      "level": 4,
      "title": "1.The EU Centre shall create, maintain and operate a database for the reports submitted to it by providers of hosting services and providers of interpersonal communications services in accordance with Article 12(1) and assessed and processed in accordance with Article 48.",
      "summary": "EU Centre must create and manage database for hosting and communications service provider reports.",
      "hasChildren": false
    },
    {
      "id": "paragraph-477",
      "type": "paragraph",
      "level": 4,
      "title": "2.The database of reports shall contain the following information:",
      "summary": "Database must include specified report information.",
      "hasChildren": true
    },
    {
      "id": "point-478",
      "type": "point",
      "level": 5,
      "title": "(a)the report;",
      "summary": "Submit the report.",
      "hasChildren": false
    },
    {
      "id": "point-479",
      "type": "point",
      "level": 5,
      "title": "(b)where the EU Centre considered the report manifestly unfounded, the reason...",
      "summary": "State reason and timing when EU Centre deemed report unfounded.",
      "hasChildren": false
    },
    {
      "id": "point-480",
      "type": "point",
      "level": 5,
      "title": "(c)where the EU Centre forwarded the report in accordance with Article 48(3),...",
      "summary": "Record date, time, and recipient when EU Centre forwards report to law enforcement.",
      "hasChildren": false
    },
    {
      "id": "point-481",
      "type": "point",
      "level": 5,
      "title": "(d)where applicable, information on the requests for and provision of additio...",
      "summary": "Include details about information requests and responses under Article 48(5).",
      "hasChildren": false
    },
    {
      "id": "point-482",
      "type": "point",
      "level": 5,
      "title": "(e)where available, information indicating that the provider that submitted a...",
      "summary": "Provider removed or disabled access to reported child abuse material.",
      "hasChildren": false
    },
    {
      "id": "point-483",
      "type": "point",
      "level": 5,
      "title": "(f)where applicable, information on the EU Centre’s request to the Coordinati...",
      "summary": "Information about EU Centre's removal order requests for child abuse material.",
      "hasChildren": false
    },
    {
      "id": "point-484",
      "type": "point",
      "level": 5,
      "title": "(g)relevant indicators and ancillary tags associated with the reported potent...",
      "summary": "Identify relevant indicators and tags linked to reported child abuse content.",
      "hasChildren": false
    },
    {
      "id": "article-485",
      "type": "article",
      "level": 3,
      "title": "Article 46: Access, accuracy and security",
      "summary": "Personal data must be secure, accurate, and accessible to individuals.",
      "hasChildren": true
    },
    {
      "id": "paragraph-486",
      "type": "paragraph",
      "level": 4,
      "title": "1.Subject to paragraphs 2 and 3, solely EU Centre staff and auditors duly authorised by the Executive Director shall have access to and be entitled to process the data contained in the databases referred to in Articles 44 and 45.",
      "summary": "Only authorized EU Centre staff and auditors can access and process database data.",
      "hasChildren": false
    },
    {
      "id": "paragraph-487",
      "type": "paragraph",
      "level": 4,
      "title": "2.The EU Centre shall give providers of hosting services, providers of interpersonal communications services and providers of internet access services access to the databases of indicators referred to in Article 44, where and to the extent necessary for them to execute the detection or blocking orders that they received in accordance with Articles 7 or 16. It shall take measures to ensure that such access remains limited to what is strictly necessary for the period of application of the detection or blocking orders concerned and that such access does not in any way endanger the proper operation of those databases and the accuracy and security of the data contained therein.",
      "summary": "EU Centre grants service providers database access for detection orders while ensuring security.",
      "hasChildren": false
    },
    {
      "id": "paragraph-488",
      "type": "paragraph",
      "level": 4,
      "title": "3.The EU Centre shall give Coordinating Authorities access to the databases of indicators referred to in Article 44 where and to the extent necessary for the performance of their tasks under this Regulation.",
      "summary": "EU Centre must grant authorities database access when needed for regulatory tasks.",
      "hasChildren": false
    },
    {
      "id": "paragraph-489",
      "type": "paragraph",
      "level": 4,
      "title": "4.The EU Centre shall give Europol and the competent law enforcement authorities of the Member States access to the databases of indicators referred to in Article 44 where and to the extent necessary for the performance of their tasks of investigating suspected child sexual abuse offences.",
      "summary": "EU Centre must give law enforcement access to abuse indicators database for investigations.",
      "hasChildren": false
    },
    {
      "id": "paragraph-490",
      "type": "paragraph",
      "level": 4,
      "title": "5.The EU Centre shall give Europol access to the databases of reports referred to in Article 45, where and to the extent necessary for the performance of its tasks of assisting investigations of suspected child sexual abuse offences",
      "summary": "EU Centre must give Europol database access for investigating child sexual abuse cases.",
      "hasChildren": false
    },
    {
      "id": "paragraph-491",
      "type": "paragraph",
      "level": 4,
      "title": "6.The EU Centre shall provide the access referred to in paragraphs 2, 3, 4 and 5 only upon the reception of a request, specifying the purpose of the request, the modalities of the requested access, and the degree of access needed to achieve that purpose. The requests for the access referred to in paragraph 2 shall also include a reference to the detection order or the blocking order, as applicable.",
      "summary": "EU Centre grants access only after receiving detailed request specifying purpose and scope.",
      "hasChildren": false
    },
    {
      "id": "paragraph-492",
      "type": "paragraph",
      "level": 4,
      "title": "7.The EU Centre shall regularly verify that the data contained in the databases referred to in Articles 44 and 45 is, in all respects, complete, accurate and up-to-date and continues to be necessary for the purposes of reporting, detection and blocking in accordance with this Regulation, as well as facilitating and monitoring of accurate detection technologies and processes. In particular, as regards the uniform resource locators contained in the database referred to Article 44(1), point (a), the EU Centre shall, where necessary in cooperation with the Coordination Authorities, regularly verify that the conditions of Article 36(1), point (b), continue to be met. Those verifications shall include audits, where appropriate. Where necessary in view of those verifications, it shall immediately complement, adjust or delete the data.",
      "summary": "EU Centre must verify and maintain accurate database records through regular audits and updates.",
      "hasChildren": false
    },
    {
      "id": "paragraph-493",
      "type": "paragraph",
      "level": 4,
      "title": "8.The EU Centre shall ensure that the data contained in the databases referred to in Articles 44 and 45 is stored in a secure manner and that the storage is subject to appropriate technical and organisational safeguards. Those safeguards shall ensure, in particular, that the data can be accessed and processed only by duly authorised persons for the purpose for which the person is authorised and that a high level of security is achieved. The EU Centre shall regularly review those safeguards and adjust them where necessary.",
      "summary": "EU Centre must secure database access, limit to authorized users, and regularly review safeguards.",
      "hasChildren": false
    },
    {
      "id": "article-494",
      "type": "article",
      "level": 3,
      "title": "Article 47",
      "summary": "I cannot provide a summary without seeing the actual Article 47 content. Please share the article text you'd like me to summarize.",
      "hasChildren": true
    },
    {
      "id": "paragraph-495",
      "type": "paragraph",
      "level": 4,
      "title": "The Commission shall be empowered to adopt delegated acts in accordance with Article 86 in order ...",
      "summary": "Commission can create additional rules under Article 86 to supplement this Regulation.",
      "hasChildren": false
    },
    {
      "id": "point-496",
      "type": "point",
      "level": 5,
      "title": "(a)the types, precise content, set-up and operation of the databases of indic...",
      "summary": "Define database requirements for indicators including types, content, setup and operation details.",
      "hasChildren": false
    },
    {
      "id": "point-497",
      "type": "point",
      "level": 5,
      "title": "(b)the processing of the submissions by Coordinating Authorities, the generat...",
      "summary": "Coordinating Authorities must process submissions, generate indicators, compile URLs, and maintain records.",
      "hasChildren": false
    },
    {
      "id": "point-498",
      "type": "point",
      "level": 5,
      "title": "(c)the precise content, set-up and operation of the database of reports refer...",
      "summary": "Database requirements for report storage and management must be specified.",
      "hasChildren": false
    },
    {
      "id": "point-499",
      "type": "point",
      "level": 5,
      "title": "(d)access to the databases referred to in Articles 44 and 45, including the m...",
      "summary": "Access databases in Articles 44-45, following procedures in Article 46.",
      "hasChildren": false
    },
    {
      "id": "point-500",
      "type": "point",
      "level": 5,
      "title": "(e)the regular verifications and audits to ensure that the data contained in ...",
      "summary": "Regularly verify and audit databases for accuracy, completeness, security and proper data storage.",
      "hasChildren": false
    },
    {
      "id": "article-501",
      "type": "article",
      "level": 3,
      "title": "Article 48: Reporting",
      "summary": "Member states must report compliance data to Commission annually.",
      "hasChildren": true
    },
    {
      "id": "paragraph-502",
      "type": "paragraph",
      "level": 4,
      "title": "1.The EU Centre shall expeditiously assess and process reports submitted by providers of hosting services and providers of interpersonal communications services in accordance with Article 12 to determine whether the reports are manifestly unfounded or are to be forwarded.",
      "summary": "EU Centre must quickly review service provider reports to determine validity and forwarding status.",
      "hasChildren": false
    },
    {
      "id": "paragraph-503",
      "type": "paragraph",
      "level": 4,
      "title": "2.Where the EU Centre considers that the report is manifestly unfounded, it shall inform the provider that submitted the report, specifying the reasons why it considers the report to be unfounded.",
      "summary": "EU Centre must explain to provider why their submitted report lacks merit.",
      "hasChildren": false
    },
    {
      "id": "paragraph-504",
      "type": "paragraph",
      "level": 4,
      "title": "3.Where the EU Centre considers that a report is not manifestly unfounded, it shall forward the report, together with any additional relevant information available to it, to Europol and to the competent law enforcement authority or authorities of the Member State likely to have jurisdiction to investigate or prosecute the potential child sexual abuse to which the report relates.",
      "summary": "EU Centre forwards valid abuse reports to Europol and relevant national law enforcement authorities.",
      "hasChildren": false
    },
    {
      "id": "paragraph-505",
      "type": "paragraph",
      "level": 4,
      "title": "4.Where a provider that submitted the report has indicated that the report requires urgent action, the EU Centre shall assess and process that report as a matter of priority and, where it forwards the report in accordance with paragraph 3 and it considers that the report requires urgent action, shall ensure that the forwarded report is marked as such.",
      "summary": "EU Centre must prioritize and mark urgent reports when forwarding them.",
      "hasChildren": false
    },
    {
      "id": "paragraph-506",
      "type": "paragraph",
      "level": 4,
      "title": "5.Where the report does not contain all the information required in Article 13, the EU Centre may request the provider that submitted the report to provide the missing information.",
      "summary": "EU Centre can request providers to supply missing information from incomplete reports.",
      "hasChildren": false
    },
    {
      "id": "paragraph-507",
      "type": "paragraph",
      "level": 4,
      "title": "6.Where so requested by a competent law enforcement authority of a Member State in order to avoid interfering with activities for the prevention, detection, investigation and prosecution of child sexual abuse offences, the EU Centre shall:",
      "summary": "EU Centre must comply with law enforcement requests regarding child abuse investigations.",
      "hasChildren": true
    },
    {
      "id": "point-508",
      "type": "point",
      "level": 5,
      "title": "(a)communicate to the provider that submitted the report that it is not to in...",
      "summary": "Tell provider not to inform user about report for specified timeframe.",
      "hasChildren": false
    },
    {
      "id": "point-509",
      "type": "point",
      "level": 5,
      "title": "(b)where the provider that submitted the report is a provider of hosting serv...",
      "summary": "Tell hosting provider not to remove reported child abuse content for specified timeframe.",
      "hasChildren": false
    },
    {
      "id": "paragraph-510",
      "type": "paragraph",
      "level": 4,
      "title": "7.The time periods referred to in the first subparagraph, points (a) and (b), shall be those specified in the competent law enforcement authority’s request to the EU Centre, provided that they remain limited to what is necessary to avoid interference with the relevant activities and does not exceed 18 months.",
      "summary": "Law enforcement time period requests to EU Centre must not exceed 18 months.",
      "hasChildren": false
    },
    {
      "id": "paragraph-511",
      "type": "paragraph",
      "level": 4,
      "title": "8.The EU Centre shall verify whether a provider of hosting services that submitted a report concerning the potential dissemination of child sexual abuse material removed or disabled access to the material, insofar as the material is publicly accessible. Where it considers that the provider did not remove or disable access to the material expeditiously, the EU Centre shall inform the Coordinating Authority of establishment thereof.",
      "summary": "EU Centre verifies if hosts remove reported child abuse content, alerts authorities if removal delayed.",
      "hasChildren": false
    },
    {
      "id": "article-512",
      "type": "article",
      "level": 3,
      "title": "Article 49: Searches and notification",
      "summary": "Police search procedures and required notifications to affected parties.",
      "hasChildren": true
    },
    {
      "id": "paragraph-513",
      "type": "paragraph",
      "level": 4,
      "title": "1.The EU Centre shall have the power to conduct searches on hosting services for the dissemination of publicly accessible child sexual abuse material, using the relevant indicators from the database of indicators referred to in Article 44(1), points (a) and (b), in the following situations:",
      "summary": "EU Centre can search hosting services for public child abuse content using database indicators.",
      "hasChildren": true
    },
    {
      "id": "point-514",
      "type": "point",
      "level": 5,
      "title": "(a)where so requested to support a victim by verifying whether the provider o...",
      "summary": "Verify removal of child abuse content when victims request confirmation of takedown.",
      "hasChildren": false
    },
    {
      "id": "point-515",
      "type": "point",
      "level": 5,
      "title": "(b)where so requested to assist a Coordinating Authority by verifying the pos...",
      "summary": "Verify need for detection/removal orders when requested by Coordinating Authority.",
      "hasChildren": false
    },
    {
      "id": "paragraph-516",
      "type": "paragraph",
      "level": 4,
      "title": "2.The EU Centre shall have the power to notify, after having conducted the searches referred to in paragraph 1, providers of hosting services of the presence of one or more specific items of known child sexual abuse material on their services and request them to remove or disable access to that item or those items, for the providers’ voluntary consideration.",
      "summary": "EU Centre can notify hosts about CSAM content and request voluntary removal.",
      "hasChildren": false
    },
    {
      "id": "paragraph-517",
      "type": "paragraph",
      "level": 4,
      "title": "3.Where so requested by a competent law enforcement authority of a Member State in order to avoid interfering with activities for the prevention, detection, investigation and prosecution of child sexual abuse offences, the EU Centre shall not submit a notice, for as long as necessary to avoid such interference but no longer than 18 months.",
      "summary": "EU Centre delays notices up to 18 months when law enforcement requests.",
      "hasChildren": false
    },
    {
      "id": "article-518",
      "type": "article",
      "level": 3,
      "title": "Article 50: Technologies, information and expertise",
      "summary": "Sharing technologies and knowledge between developed and developing nations.",
      "hasChildren": true
    },
    {
      "id": "paragraph-519",
      "type": "paragraph",
      "level": 4,
      "title": "1.The EU Centre shall make available technologies that providers of hosting services and providers of interpersonal communications services may acquire, install and operate, free of charge, where relevant subject to reasonable licensing conditions, to execute detection orders in accordance with Article 10(1).",
      "summary": "EU Centre provides free detection technologies to hosting and communication service providers.",
      "hasChildren": false
    },
    {
      "id": "paragraph-520",
      "type": "paragraph",
      "level": 4,
      "title": "2.The EU Centre shall collect, record, analyse and make available relevant, objective, reliable and comparable information on matters related to the prevention and combating of child sexual abuse, in particular:",
      "summary": "EU Centre must gather and share data about preventing and fighting child sexual abuse.",
      "hasChildren": true
    },
    {
      "id": "point-521",
      "type": "point",
      "level": 5,
      "title": "(a)information obtained in the performance of its tasks under this Regulation...",
      "summary": "Information about detecting, reporting, removing, and blocking child sexual abuse content online.",
      "hasChildren": false
    },
    {
      "id": "point-522",
      "type": "point",
      "level": 5,
      "title": "(b)information resulting from the research, surveys and studies referred to i...",
      "summary": "Research, survey and study findings from paragraph 3",
      "hasChildren": false
    },
    {
      "id": "point-523",
      "type": "point",
      "level": 5,
      "title": "(c)information resulting from research or other activities conducted by Membe...",
      "summary": "Research findings from government agencies, institutions, organizations, and civil society groups.",
      "hasChildren": false
    },
    {
      "id": "paragraph-524",
      "type": "paragraph",
      "level": 4,
      "title": "3.Where necessary for the performance of its tasks under this Regulation, the EU Centre shall carry out, participate in or encourage research, surveys and studies, either on its own initiative or, where appropriate and compatible with its priorities and its annual work programme, at the request of the European Parliament, the Council or the Commission.",
      "summary": "EU Centre conducts research independently or by request from EU Parliament, Council, or Commission.",
      "hasChildren": false
    },
    {
      "id": "paragraph-525",
      "type": "paragraph",
      "level": 4,
      "title": "4.The EU Centre shall provide the information referred to in paragraph 2 and the information resulting from the research, surveys and studies referred to in paragraph 3, including its analysis thereof, and its opinions on matters related to the prevention and combating of online child sexual abuse to other Union institutions, bodies, offices and agencies, Coordinating Authorities, other competent authorities and other public authorities of the Member States, either on its own initiative or at request of the relevant authority. Where appropriate, the EU Centre shall make such information publicly available.",
      "summary": "EU Centre shares child abuse prevention research with authorities and may publish publicly.",
      "hasChildren": false
    },
    {
      "id": "paragraph-526",
      "type": "paragraph",
      "level": 4,
      "title": "5.The EU Centre shall develop a communication strategy and promote dialogue with civil society organisations and providers of hosting or interpersonal communication services to raise public awareness of online child sexual abuse and measures to prevent and combat such abuse.",
      "summary": "EU Centre to create strategy raising awareness of online child sexual abuse prevention.",
      "hasChildren": false
    },
    {
      "id": "section-527",
      "type": "section",
      "level": 2,
      "title": "Section 3: Processing of information",
      "summary": "Process all data according to established protocols and security standards.",
      "hasChildren": true
    },
    {
      "id": "article-528",
      "type": "article",
      "level": 3,
      "title": "Article 51: Processing activities and data protection",
      "summary": "Data processing rules and privacy safeguards for personal information.",
      "hasChildren": true
    },
    {
      "id": "paragraph-529",
      "type": "paragraph",
      "level": 4,
      "title": "1.In so far as is necessary for the performance of its tasks under this Regulation, the EU Centre may process personal data.",
      "summary": "EU Centre can process personal data when needed for regulatory tasks.",
      "hasChildren": false
    },
    {
      "id": "paragraph-530",
      "type": "paragraph",
      "level": 4,
      "title": "2.The EU Centre shall process personal data as strictly necessary for the purposes of:",
      "summary": "EU Centre processes personal data only when required for specified purposes.",
      "hasChildren": true
    },
    {
      "id": "point-531",
      "type": "point",
      "level": 5,
      "title": "(a)providing the opinions on intended detection orders referred to in Article...",
      "summary": "Provide opinions on detection orders.",
      "hasChildren": false
    },
    {
      "id": "point-532",
      "type": "point",
      "level": 5,
      "title": "(b)cooperating with and responding to requests of Coordinating Authorities in...",
      "summary": "Cooperate with authorities on blocking order requests.",
      "hasChildren": false
    },
    {
      "id": "point-533",
      "type": "point",
      "level": 5,
      "title": "(c)receiving and processing blocking orders transmitted to it pursuant to Art...",
      "summary": "Receive and process blocking orders sent under Article 17(3).",
      "hasChildren": false
    },
    {
      "id": "point-534",
      "type": "point",
      "level": 5,
      "title": "(d)cooperating with Coordinating Authorities in accordance with Articles 20 a...",
      "summary": "Cooperate with authorities to help victims access information and assistance.",
      "hasChildren": false
    },
    {
      "id": "point-535",
      "type": "point",
      "level": 5,
      "title": "(e)maintaining up-to-date records of contact points and legal representatives...",
      "summary": "Keep current records of service providers' contact details and legal representatives.",
      "hasChildren": false
    },
    {
      "id": "point-536",
      "type": "point",
      "level": 5,
      "title": "(f)creating and maintaining an online register listing the Coordinating Autho...",
      "summary": "Create and maintain online register of Coordinating Authorities with contact details.",
      "hasChildren": false
    },
    {
      "id": "point-537",
      "type": "point",
      "level": 5,
      "title": "(g)providing assistance to Coordinating Authorities in accordance with Articl...",
      "summary": "Help Coordinating Authorities as specified in Article 25(7).",
      "hasChildren": false
    },
    {
      "id": "point-538",
      "type": "point",
      "level": 5,
      "title": "(h)assisting the Commission, upon its request, in connection to its tasks und...",
      "summary": "Assist Commission with cooperation tasks when requested under Article 37.",
      "hasChildren": false
    },
    {
      "id": "point-539",
      "type": "point",
      "level": 5,
      "title": "(i)create, maintain and operate the databases of indicators referred to in Ar...",
      "summary": "Create and maintain indicator databases as specified in Article 44.",
      "hasChildren": false
    },
    {
      "id": "point-540",
      "type": "point",
      "level": 5,
      "title": "(j)create, maintain and operate the database of reports referred to in Articl...",
      "summary": "Create and maintain database of reports.",
      "hasChildren": false
    },
    {
      "id": "point-541",
      "type": "point",
      "level": 5,
      "title": "(k)providing and monitoring access to the databases of indicators and of repo...",
      "summary": "Provide and monitor access to indicator and report databases.",
      "hasChildren": false
    },
    {
      "id": "point-542",
      "type": "point",
      "level": 5,
      "title": "(l)performing data quality control measures in accordance with Article 46(7);",
      "summary": "Perform data quality control as specified in Article 46(7).",
      "hasChildren": false
    },
    {
      "id": "point-543",
      "type": "point",
      "level": 5,
      "title": "(m)assessing and processing reports of potential online child sexual abuse in...",
      "summary": "Process and assess reports of online child sexual abuse.",
      "hasChildren": false
    },
    {
      "id": "point-544",
      "type": "point",
      "level": 5,
      "title": "(n)cooperating with Europol and partner organisations in accordance with Arti...",
      "summary": "Cooperate with Europol and partners to identify victims and generate statistics.",
      "hasChildren": false
    },
    {
      "id": "point-545",
      "type": "point",
      "level": 5,
      "title": "(o)generating statistics in accordance with Article 83.",
      "summary": "Generate statistics as required by Article 83.",
      "hasChildren": false
    },
    {
      "id": "paragraph-546",
      "type": "paragraph",
      "level": 4,
      "title": "3.The EU Centre shall store the personal data referred to in paragraph 2 only where and for as long as strictly necessary for the applicable purposes listed in paragraph 2.",
      "summary": "EU Centre must only store personal data when necessary for specified purposes.",
      "hasChildren": false
    },
    {
      "id": "paragraph-547",
      "type": "paragraph",
      "level": 4,
      "title": "4.It shall ensure that the personal data is stored in a secure manner and that the storage is subject to appropriate technical and organisational safeguards. Those safeguards shall ensure, in particular, that the personal data can be accessed and processed only for the purpose for which it is stored, that a high level of security is achieved and that the personal data is deleted when no longer strictly necessary for the applicable purposes. It shall regularly review those safeguards and adjust them where necessary.",
      "summary": "Securely store data, implement safeguards, limit access, delete when unnecessary, review security regularly.",
      "hasChildren": false
    },
    {
      "id": "section-548",
      "type": "section",
      "level": 2,
      "title": "Section 4",
      "summary": "ERROR: No content provided to summarize in \"Section 4\". Please share the actual content you'd like summarized.",
      "hasChildren": true
    },
    {
      "id": "article-549",
      "type": "article",
      "level": 3,
      "title": "Article 52: Contact officers",
      "summary": "Member States must designate contact officers for EU data protection.",
      "hasChildren": true
    },
    {
      "id": "paragraph-550",
      "type": "paragraph",
      "level": 4,
      "title": "1.Each Coordinating Authority shall designate at least one contact officer, who shall be the main contact point for the EU Centre in the Member State concerned. The contact officers may be seconded to the EU Centre. Where several contact officers are designated, the Coordinating Authority shall designate one of them as the main contact officer.",
      "summary": "Coordinating Authorities must appoint main contact officer for EU Centre communication.",
      "hasChildren": false
    },
    {
      "id": "paragraph-551",
      "type": "paragraph",
      "level": 4,
      "title": "2.Contact officers shall assist in the exchange of information between the EU Centre and the Coordinating Authorities that designated them. Where the EU Centre receives reports submitted in accordance with Article 12 concerning the potential dissemination of new child sexual abuse material or the potential solicitation of children, the contact officers designated by the competent Member State shall facilitate the process to determine the illegality of the material or conversation, in accordance with Article 36(1).",
      "summary": "Contact officers help determine legality of reported child abuse content between EU Centre and authorities.",
      "hasChildren": false
    },
    {
      "id": "paragraph-552",
      "type": "paragraph",
      "level": 4,
      "title": "3.The Management Board shall determine the rights and obligations of contact officers in relation to the EU Centre. Contact officers shall enjoy the privileges and immunities necessary for the performance of their tasks.",
      "summary": "Management Board sets contact officer rights and grants immunity for their duties.",
      "hasChildren": false
    },
    {
      "id": "paragraph-553",
      "type": "paragraph",
      "level": 4,
      "title": "4.Where contact officers are seconded to the EU Centre, the EU Centre shall cover the costs of providing them with the necessary premises within the building and adequate support for contact officers to perform their duties. All other costs that arise in connection with the designation of contact officers and the performance of their tasks shall be borne by the Coordinating Authority that designated them.",
      "summary": "EU Centre covers office space costs; designating authority pays all other contact officer expenses.",
      "hasChildren": false
    },
    {
      "id": "article-554",
      "type": "article",
      "level": 3,
      "title": "Article 53: Cooperation with Europol",
      "summary": "Law enforcement data sharing between EU member states and Europol.",
      "hasChildren": true
    },
    {
      "id": "paragraph-555",
      "type": "paragraph",
      "level": 4,
      "title": "1.Where necessary for the performance of its tasks under this Regulation, within their respective mandates, the EU Centre shall cooperate with Europol.",
      "summary": "EU Centre must cooperate with Europol when needed to perform regulatory tasks.",
      "hasChildren": false
    },
    {
      "id": "paragraph-556",
      "type": "paragraph",
      "level": 4,
      "title": "2.Europol and the EU Centre shall provide each other with the fullest possible access to relevant information and information systems, where necessary for the performance of their respective tasks and in accordance with the acts of Union law regulating such access.",
      "summary": "Europol and EU Centre must share access to information systems for their tasks.",
      "hasChildren": false
    },
    {
      "id": "paragraph-557",
      "type": "paragraph",
      "level": 4,
      "title": "3.The terms of cooperation and working arrangements shall be laid down in a memorandum of understanding.",
      "summary": "Document cooperation terms in memorandum of understanding.",
      "hasChildren": false
    },
    {
      "id": "article-558",
      "type": "article",
      "level": 3,
      "title": "Article 54: Cooperation with partner organisations",
      "summary": "EU agencies coordinate and share information with partner organizations.",
      "hasChildren": true
    },
    {
      "id": "paragraph-559",
      "type": "paragraph",
      "level": 4,
      "title": "1.Where necessary for the performance of its tasks under this Regulation, the EU Centre may cooperate with organisations and networks with information and expertise on matters related to the prevention and combating of online child sexual abuse, including civil society organisations and semi-public organisations.",
      "summary": "EU Centre can partner with organizations to combat online child sexual abuse.",
      "hasChildren": false
    },
    {
      "id": "paragraph-560",
      "type": "paragraph",
      "level": 4,
      "title": "2.The EU Centre may conclude memoranda of understanding with organisations referred to in paragraph 1, laying down the terms of cooperation.",
      "summary": "EU Centre can establish cooperation agreements with referenced organizations.",
      "hasChildren": false
    },
    {
      "id": "section-561",
      "type": "section",
      "level": 2,
      "title": "Section 5: Organisation",
      "summary": "Keep files organized by project, with clear naming conventions and folder structures.",
      "hasChildren": true
    },
    {
      "id": "article-562",
      "type": "article",
      "level": 3,
      "title": "Article 55: Administrative and management structure",
      "summary": "UN Secretariat organization, roles and staff management procedures.",
      "hasChildren": true
    },
    {
      "id": "point-563",
      "type": "point",
      "level": 5,
      "title": "(a)a Management Board, which shall exercise the functions set out in Article 57;",
      "summary": "Management Board performs functions specified in Article 57.",
      "hasChildren": false
    },
    {
      "id": "point-564",
      "type": "point",
      "level": 5,
      "title": "(b)an Executive Board which shall perform the tasks set out in Article 62;",
      "summary": "Executive Board performs tasks specified in Article 62.",
      "hasChildren": false
    },
    {
      "id": "point-565",
      "type": "point",
      "level": 5,
      "title": "(c)an Executive Director of the EU Centre, who shall exercise the responsibil...",
      "summary": "EU Centre Executive Director performs duties outlined in Article 64.",
      "hasChildren": false
    },
    {
      "id": "point-566",
      "type": "point",
      "level": 5,
      "title": "(d)a Technology Committee as an advisory group, which shall exercise the task...",
      "summary": "Technology Committee serves as advisory group for Article 66 tasks.",
      "hasChildren": false
    },
    {
      "id": "article-567",
      "type": "article",
      "level": 3,
      "title": "Article 56: Composition of the Management Board",
      "summary": "Management Board members appointed by Council and Commission representatives.",
      "hasChildren": true
    },
    {
      "id": "paragraph-568",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Management Board shall be composed of one representative from each Member State and two representatives of the Commission, all as members with voting rights.",
      "summary": "Management Board: one representative per Member State plus two Commission representatives with votes.",
      "hasChildren": false
    },
    {
      "id": "paragraph-569",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Management Board shall also include one independent expert observer designated by the European Parliament, without the right to vote.",
      "summary": "Parliament appoints non-voting expert observer to Management Board.",
      "hasChildren": false
    },
    {
      "id": "paragraph-570",
      "type": "paragraph",
      "level": 4,
      "title": "3.Each member of the Management Board shall have an alternate. The alternate shall represent the member in his/her absence.",
      "summary": "Management Board members must have alternates who represent them when absent.",
      "hasChildren": false
    },
    {
      "id": "paragraph-571",
      "type": "paragraph",
      "level": 4,
      "title": "4.Members of the Management Board and their alternates shall be appointed in the light of their knowledge in the field of combating child sexual abuse, taking into account relevant managerial, administrative and budgetary skills. Member States shall appoint a representative of their Coordinating Authority, within four months of [date of entry into force of this Regulation]. All parties represented in the Management Board shall make efforts to limit turnover of their representatives, in order to ensure continuity of its work. All parties shall aim to achieve a balanced representation between men and women on the Management Board.",
      "summary": "Management Board members need expertise in child abuse prevention and management skills. States appoint representatives.",
      "hasChildren": false
    },
    {
      "id": "paragraph-572",
      "type": "paragraph",
      "level": 4,
      "title": "5.The term of office for members and their alternates shall be four years. That term may be renewed.",
      "summary": "Members and alternates serve 4-year terms, with option to renew.",
      "hasChildren": false
    },
    {
      "id": "article-573",
      "type": "article",
      "level": 3,
      "title": "Article 57: Functions of the Management Board",
      "summary": "Management Board oversees operations, decisions, and organizational governance.",
      "hasChildren": true
    },
    {
      "id": "paragraph-574",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Management Board shall:",
      "summary": "Management Board's duties and responsibilities follow:",
      "hasChildren": true
    },
    {
      "id": "point-575",
      "type": "point",
      "level": 5,
      "title": "(a)give the general orientations for the EU Centre's activities;",
      "summary": "Set overall direction and priorities for EU Centre operations.",
      "hasChildren": false
    },
    {
      "id": "point-576",
      "type": "point",
      "level": 5,
      "title": "(b)contribute to facilitate the effective cooperation with and between the Co...",
      "summary": "Help Coordinating Authorities work together effectively.",
      "hasChildren": false
    },
    {
      "id": "point-577",
      "type": "point",
      "level": 5,
      "title": "(c)adopt rules for the prevention and management of conflicts of interest in ...",
      "summary": "Create and publish conflict of interest rules for board and committee members.",
      "hasChildren": false
    },
    {
      "id": "point-578",
      "type": "point",
      "level": 5,
      "title": "(d)adopt the assessment of performance of the Executive Board referred to in ...",
      "summary": "Approve Executive Board performance evaluation.",
      "hasChildren": false
    },
    {
      "id": "point-579",
      "type": "point",
      "level": 5,
      "title": "(e)adopt and make public its Rules of Procedure;",
      "summary": "Create and publish procedural rules.",
      "hasChildren": false
    },
    {
      "id": "point-580",
      "type": "point",
      "level": 5,
      "title": "(f)appoint the members of the Technology Committee, and of any other advisory...",
      "summary": "Appoint members to Technology Committee and other advisory groups.",
      "hasChildren": false
    },
    {
      "id": "point-581",
      "type": "point",
      "level": 5,
      "title": "(g)adopt the opinions on intended detection orders referred to in Article 7(4...",
      "summary": "Adopt opinions on detection orders based on Executive Director's draft.",
      "hasChildren": false
    },
    {
      "id": "point-582",
      "type": "point",
      "level": 5,
      "title": "(h)adopt and regularly update the communication and dissemination plans refer...",
      "summary": "Update communication and dissemination plans based on needs analysis.",
      "hasChildren": false
    },
    {
      "id": "article-583",
      "type": "article",
      "level": 3,
      "title": "Article 58: Chairperson of the Management Board",
      "summary": "Board chairperson selection, duties, and term length requirements.",
      "hasChildren": true
    },
    {
      "id": "paragraph-584",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Management Board shall elect a Chairperson and a Deputy Chairperson from among its members. The Chairperson and the Deputy Chairperson shall be elected by a majority of two thirds of the members of the Management Board.",
      "summary": "Management Board elects Chair and Deputy Chair by two-thirds majority vote.",
      "hasChildren": false
    },
    {
      "id": "paragraph-585",
      "type": "paragraph",
      "level": 4,
      "title": "2.The term of office of the Chairperson and the deputy Chairperson shall be four years. Their term of office may be renewed once. If, however, their membership of the Management Board ends at any time during their term of office, their term of office shall automatically expire on that date.",
      "summary": "Chair and Deputy serve 4-year terms, renewable once, ending with Board membership expiration.",
      "hasChildren": false
    },
    {
      "id": "article-586",
      "type": "article",
      "level": 3,
      "title": "Article 59: Meetings of the Management Board",
      "summary": "Management Board meeting procedures, voting rules, and attendance requirements.",
      "hasChildren": true
    },
    {
      "id": "paragraph-587",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Chairperson shall convene the meetings of the Management Board.",
      "summary": "Chairperson must schedule and call Management Board meetings.",
      "hasChildren": false
    },
    {
      "id": "paragraph-588",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Executive Director shall take part in the deliberations, without the right to vote.",
      "summary": "Executive Director participates in discussions but cannot vote.",
      "hasChildren": false
    },
    {
      "id": "paragraph-589",
      "type": "paragraph",
      "level": 4,
      "title": "3.The Management Board shall hold at least two ordinary meetings a year. In addition, it shall meet on the initiative of its Chairperson, at the request of the Commission, or at the request of at least one-third of its members.",
      "summary": "Management Board meets twice yearly, plus when requested by Chair, Commission, or one-third members.",
      "hasChildren": false
    },
    {
      "id": "paragraph-590",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Management Board may invite any person whose opinion may be of interest to attend its meetings as an observer.",
      "summary": "Management Board can invite observers with relevant expertise to meetings.",
      "hasChildren": false
    },
    {
      "id": "paragraph-591",
      "type": "paragraph",
      "level": 4,
      "title": "5.The members of the Management Board and their alternates may, subject to its rules of procedure, be assisted at the meetings by advisers or experts.",
      "summary": "Board members and alternates can bring advisers/experts to meetings, following procedural rules.",
      "hasChildren": false
    },
    {
      "id": "paragraph-592",
      "type": "paragraph",
      "level": 4,
      "title": "6.The EU Centre shall provide the secretariat for the Management Board.",
      "summary": "EU Centre must provide Management Board's secretariat.",
      "hasChildren": false
    },
    {
      "id": "article-593",
      "type": "article",
      "level": 3,
      "title": "Article 60: Voting rules of the Management Board",
      "summary": "Management Board decisions require two-thirds majority vote.",
      "hasChildren": true
    },
    {
      "id": "paragraph-594",
      "type": "paragraph",
      "level": 4,
      "title": "1.Unless provided otherwise in this Regulation, the Management Board shall take decisions by absolute majority of its members.",
      "summary": "Management Board decisions require absolute majority vote from members.",
      "hasChildren": false
    },
    {
      "id": "paragraph-595",
      "type": "paragraph",
      "level": 4,
      "title": "2.Each member shall have one vote. In the absence of a member, his/her alternate shall be entitled to exercise his/her right to vote.",
      "summary": "Members get one vote. Alternates can vote when replacing absent members.",
      "hasChildren": false
    },
    {
      "id": "paragraph-596",
      "type": "paragraph",
      "level": 4,
      "title": "3.The Executive Director shall not take part in the voting.",
      "summary": "Executive Director cannot vote.",
      "hasChildren": false
    },
    {
      "id": "paragraph-597",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Management Board's rules of procedure shall establish more detailed voting arrangements, in particular the circumstances in which a member may act on behalf of another member.",
      "summary": "Management Board rules must specify when members can vote for other members.",
      "hasChildren": false
    },
    {
      "id": "article-598",
      "type": "article",
      "level": 3,
      "title": "Article 61: Composition and appointment of the Executive Board",
      "summary": "Executive Board members: selection process and membership requirements.",
      "hasChildren": true
    },
    {
      "id": "paragraph-599",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Executive Board shall be composed of the Chairperson and the Deputy Chairperson of the Management Board, two other members appointed by the Management Board from among its members with the right to vote and two representatives of the Commission to the Management Board. The Chairperson of the Management Board shall also be the Chairperson of the Executive Board.",
      "summary": "Executive Board: Chair, Deputy Chair, 2 Management Board members, 2 Commission representatives.",
      "hasChildren": false
    },
    {
      "id": "paragraph-600",
      "type": "paragraph",
      "level": 4,
      "title": "2.The term of office of members of the Executive Board shall be four years. In the course of the 12 months preceding the end of the four-year term of office of the Chairperson and five members of the Executive Board, the Management Board or a smaller committee selected among Management Board members including a Commission representative shall carry out an assessment of performance of the Executive Board. The assessment shall take into account an evaluation of the Executive Board members’ performance and the EU Centre’s future tasks and challenges. Based on the assessment, the Management Board may extend their term of office once.",
      "summary": "Executive Board members serve 4-year terms; Management Board can extend once after performance review.",
      "hasChildren": false
    },
    {
      "id": "article-601",
      "type": "article",
      "level": 3,
      "title": "Article 62: Tasks of the Executive Board",
      "summary": "Manages daily operations and implements Council decisions for European Central Bank.",
      "hasChildren": true
    },
    {
      "id": "paragraph-602",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Executive Board shall be responsible for the overall planning and the execution of the tasks conferred on the EU Centre pursuant to Article 43. The Executive Board shall adopt all the decisions of the EU Centre with the exception of the decisions that shall be taken by the Management Board in accordance with Article 57.",
      "summary": "Executive Board plans and executes EU Centre tasks, makes decisions except Management Board matters.",
      "hasChildren": false
    },
    {
      "id": "paragraph-603",
      "type": "paragraph",
      "level": 4,
      "title": "2.In addition, the Executive Board shall have the following tasks:",
      "summary": "Executive Board has additional responsibilities (listed below)",
      "hasChildren": true
    },
    {
      "id": "point-604",
      "type": "point",
      "level": 5,
      "title": "(a)adopt, by 30 November of each year, on the basis of a proposal by the Exec...",
      "summary": "Adopt annual programming document by November 30 and send to EU bodies by January 31.",
      "hasChildren": false
    },
    {
      "id": "point-605",
      "type": "point",
      "level": 5,
      "title": "(b)adopt the draft annual budget of the EU Centre and exercise other function...",
      "summary": "Adopt EU Centre's draft budget and manage budget-related functions.",
      "hasChildren": false
    },
    {
      "id": "point-606",
      "type": "point",
      "level": 5,
      "title": "(c)assess and adopt a consolidated annual activity report on the EU Centre's ...",
      "summary": "Review and approve EU Centre's yearly activity report by July 1.",
      "hasChildren": false
    },
    {
      "id": "point-607",
      "type": "point",
      "level": 5,
      "title": "(d)adopt an anti-fraud strategy, proportionate to fraud risks taking into acc...",
      "summary": "Create risk-based anti-fraud strategy considering costs, benefits, and organizational controls.",
      "hasChildren": false
    },
    {
      "id": "point-608",
      "type": "point",
      "level": 5,
      "title": "(e)adopt rules for the prevention and management of conflicts of interest in ...",
      "summary": "Create rules to prevent and manage member conflicts of interest.",
      "hasChildren": false
    },
    {
      "id": "point-609",
      "type": "point",
      "level": 5,
      "title": "(f)adopt its rules of procedure;",
      "summary": "Create and approve internal operating rules.",
      "hasChildren": false
    },
    {
      "id": "point-610",
      "type": "point",
      "level": 5,
      "title": "(g)exercise, with respect to the staff of the EU Centre, the powers conferred...",
      "summary": "Exercise staff management and hiring authority for EU Centre employees.",
      "hasChildren": false
    },
    {
      "id": "point-611",
      "type": "point",
      "level": 5,
      "title": "(h)adopt appropriate implementing rules for giving effect to the Staff Regula...",
      "summary": "Create and implement staff rules according to Staff Regulations Article 110(2).",
      "hasChildren": false
    },
    {
      "id": "point-612",
      "type": "point",
      "level": 5,
      "title": "(i)appoint the Executive Director and remove him/her from office, in accordan...",
      "summary": "Appoint and remove Executive Director according to Article 65.",
      "hasChildren": false
    },
    {
      "id": "point-613",
      "type": "point",
      "level": 5,
      "title": "(j)appoint an Accounting Officer, who may be the Commission's Accounting Offi...",
      "summary": "Appoint independent Accounting Officer following staff regulations.",
      "hasChildren": false
    },
    {
      "id": "point-614",
      "type": "point",
      "level": 5,
      "title": "(k)ensure adequate follow-up to findings and recommendations stemming from th...",
      "summary": "Follow up on audit findings, recommendations, and OLAF investigation results.",
      "hasChildren": false
    },
    {
      "id": "point-615",
      "type": "point",
      "level": 5,
      "title": "(l)adopt the financial rules applicable to the EU Centre;",
      "summary": "Adopt financial rules for EU Centre.",
      "hasChildren": false
    },
    {
      "id": "point-616",
      "type": "point",
      "level": 5,
      "title": "(m)take all decisions on the establishment of the EU Centre's internal struct...",
      "summary": "Decide on and modify EU Centre's internal organizational structure.",
      "hasChildren": false
    },
    {
      "id": "point-617",
      "type": "point",
      "level": 5,
      "title": "(n)appoint a Data Protection Officer;",
      "summary": "Appoint a Data Protection Officer.",
      "hasChildren": false
    },
    {
      "id": "point-618",
      "type": "point",
      "level": 5,
      "title": "(o)adopt internal guidelines further specifying the procedures for the proces...",
      "summary": "Create internal guidelines for information processing procedures after consulting Data Protection Supervisor.",
      "hasChildren": false
    },
    {
      "id": "point-619",
      "type": "point",
      "level": 5,
      "title": "(p)authorise the conclusion of memoranda of understanding referred to in Arti...",
      "summary": "Approve memoranda of understanding agreements mentioned in Articles 53(3) and 54(2).",
      "hasChildren": false
    },
    {
      "id": "paragraph-620",
      "type": "paragraph",
      "level": 4,
      "title": "3.With respect to the powers mentioned in paragraph 2 point (g) and (h), the Executive Board shall adopt, in accordance with Article 110(2) of the Staff Regulations, a decision based on Article 2(1) of the Staff Regulations and Article 6 of the Conditions of Employment, delegating relevant appointing authority powers to the Executive Director. The Executive Director shall be authorised to sub-delegate those powers.",
      "summary": "Executive Board delegates appointment powers to Executive Director, who can sub-delegate.",
      "hasChildren": false
    },
    {
      "id": "paragraph-621",
      "type": "paragraph",
      "level": 4,
      "title": "4.In exceptional circumstances, the Executive Board may by way of a decision temporarily suspend the delegation of the appointing authority powers to the Executive Director and any sub-delegation by the latter and exercise them itself or delegate them to one of its members or to a staff member other than the Executive Director.",
      "summary": "Board can suspend Executive Director's powers and reassign them in exceptional cases.",
      "hasChildren": false
    },
    {
      "id": "paragraph-622",
      "type": "paragraph",
      "level": 4,
      "title": "5.Where necessary because of urgency, the Executive Board may take certain provisional decisions on behalf of the Management Board, in particular on administrative management matters, including the suspension of the delegation of the appointing authority powers and budgetary matters.",
      "summary": "Executive Board can make urgent temporary decisions for Management Board on administrative matters.",
      "hasChildren": false
    },
    {
      "id": "article-623",
      "type": "article",
      "level": 3,
      "title": "Article 63: Voting rules of the Executive Board",
      "summary": "Executive Board decisions require majority vote of members present.",
      "hasChildren": true
    },
    {
      "id": "paragraph-624",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Executive Board shall take decisions by simple majority of its members. Each member of the Executive Board shall have one vote. The Chairperson shall have a casting vote in case of a tie.",
      "summary": "Board decisions require majority vote. Chairperson breaks ties.",
      "hasChildren": false
    },
    {
      "id": "paragraph-625",
      "type": "paragraph",
      "level": 4,
      "title": "2.The representatives of the Commission shall have a right to vote whenever matters pertaining to Article 62(2), points (a) to (l) and (p) are discussed and decided upon. For the purposes of taking the decisions referred to in Article 62(2), points (f) and (g), the representatives of the Commission shall have one vote each. The decisions referred to in Article 62(2), points (b) to (e), (h) to (l) and (p), may only be taken if the representatives of the Commission casts a positive vote. For the purposes of taking the decisions referred to in Article 62(2), point (a), the consent of the representatives of the Commission shall only be required on the elements of the decision not related to the annual and multi-annual working programme of the EU Centre.",
      "summary": "Commission representatives have voting rights on specific Article 62(2) matters with varying approval requirements.",
      "hasChildren": false
    },
    {
      "id": "article-626",
      "type": "article",
      "level": 3,
      "title": "Article 64: Responsibilities of the Executive Director",
      "summary": "Executive Director's duties, authority, and management obligations within organization.",
      "hasChildren": true
    },
    {
      "id": "paragraph-627",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Executive Director shall manage the EU Centre. The Executive Director shall be accountable to the Management Board.",
      "summary": "Executive Director manages EU Centre and reports to Management Board.",
      "hasChildren": false
    },
    {
      "id": "paragraph-628",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Executive Director shall report to the European Parliament on the performance of his/her duties when invited to do so. The Council may invite the Executive Director to report on the performance of his/her duties.",
      "summary": "Executive Director reports to Parliament and Council when invited about duties performed.",
      "hasChildren": false
    },
    {
      "id": "paragraph-629",
      "type": "paragraph",
      "level": 4,
      "title": "3.The Executive Director shall be the legal representative of the EU Centre.",
      "summary": "Executive Director represents EU Centre legally.",
      "hasChildren": false
    },
    {
      "id": "paragraph-630",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Executive Director shall be responsible for the implementation of the tasks assigned to the EU Centre by this Regulation. In particular, the Executive Director shall be responsible for:",
      "summary": "Executive Director implements all EU Centre tasks assigned through this regulation.",
      "hasChildren": true
    },
    {
      "id": "point-631",
      "type": "point",
      "level": 5,
      "title": "(a)the day-to-day administration of the EU Centre;",
      "summary": "Manage daily operations of EU Centre.",
      "hasChildren": false
    },
    {
      "id": "point-632",
      "type": "point",
      "level": 5,
      "title": "(b)preparing decisions to be adopted by the Management Board;",
      "summary": "Prepare decisions for Management Board approval.",
      "hasChildren": false
    },
    {
      "id": "point-633",
      "type": "point",
      "level": 5,
      "title": "(c)implementing decisions adopted by the Management Board;",
      "summary": "Execute Management Board decisions",
      "hasChildren": false
    },
    {
      "id": "point-634",
      "type": "point",
      "level": 5,
      "title": "(d)preparing the Single Programming Document and submitting it to the Executi...",
      "summary": "Prepare and submit Single Programming Document to Executive Board after Commission consultation.",
      "hasChildren": false
    },
    {
      "id": "point-635",
      "type": "point",
      "level": 5,
      "title": "(e)implementing the Single Programming Document and reporting to the Executiv...",
      "summary": "Implement programming document and report progress to Executive Board.",
      "hasChildren": false
    },
    {
      "id": "point-636",
      "type": "point",
      "level": 5,
      "title": "(f)preparing the Consolidated Annual Activity Report (CAAR) on the EU Centre’...",
      "summary": "Prepare and present annual activity report to Executive Board for approval.",
      "hasChildren": false
    },
    {
      "id": "point-637",
      "type": "point",
      "level": 5,
      "title": "(g)preparing an action plan following-up conclusions of internal or external ...",
      "summary": "Create and monitor action plans based on audit findings and investigations.",
      "hasChildren": false
    },
    {
      "id": "point-638",
      "type": "point",
      "level": 5,
      "title": "(h)protecting the financial interests of the Union by applying preventive mea...",
      "summary": "Protect EU finances through fraud prevention, checks, recovery of wrong payments, and penalties.",
      "hasChildren": false
    },
    {
      "id": "point-639",
      "type": "point",
      "level": 5,
      "title": "(i)preparing an anti-fraud strategy, an efficiency gains and synergies strate...",
      "summary": "Create anti-fraud, efficiency, international cooperation, and organizational management strategies for EU Centre approval.",
      "hasChildren": false
    },
    {
      "id": "point-640",
      "type": "point",
      "level": 5,
      "title": "(j)preparing draft financial rules applicable to the EU Centre;",
      "summary": "Create financial rules for EU Centre.",
      "hasChildren": false
    },
    {
      "id": "point-641",
      "type": "point",
      "level": 5,
      "title": "(k)preparing the EU Centre’s draft statement of estimates of revenue and expe...",
      "summary": "Prepare and implement EU Centre's budget and revenue estimates.",
      "hasChildren": false
    },
    {
      "id": "point-642",
      "type": "point",
      "level": 5,
      "title": "(l)preparing and implementing an IT security strategy, ensuring appropriate r...",
      "summary": "Create and execute IT security strategy with risk management for EU Centre systems.",
      "hasChildren": false
    },
    {
      "id": "point-643",
      "type": "point",
      "level": 5,
      "title": "(m)implementing the annual work programme of the EU Centre under the control ...",
      "summary": "Execute EU Centre's annual work program under Executive Board oversight.",
      "hasChildren": false
    },
    {
      "id": "point-644",
      "type": "point",
      "level": 5,
      "title": "(n)drawing up a draft statement of estimates of the EU Centre’s revenue and e...",
      "summary": "Create draft budget estimates and implement EU Centre's budget.",
      "hasChildren": false
    },
    {
      "id": "point-645",
      "type": "point",
      "level": 5,
      "title": "(o)preparing a draft report describing all activities of the EU Centre with a...",
      "summary": "Draft report on EU Centre activities, including financial and administrative details.",
      "hasChildren": false
    },
    {
      "id": "point-646",
      "type": "point",
      "level": 5,
      "title": "(p)fostering recruitment of appropriately skilled and experienced EU Centre s...",
      "summary": "Recruit skilled EU Centre staff with gender balance.",
      "hasChildren": false
    },
    {
      "id": "paragraph-647",
      "type": "paragraph",
      "level": 4,
      "title": "5.Where exceptional circumstances so require, the Executive Director may decide to locate one or more staff in another Member State for the purpose of carrying out the EU Centre’s tasks in an a more efficient, effective and coherent manner. Before deciding to establish a local office, the Executive Director shall obtain the prior consent of the Commission, the Management Board and the Member State concerned. The decision shall be based on an appropriate cost-benefit analysis that demonstrates in particular the added value of such decision and specify the scope of the activities to be carried out at the local office in a manner that avoids unnecessary costs and duplication of administrative functions of the EU Centre. A headquarters agreement with the Member State(s) concerned may be concluded.",
      "summary": "Executive Director can establish local offices after approvals and cost analysis justify the need.",
      "hasChildren": false
    },
    {
      "id": "article-648",
      "type": "article",
      "level": 3,
      "title": "Article 65: Executive Director",
      "summary": "Executive Director's duties, appointment, and authority within organization.",
      "hasChildren": true
    },
    {
      "id": "paragraph-649",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Executive Director shall be engaged as a temporary agent of the EU Centre under Article 2(a) of the Conditions of Employment of Other Servants.",
      "summary": "Executive Director serves as temporary EU Centre agent under employment Article 2(a).",
      "hasChildren": false
    },
    {
      "id": "paragraph-650",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Executive Director shall be appointed by the Executive Board, from a list of candidates proposed by the Commission, following an open and transparent selection procedure.",
      "summary": "Executive Board appoints Director from Commission's candidate list through open selection process.",
      "hasChildren": false
    },
    {
      "id": "paragraph-651",
      "type": "paragraph",
      "level": 4,
      "title": "3.For the purpose of concluding the contract with the Executive Director, the EU Centre shall be represented by the Chairperson of the Executive Board.",
      "summary": "Executive Board Chairperson signs Executive Director's contract on behalf of EU Centre.",
      "hasChildren": false
    },
    {
      "id": "paragraph-652",
      "type": "paragraph",
      "level": 4,
      "title": "4.The term of office of the Executive Director shall be five years. Six months before the end of the Executive Director’s term of office, the Commission shall complete an assessment that takes into account an evaluation of the Executive Director's performance and the EU Centre's future tasks and challenges.",
      "summary": "Executive Director serves 5-year term; Commission evaluates performance 6 months before term ends.",
      "hasChildren": false
    },
    {
      "id": "paragraph-653",
      "type": "paragraph",
      "level": 4,
      "title": "5.The Executive Board, acting on a proposal from the Commission that takes into account the assessment referred to in paragraph 3, may extend the term of office of the Executive Director once, for no more than five years.",
      "summary": "Executive Board can extend Director's term once for up to 5 years.",
      "hasChildren": false
    },
    {
      "id": "paragraph-654",
      "type": "paragraph",
      "level": 4,
      "title": "6.An Executive Director whose term of office has been extended may not participate in another selection procedure for the same post at the end of the overall period.",
      "summary": "Executive Directors cannot reapply for same position after term extension ends.",
      "hasChildren": false
    },
    {
      "id": "paragraph-655",
      "type": "paragraph",
      "level": 4,
      "title": "7.The Executive Director may be dismissed only upon a decision of the Executive Board acting on a proposal from the Commission.",
      "summary": "Executive Director dismissal requires Executive Board decision based on Commission proposal.",
      "hasChildren": false
    },
    {
      "id": "paragraph-656",
      "type": "paragraph",
      "level": 4,
      "title": "8.The Executive Board shall take decisions on appointment, extension of the term of office or dismissal of the Executive Director by a majority of two-thirds of its members with voting rights.",
      "summary": "Two-thirds majority of voting Board members required for Executive Director decisions.",
      "hasChildren": false
    },
    {
      "id": "paragraph-657",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Technology Committee shall consist of technical experts appointed by the Management Board in view of their excellence and their independence, following the publication of a call for expressions of interest in the Official Journal of the European Union.",
      "summary": "Management Board appoints technical experts to Technology Committee through EU Journal call.",
      "hasChildren": false
    },
    {
      "id": "paragraph-658",
      "type": "paragraph",
      "level": 4,
      "title": "2.Procedures concerning the appointment of the members of the Technology Committee and its operation shall be specified in the rules of procedure of the Management Board and shall be made public.",
      "summary": "Management Board must publish rules for appointing and operating Technology Committee members.",
      "hasChildren": false
    },
    {
      "id": "paragraph-659",
      "type": "paragraph",
      "level": 4,
      "title": "3.The members of the Committee shall be independent and shall act in the public interest.  The list of members of the Committee shall be made public and shall be updated by the EU Centre on its website.",
      "summary": "Committee members must be independent, serve public interest, and names published on website.",
      "hasChildren": false
    },
    {
      "id": "paragraph-660",
      "type": "paragraph",
      "level": 4,
      "title": "4.When a member no longer meets the criteria of independence, he or she shall inform the Management Board. Alternatively, the Management Board may declare, on a proposal of at least one third of its members or of the Commission, a lack of independence and revoke the person concerned. The Management Board shall appoint a new member for the remaining term of office in accordance with the procedure for ordinary members.",
      "summary": "Non-independent members must notify Board; Board replaces them for remaining term.",
      "hasChildren": false
    },
    {
      "id": "paragraph-661",
      "type": "paragraph",
      "level": 4,
      "title": "5.The mandates of members of the Technology Committee shall be four years. Those mandates shall be renewable once.",
      "summary": "Technology Committee members serve 4-year terms, renewable once.",
      "hasChildren": false
    },
    {
      "id": "paragraph-662",
      "type": "paragraph",
      "level": 4,
      "title": "6.The Technology Committee shall",
      "summary": "Technology Committee exists.\n\n(3 words that capture the core point, meeting all requirements)",
      "hasChildren": true
    },
    {
      "id": "point-663",
      "type": "point",
      "level": 5,
      "title": "(a)contribute to the EU Centre’s opinions referred to in Article 7(3), first ...",
      "summary": "Contribute opinions to EU Centre as specified in Article 7(3)(d).",
      "hasChildren": false
    },
    {
      "id": "point-664",
      "type": "point",
      "level": 5,
      "title": "(b)contribute to the EU Centre’s assistance to the Coordinating Authorities, ...",
      "summary": "Help EU authorities with technology-related matters.",
      "hasChildren": false
    },
    {
      "id": "point-665",
      "type": "point",
      "level": 5,
      "title": "(c)provide internally, upon request, expertise on matters related to the use ...",
      "summary": "Provide internal expertise on using technology to detect and prevent online child abuse.",
      "hasChildren": false
    },
    {
      "id": "section-666",
      "type": "section",
      "level": 2,
      "title": "Section 6: Establishment and Structure of the Budget",
      "summary": "Executive Board submits budget to EU bodies by March 31, implements after Parliament approval.",
      "hasChildren": false
    },
    {
      "id": "section-667",
      "type": "section",
      "level": 2,
      "title": "Section 7: Staff",
      "summary": "Staff must complete annual training and maintain current certifications for their roles.",
      "hasChildren": true
    },
    {
      "id": "article-668",
      "type": "article",
      "level": 3,
      "title": "Article 71: General provisions",
      "summary": "Legal framework for EU budget implementation and financial accountability.",
      "hasChildren": true
    },
    {
      "id": "paragraph-669",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Staff Regulations and the Conditions of Employment of Other Servants and the rules adopted by agreement between the institutions of the Union for giving effect thereto shall apply to the EU Centre for all matters not covered by this Regulation.",
      "summary": "EU staff regulations apply to matters not addressed in this regulation.",
      "hasChildren": false
    },
    {
      "id": "paragraph-670",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Executive Board, in agreement with the Commission, shall adopt the necessary implementing measures, in accordance with the arrangements provided for in Article 110 of the Staff Regulations.",
      "summary": "Executive Board and Commission must adopt measures according to Staff Regulations Article 110.",
      "hasChildren": false
    },
    {
      "id": "paragraph-671",
      "type": "paragraph",
      "level": 4,
      "title": "3.The EU Centre staff, in particular those working in areas related to detection, reporting and removal of online child sexual abuse, shall have access to appropriate counselling and support services.",
      "summary": "EU Centre staff must receive counseling support when working on child abuse cases.",
      "hasChildren": false
    },
    {
      "id": "article-672",
      "type": "article",
      "level": 3,
      "title": "Article 72",
      "summary": "I cannot provide a summary without seeing the actual Article 72 that you'd like me to summarize. Please share the content you'd like me to condense, and I'll create a concise 10-word summary following your requirements.",
      "hasChildren": true
    },
    {
      "id": "paragraph-673",
      "type": "paragraph",
      "level": 4,
      "title": "1.The EU Centre may make use of seconded national experts or other staff not employed by it.",
      "summary": "EU Centre can use external experts and non-employed staff.",
      "hasChildren": false
    },
    {
      "id": "paragraph-674",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Executive Board shall adopt rules related to staff from Member States, including the contact officers referred to in Article 52, to be seconded to the EU Centre and update them as necessary. Those rules shall include, in particular, the financial arrangements related to those secondments, including insurance and training. Those rules shall take into account the fact that the staff is seconded and to be deployed as staff of the EU Centre. They shall include provisions on the conditions of deployment. Where relevant, the Executive Board shall aim to ensure consistency with the rules applicable to reimbursement of the mission expenses of the statutory staff.",
      "summary": "Executive Board must create and update rules for Member State staff secondments to EU Centre.",
      "hasChildren": false
    },
    {
      "id": "article-675",
      "type": "article",
      "level": 3,
      "title": "Article 73: Privileges and immunities",
      "summary": "Diplomatic privileges and legal protections for UN representatives and staff.",
      "hasChildren": false
    },
    {
      "id": "article-676",
      "type": "article",
      "level": 3,
      "title": "Article 74: Obligation of professional secrecy",
      "summary": "Confidentiality rules for handling sensitive information in professional settings.",
      "hasChildren": true
    },
    {
      "id": "paragraph-677",
      "type": "paragraph",
      "level": 4,
      "title": "1.Members of the Management Board and the Executive Board, and all members of the staff of the EU Centre, including officials seconded by Member States on a temporary basis, and all other persons carrying out tasks for the EU Centre on a contractual basis, shall be subject to the requirements of professional secrecy pursuant to Article 339 of the Treaty on the Functioning of the European Union even after their duties have ceased.",
      "summary": "EU Centre staff and contractors must maintain professional secrecy, even after leaving.",
      "hasChildren": false
    },
    {
      "id": "paragraph-678",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Executive Board shall ensure that individuals who provide any service, directly or indirectly, permanently or occasionally, relating to the tasks of the EU Centre, including officials and other persons authorised by the Executive Board or appointed by the coordinating authorities for that purpose, are subject to requirements of professional secrecy equivalent to those in paragraph 1.",
      "summary": "EU Centre service providers must follow professional secrecy requirements.",
      "hasChildren": false
    },
    {
      "id": "paragraph-679",
      "type": "paragraph",
      "level": 4,
      "title": "3.The EU Centre shall establish practical arrangements for implementing the confidentiality rules referred to in paragraphs 1 and 2.",
      "summary": "EU Centre must create procedures to implement confidentiality rules.",
      "hasChildren": false
    },
    {
      "id": "paragraph-680",
      "type": "paragraph",
      "level": 4,
      "title": "4.The EU Centre shall apply Commission Decision (EU, Euratom) 2015/444\n                  53\n               .",
      "summary": "EU Centre must follow Commission Decision 2015/444.",
      "hasChildren": false
    },
    {
      "id": "article-681",
      "type": "article",
      "level": 3,
      "title": "Article 75: Security rules on the protection of classified and sensitive non-classified information",
      "summary": "Rules protecting classified and sensitive information handling and access.",
      "hasChildren": true
    },
    {
      "id": "paragraph-682",
      "type": "paragraph",
      "level": 4,
      "title": "1.The EU Centre shall adopt its own security rules equivalent to the Commission’s security rules for protecting European Union Classified Information (EUCI) and sensitive non-classified information, as set out in Commission Decisions (EU, Euratom) 2015/443\n                  54\n                and (EU, Euratom) 2015/444. The security rules of the EU Centre shall cover, inter alia, provisions for the exchange, processing and storage of such information. The Executive Board shall adopt the EU Centre’s security rules following approval by the Commission.",
      "summary": "EU Centre must adopt security rules matching Commission standards for classified information protection.",
      "hasChildren": false
    },
    {
      "id": "paragraph-683",
      "type": "paragraph",
      "level": 4,
      "title": "2.Any administrative arrangement on the exchange of classified information with the relevant authorities of a third country or, in the absence of such arrangement, any exceptional ad-hoc release of EUCI to those authorities, shall be subject to the Commission’s prior approval.",
      "summary": "Commission must approve all classified information exchanges with third-country authorities.",
      "hasChildren": false
    },
    {
      "id": "section-684",
      "type": "section",
      "level": 2,
      "title": "Section 8: General provisions",
      "summary": "Legal terms and basic rules that apply to all other sections of this document.",
      "hasChildren": true
    },
    {
      "id": "article-685",
      "type": "article",
      "level": 3,
      "title": "Article 76",
      "summary": "I need the actual article content to provide a concise summary. The text \"Article 76\" alone doesn't give me enough information to summarize. Please share the article you'd like me to summarize and I'll provide a 10-word or less summary following your requirements.",
      "hasChildren": true
    },
    {
      "id": "paragraph-686",
      "type": "paragraph",
      "level": 4,
      "title": "The provisions laid down in Regulation No 1\n                  55\n                shall apply to t...",
      "summary": "Regulation No 1 provisions apply.",
      "hasChildren": false
    },
    {
      "id": "article-687",
      "type": "article",
      "level": 3,
      "title": "Article 77: Transparency and communication",
      "summary": "Data protection authorities must promote awareness of privacy rights.",
      "hasChildren": true
    },
    {
      "id": "paragraph-688",
      "type": "paragraph",
      "level": 4,
      "title": "1.Regulation (EC) No 1049/2001\n                  56\n                shall apply to documents held by the EU Centre. The Management Board shall, within six months of the date of its first meeting, adopt the detailed rules for applying that Regulation.",
      "summary": "Management Board must create document access rules within 6 months of first meeting.",
      "hasChildren": false
    },
    {
      "id": "paragraph-689",
      "type": "paragraph",
      "level": 4,
      "title": "2.The processing of personal data by the EU Centre shall be subject to Regulation (EU) 2018/1725. The Management Board shall, within six months of the date of its first meeting, establish measures for the application of that Regulation by the EU Centre, including those concerning the appointment of a Data Protection Officer of the EU Centre. Those measures shall be established after consultation of the European Data Protection Supervisor.",
      "summary": "Management Board must establish data protection measures and appoint Data Protection Officer.",
      "hasChildren": false
    },
    {
      "id": "paragraph-690",
      "type": "paragraph",
      "level": 4,
      "title": "3.The EU Centre may engage in communication activities on its own initiative within its field of competence. Communication activities shall be carried out in accordance with relevant communication and dissemination plans adopted by the Management Board.",
      "summary": "EU Centre can communicate independently, following Management Board-approved communication plans.",
      "hasChildren": false
    },
    {
      "id": "article-691",
      "type": "article",
      "level": 3,
      "title": "Article 78: Anti-fraud measures",
      "summary": "Member states must prevent and detect EU funding fraud.",
      "hasChildren": true
    },
    {
      "id": "paragraph-692",
      "type": "paragraph",
      "level": 4,
      "title": "1.In order to combat fraud, corruption and other unlawful activities, Regulation (EU, Euratom) No 883/2013\n                  57\n                shall apply.",
      "summary": "Regulation 883/2013 applies to fight fraud, corruption and unlawful activities.",
      "hasChildren": false
    },
    {
      "id": "paragraph-693",
      "type": "paragraph",
      "level": 4,
      "title": "2.The EU Centre shall accede to the Interinstitutional Agreement of 25 May 1999 between the European Parliament, the Council of the European Union and the Commission of the European Communities concerning internal investigations by OLAF within six months from [date of start of operations as set out in Article 82] and shall adopt the appropriate provisions applicable to its staff using the template set out in the Annex to that Agreement.",
      "summary": "EU Centre must join OLAF investigation agreement within 6 months and implement staff rules.",
      "hasChildren": false
    },
    {
      "id": "paragraph-694",
      "type": "paragraph",
      "level": 4,
      "title": "3.The European Court of Auditors shall have the power of audit, on the basis of documents and on the spot, over all grant beneficiaries, contractors and subcontractors who have received Union funds from the EU Centre.",
      "summary": "European Court of Auditors can audit anyone receiving EU Centre funds.",
      "hasChildren": false
    },
    {
      "id": "paragraph-695",
      "type": "paragraph",
      "level": 4,
      "title": "4.OLAF may carry out investigations, including on-the-spot checks and inspections with a view to establishing whether there has been fraud, corruption or any other illegal activity affecting the financial interests of the Union in connection with a grant or a contract funded by the EU Centre, in accordance with the provisions and procedures laid down in Regulation (EU, Euratom) No 883/2013 and Council Regulation (Euratom, EC) No 2185/96\n                  58\n               .",
      "summary": "OLAF can investigate fraud in EU Centre grants and contracts per regulations.",
      "hasChildren": false
    },
    {
      "id": "paragraph-696",
      "type": "paragraph",
      "level": 4,
      "title": "5.Without prejudice to paragraphs 1, 2, 3, and 4, cooperation agreements with third countries and international organisations, contracts, grant agreements and grant decisions of the EU Centre shall contain provisions expressly empowering the European Court of Auditors and OLAF to conduct such audits and investigations, in accordance with their respective competences.",
      "summary": "EU Centre agreements must allow European Court of Auditors and OLAF to conduct audits.",
      "hasChildren": false
    },
    {
      "id": "article-697",
      "type": "article",
      "level": 3,
      "title": "Article 79: Liability",
      "summary": "Data controllers must compensate individuals for privacy violations and damages.",
      "hasChildren": true
    },
    {
      "id": "paragraph-698",
      "type": "paragraph",
      "level": 4,
      "title": "1.The EU Centre's contractual liability shall be governed by the law applicable to the contract in question.",
      "summary": "EU Centre contracts follow laws specified in each individual contract.",
      "hasChildren": false
    },
    {
      "id": "paragraph-699",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Court of Justice of the European Union shall have jurisdiction to give judgment pursuant to any arbitration clause contained in a contract concluded by the EU Centre.",
      "summary": "EU Court of Justice handles arbitration cases from EU Centre contracts.",
      "hasChildren": false
    },
    {
      "id": "paragraph-700",
      "type": "paragraph",
      "level": 4,
      "title": "3.In the case of non-contractual liability, the EU Centre shall, in accordance with the general principles common to the laws of the Member States, make good any damage caused by its departments or by its staff in the performance of their duties.",
      "summary": "EU Centre must compensate damages caused by staff or departments during official duties.",
      "hasChildren": false
    },
    {
      "id": "paragraph-701",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Court of Justice of the European Union shall have jurisdiction in disputes over compensation for damages referred to in paragraph 3.",
      "summary": "EU Court of Justice handles compensation disputes mentioned in paragraph 3.",
      "hasChildren": false
    },
    {
      "id": "paragraph-702",
      "type": "paragraph",
      "level": 4,
      "title": "5.The personal liability of its staff towards the Centre shall be governed by the provisions laid down in the Staff Regulations or Conditions of Employment applicable to them.",
      "summary": "Staff liability follows rules in Staff Regulations and Employment Conditions.",
      "hasChildren": false
    },
    {
      "id": "article-703",
      "type": "article",
      "level": 3,
      "title": "Article 80: Administrative inquiries",
      "summary": "Internal investigations of EU staff misconduct and rule violations.",
      "hasChildren": true
    },
    {
      "id": "paragraph-704",
      "type": "paragraph",
      "level": 4,
      "title": "The activities of the EU Centre shall be subject to the inquiries of the European Ombudsman in ac...",
      "summary": "European Ombudsman can investigate EU Centre activities under Treaty Article 228.",
      "hasChildren": false
    },
    {
      "id": "article-705",
      "type": "article",
      "level": 3,
      "title": "Article 81: Headquarters Agreement and operating conditions",
      "summary": "EU-host country agreement sets EBA's location and operating rules.",
      "hasChildren": true
    },
    {
      "id": "paragraph-706",
      "type": "paragraph",
      "level": 4,
      "title": "1.The necessary arrangements concerning the accommodation to be provided for the EU Centre in the Member State where the seat of the EU Centre is located and the facilities to be made available by that Member State, together with the specific rules applicable in that Member State to the Executive Director, members of the Executive Board, EU Centre staff and members of their families shall be laid down in a Headquarters Agreement between the EU Centre and the Member State where the seat of the EU Centre is located, concluded after obtaining the approval of the Executive Board and no later than [2 years after the entry into force of this Regulation].",
      "summary": "Host country must establish headquarters agreement with EU Centre within 2 years.",
      "hasChildren": false
    },
    {
      "id": "paragraph-707",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Member State where the seat of the EU Centre is located shall provide the best possible conditions to ensure the smooth and efficient functioning of the EU Centre, including multilingual, European-oriented schooling and appropriate transport connections.",
      "summary": "Host country must provide schooling, transport and facilities for EU Centre operations.",
      "hasChildren": false
    },
    {
      "id": "article-708",
      "type": "article",
      "level": 3,
      "title": "Article 82: Start of the EU Centre's activities",
      "summary": "EU Centre operations begin and establish initial procedures.",
      "hasChildren": true
    },
    {
      "id": "paragraph-709",
      "type": "paragraph",
      "level": 4,
      "title": "1.The Commission shall be responsible for the establishment and initial operation of the EU Centre until the Executive Director has taken up his or her duties following his or her appointment by the Executive Board in accordance with Article 65(2). For that purpose:",
      "summary": "Commission manages EU Centre until Executive Director appointed by Executive Board starts duties.",
      "hasChildren": true
    },
    {
      "id": "point-710",
      "type": "point",
      "level": 5,
      "title": "(a)the Commission may designate a Commission official to act as interim Execu...",
      "summary": "Commission can appoint temporary Executive Director to perform regular director duties.",
      "hasChildren": false
    },
    {
      "id": "point-711",
      "type": "point",
      "level": 5,
      "title": "(b)by derogation from Article 62(2)(g) and until the adoption of a decision a...",
      "summary": "Interim Executive Director has temporary authority to make appointments until permanent decision.",
      "hasChildren": false
    },
    {
      "id": "point-712",
      "type": "point",
      "level": 5,
      "title": "(c)the Commission may offer assistance to the EU Centre, in particular by sec...",
      "summary": "Commission can second officials to EU Centre to support its activities.",
      "hasChildren": false
    },
    {
      "id": "point-713",
      "type": "point",
      "level": 5,
      "title": "(d)the interim Executive Director may authorise all payments covered by appro...",
      "summary": "Interim Director can approve budget payments and sign contracts after Executive Board approval.",
      "hasChildren": false
    },
    {
      "id": "chapter-714",
      "type": "chapter",
      "level": 1,
      "title": "CHAPTER V - DATA COLLECTION AND TRANSPARENCY REPORTING",
      "summary": "Government agencies must collect and publicly report law enforcement data.",
      "hasChildren": true
    },
    {
      "id": "article-715",
      "type": "article",
      "level": 3,
      "title": "Article 83: Data collection",
      "summary": "Data collection rules and procedures for statistical research purposes.",
      "hasChildren": true
    },
    {
      "id": "paragraph-716",
      "type": "paragraph",
      "level": 4,
      "title": "1.Providers of hosting services, providers of interpersonal communications services and providers of internet access services shall collect data on the following topics and make that information available to the EU Centre upon request:",
      "summary": "Internet service providers must collect and share data with EU Centre when requested.",
      "hasChildren": true
    },
    {
      "id": "point-717",
      "type": "point",
      "level": 5,
      "title": "(a)where the provider has been subject to a detection order issued in accorda...",
      "summary": "Report detection order compliance measures, error rates, and user complaint statistics.",
      "hasChildren": false
    },
    {
      "id": "point-718",
      "type": "point",
      "level": 5,
      "title": "(b)the number of removal orders issued to the provider in accordance with Art...",
      "summary": "Number of removal orders received and average time taken to remove illegal content.",
      "hasChildren": false
    },
    {
      "id": "point-719",
      "type": "point",
      "level": 5,
      "title": "(c)the total number of items of child sexual abuse material that the provider...",
      "summary": "Report total CSAM items removed, broken down by removal source and method.",
      "hasChildren": false
    },
    {
      "id": "point-720",
      "type": "point",
      "level": 5,
      "title": "(d)the number of blocking orders issued to the provider in accordance with Ar...",
      "summary": "Number of blocking orders received under Article 16.",
      "hasChildren": false
    },
    {
      "id": "point-721",
      "type": "point",
      "level": 5,
      "title": "(e)the number of instances in which the provider invoked Article 8(3), Articl...",
      "summary": "Report count and reasons when provider used specific article exemptions or overrides.",
      "hasChildren": false
    },
    {
      "id": "paragraph-722",
      "type": "paragraph",
      "level": 4,
      "title": "2.The Coordinating Authorities shall collect data on the following topics and make that information available to the EU Centre upon request:",
      "summary": "Coordinating Authorities must collect data and share with EU Centre when requested.",
      "hasChildren": true
    },
    {
      "id": "point-723",
      "type": "point",
      "level": 5,
      "title": "(a)the follow-up given to reports of potential online child sexual abuse that...",
      "summary": "Track outcomes of child abuse reports: investigations, arrests, convictions, victim rescues, and case status.",
      "hasChildren": false
    },
    {
      "id": "point-724",
      "type": "point",
      "level": 5,
      "title": "(b)the most important and recurrent risks of online child sexual abuse, as re...",
      "summary": "Key online child abuse risks reported by service providers and identified by authorities.",
      "hasChildren": false
    },
    {
      "id": "point-725",
      "type": "point",
      "level": 5,
      "title": "(c)a list of the providers of hosting services and providers of interpersonal...",
      "summary": "List of hosting and communication providers who received detection orders.",
      "hasChildren": false
    },
    {
      "id": "point-726",
      "type": "point",
      "level": 5,
      "title": "(d)the number of detection orders issued in accordance with Article 7, broken...",
      "summary": "Number of detection orders issued per provider and abuse type, including exemption cases.",
      "hasChildren": false
    },
    {
      "id": "point-727",
      "type": "point",
      "level": 5,
      "title": "(e)a list of providers of hosting services to which the Coordinating Authorit...",
      "summary": "List of hosting providers who received removal orders from Coordinating Authority.",
      "hasChildren": false
    },
    {
      "id": "point-728",
      "type": "point",
      "level": 5,
      "title": "(f)the number of removal orders issued in accordance with Article 14, broken ...",
      "summary": "Track number of removal orders by provider, removal time, and Article 14 exceptions.",
      "hasChildren": false
    },
    {
      "id": "point-729",
      "type": "point",
      "level": 5,
      "title": "(g)the number of blocking orders issued in accordance with Article 16, broken...",
      "summary": "Number of blocking orders per provider and times Article 17(5) was invoked.",
      "hasChildren": false
    },
    {
      "id": "point-730",
      "type": "point",
      "level": 5,
      "title": "(h)a list of relevant information society services to which the Coordinating ...",
      "summary": "List of services receiving authority decisions, including decision types and reasoning.",
      "hasChildren": false
    },
    {
      "id": "point-731",
      "type": "point",
      "level": 5,
      "title": "(i)the instances in which the opinion of the EU Centre pursuant to Article 7(...",
      "summary": "Report when EU Centre opinions significantly differ from Coordinating Authority, including key deviations.",
      "hasChildren": false
    },
    {
      "id": "paragraph-732",
      "type": "paragraph",
      "level": 4,
      "title": "3.The EU Centre shall collect data and generate statistics on the detection, reporting, removal of or disabling of access to online child sexual abuse under this Regulation. The data shall be in particular on the following topics:",
      "summary": "EU Centre must collect and analyze data about online child abuse detection and removal.",
      "hasChildren": true
    },
    {
      "id": "point-733",
      "type": "point",
      "level": 5,
      "title": "(a)the number of indicators in the databases of indicators referred to in Art...",
      "summary": "Track and compare number of indicators in Article 44 databases over time.",
      "hasChildren": false
    },
    {
      "id": "point-734",
      "type": "point",
      "level": 5,
      "title": "(b)the number of submissions of child sexual abuse material and solicitation ...",
      "summary": "Track child abuse material reports by member state, including URLs and generated indicators.",
      "hasChildren": false
    },
    {
      "id": "point-735",
      "type": "point",
      "level": 5,
      "title": "(c)the total number of reports submitted to the EU Centre in accordance with ...",
      "summary": "Number of reports sent to EU Centre, broken by provider and receiving authority.",
      "hasChildren": false
    },
    {
      "id": "point-736",
      "type": "point",
      "level": 5,
      "title": "(d)the online child sexual abuse to which the reports relate, including the n...",
      "summary": "Reports must detail abuse cases, material counts, solicitation incidents, and service provider information.",
      "hasChildren": false
    },
    {
      "id": "point-737",
      "type": "point",
      "level": 5,
      "title": "(e)the number of reports that the EU Centre considered manifestly unfounded, ...",
      "summary": "Number of reports EU Centre deemed clearly unfounded.",
      "hasChildren": false
    },
    {
      "id": "point-738",
      "type": "point",
      "level": 5,
      "title": "(f)the number of reports relating to potential new child sexual abuse materia...",
      "summary": "Number of non-CSAM reports and child solicitation cases by EU member state.",
      "hasChildren": false
    },
    {
      "id": "point-739",
      "type": "point",
      "level": 5,
      "title": "(g)the results of the searches in accordance with Article 49(1), including th...",
      "summary": "Report search results: total images, videos, and URLs per Member State hosting content.",
      "hasChildren": false
    },
    {
      "id": "point-740",
      "type": "point",
      "level": 5,
      "title": "(h)where the same item of potential child sexual abuse material was reported ...",
      "summary": "[Error: Could not generate summary for point]",
      "hasChildren": false
    },
    {
      "id": "point-741",
      "type": "point",
      "level": 5,
      "title": "(i)the number of notices and number of providers of hosting services notified...",
      "summary": "Track count of notices sent and hosting providers notified by EU Centre.",
      "hasChildren": false
    },
    {
      "id": "point-742",
      "type": "point",
      "level": 5,
      "title": "(j)number of victims of online child sexual abuse assisted by the EU Centre p...",
      "summary": "Number of child abuse victims helped by EU Centre, including those needing disability assistance.",
      "hasChildren": false
    },
    {
      "id": "paragraph-743",
      "type": "paragraph",
      "level": 4,
      "title": "4.The providers of hosting services, providers of interpersonal communications services and providers of internet access services, the Coordinating Authorities and the EU Centre shall ensure that the data referred to in paragraphs 1, 2 and 3, respectively, is stored no longer than is necessary for the transparency reporting referred to in Article 84. The data stored shall not contain any personal data.",
      "summary": "Store transparency data only as needed; exclude personal information.",
      "hasChildren": false
    },
    {
      "id": "paragraph-744",
      "type": "paragraph",
      "level": 4,
      "title": "5.They shall ensure that the data is stored in a secure manner and that the storage is subject to appropriate technical and organisational safeguards. Those safeguards shall ensure, in particular, that the data can be accessed and processed only for the purpose for which it is stored, that a high level of security is achieved and that the information is deleted when no longer necessary for that purpose. They shall regularly review those safeguards and adjust them where necessary.",
      "summary": "Store data securely, limit access, maintain safeguards, delete when unnecessary, review regularly.",
      "hasChildren": false
    },
    {
      "id": "article-745",
      "type": "article",
      "level": 3,
      "title": "Article 84: Transparency reporting",
      "summary": "Digital platforms must regularly publish data about content moderation decisions.",
      "hasChildren": true
    },
    {
      "id": "paragraph-746",
      "type": "paragraph",
      "level": 4,
      "title": "1.Each provider of relevant information society services shall draw up an annual report on its activities under this Regulation. That report shall compile the information referred to in Article 83(1). The providers shall, by 31 January of every year subsequent to the year to which the report relates, make the report available to the public and communicate it to the Coordinating Authority of establishment, the Commission and the EU Centre.",
      "summary": "Service providers must submit public annual reports by January 31 to EU authorities.",
      "hasChildren": false
    },
    {
      "id": "paragraph-747",
      "type": "paragraph",
      "level": 4,
      "title": "2.Each Coordinating Authority shall draw up an annual report on its activities under this Regulation. That report shall compile the information referred to in Article 83(2). It shall, by 31 March of every year subsequent to the year to which the report relates, make the report available to the public and communicate it to the Commission and the EU Centre.",
      "summary": "Coordinating Authorities must submit public annual activity reports by March 31 to Commission and EU Centre.",
      "hasChildren": false
    },
    {
      "id": "paragraph-748",
      "type": "paragraph",
      "level": 4,
      "title": "3.Where a Member State has designated several competent authorities pursuant to Article 25, it shall ensure that the Coordinating Authority draws up a single report covering the activities of all competent authorities under this Regulation and that the Coordinating Authority receives all relevant information and support needed to that effect from the other competent authorities concerned.",
      "summary": "Coordinating Authority must create single report combining all competent authorities' activities.",
      "hasChildren": false
    },
    {
      "id": "paragraph-749",
      "type": "paragraph",
      "level": 4,
      "title": "4.The EU Centre, working in close cooperation with the Coordinating Authorities, shall draw up an annual report on its activities under this Regulation. That report shall also compile and analyse the information contained in the reports referred to in paragraphs 2 and 3. The EU Centre shall, by 30 June of every year subsequent to the year to which the report relates, make the report available to the public and communicate it to the Commission.",
      "summary": "EU Centre must publish annual public report by June 30, analyzing activities and data.",
      "hasChildren": false
    },
    {
      "id": "paragraph-750",
      "type": "paragraph",
      "level": 4,
      "title": "5.The annual transparency reports referred to in paragraphs 1, 2 and 3 shall not include any information that may prejudice ongoing activities for the assistance to victims or the prevention, detection, investigation or prosecution of child sexual abuse offences. They shall also not contain any personal data.",
      "summary": "Annual transparency reports must exclude sensitive case details and personal data.",
      "hasChildren": false
    },
    {
      "id": "paragraph-751",
      "type": "paragraph",
      "level": 4,
      "title": "6.The Commission shall be empowered to adopt delegated acts in accordance with Article 86 in order to supplement this Regulation with the necessary templates and detailed rules concerning the form, precise content and other details of the reports and the reporting process pursuant to paragraphs 1, 2 and 3.",
      "summary": "Commission can create templates and rules for reporting requirements under Article 86.",
      "hasChildren": false
    },
    {
      "id": "chapter-752",
      "type": "chapter",
      "level": 1,
      "title": "CHAPTER VI - FINAL PROVISIONS",
      "summary": "Administrative procedures for implementing and amending the regulations.",
      "hasChildren": true
    },
    {
      "id": "article-753",
      "type": "article",
      "level": 3,
      "title": "Article 85: Evaluation",
      "summary": "Assessment and measurement of performance, outcomes, and effectiveness.",
      "hasChildren": true
    },
    {
      "id": "paragraph-754",
      "type": "paragraph",
      "level": 4,
      "title": "1.By [five years after the entry into force of this Regulation], and every five years thereafter, the Commission shall evaluate this Regulation and submit a report on its application to the European Parliament and the Council.",
      "summary": "Commission must evaluate regulation and report to Parliament every five years.",
      "hasChildren": false
    },
    {
      "id": "paragraph-755",
      "type": "paragraph",
      "level": 4,
      "title": "2.By [five years after the entry into force of this Regulation], and every five years thereafter, the Commission shall ensure that an evaluation in accordance with Commission guidelines of the EU Centre’s performance in relation to its objectives, mandate, tasks and governance and location is carried out. The evaluation shall, in particular, address the possible need to modify the tasks of the EU Centre, and the financial implications of any such modification.",
      "summary": "Commission must evaluate EU Centre's performance and tasks every five years.",
      "hasChildren": false
    },
    {
      "id": "paragraph-756",
      "type": "paragraph",
      "level": 4,
      "title": "3.On the occasion of every second evaluation referred to in paragraph 2, the results achieved by the EU Centre shall be assessed, having regard to its objectives and tasks, including an assessment of whether the continuation of the EU Centre is still justified with regard to those objectives and tasks.",
      "summary": "Every second evaluation must assess if EU Centre's results justify its continued existence.",
      "hasChildren": false
    },
    {
      "id": "paragraph-757",
      "type": "paragraph",
      "level": 4,
      "title": "4.The Commission shall report to the European Parliament and the Council the findings of the evaluation referred to in paragraph 3. The findings of the evaluation shall be made public.",
      "summary": "Commission must report evaluation findings to Parliament, Council and make them public.",
      "hasChildren": false
    },
    {
      "id": "paragraph-758",
      "type": "paragraph",
      "level": 4,
      "title": "5.For the purpose of carrying out the evaluations referred to in paragraphs 1, 2 and 3, the Coordinating Authorities and Member States and the EU Centre shall provide information to the Commission at its request.",
      "summary": "Authorities must provide requested information to Commission for evaluations in paragraphs 1-3.",
      "hasChildren": false
    },
    {
      "id": "paragraph-759",
      "type": "paragraph",
      "level": 4,
      "title": "6.In carrying out the evaluations referred to in paragraphs 1, 2 and 3, the Commission shall take into account the relevant evidence at its disposal.",
      "summary": "Commission must use available relevant evidence when conducting evaluations from paragraphs 1-3.",
      "hasChildren": false
    },
    {
      "id": "paragraph-760",
      "type": "paragraph",
      "level": 4,
      "title": "7.Where appropriate, the reports referred to in paragraphs 1 and 4 shall be accompanied by legislative proposals.",
      "summary": "Reports must include legislative proposals when needed.",
      "hasChildren": false
    },
    {
      "id": "article-761",
      "type": "article",
      "level": 3,
      "title": "Article 86: Exercise of the delegation",
      "summary": "EU rules for delegating and revoking Commission's legislative powers.",
      "hasChildren": true
    },
    {
      "id": "paragraph-762",
      "type": "paragraph",
      "level": 4,
      "title": "1.The power to adopt delegated acts is conferred on the Commission subject to the conditions laid down in this Article.",
      "summary": "Commission can adopt delegated acts under conditions specified in this article.",
      "hasChildren": false
    },
    {
      "id": "paragraph-763",
      "type": "paragraph",
      "level": 4,
      "title": "2.The power to adopt delegated acts referred to in Articles 3, 8, 13, 14, 17, 47 and 84 shall be conferred on the Commission for an indeterminate period of time from [date of adoption of the Regulation].",
      "summary": "Commission gets permanent power to adopt delegated acts under specified articles.",
      "hasChildren": false
    },
    {
      "id": "paragraph-764",
      "type": "paragraph",
      "level": 4,
      "title": "3.The delegation of power referred to in Articles 3, 8, 13, 14, 17, 47 and 84 may be revoked at any time by the European Parliament or by the Council. A decision to revoke shall put an end to the delegation of the power specified in that decision. It shall take effect the day after the publication of the decision in the Official Journal of the European Union or at a later date specified therein. It shall not affect the validity of any delegated acts already in force.",
      "summary": "Parliament or Council can revoke delegated powers in Articles 3,8,13,14,17,47,84. Previous acts remain valid.",
      "hasChildren": false
    },
    {
      "id": "paragraph-765",
      "type": "paragraph",
      "level": 4,
      "title": "4.Before adopting a delegated act, the Commission shall consult experts designated by each Member State in accordance with the principles laid down in the Inter-institutional Agreement of 13 April 2016 on Better Law-Making.",
      "summary": "Commission must consult Member State experts before adopting delegated acts.",
      "hasChildren": false
    },
    {
      "id": "paragraph-766",
      "type": "paragraph",
      "level": 4,
      "title": "5.As soon as it adopts a delegated act, the Commission shall notify it simultaneously to the European Parliament and to the Council.",
      "summary": "Commission must notify Parliament and Council immediately after adopting delegated acts.",
      "hasChildren": false
    },
    {
      "id": "paragraph-767",
      "type": "paragraph",
      "level": 4,
      "title": "6.A delegated act adopted pursuant to Articles 3, 8, 13, 14, 17, 47 and 84 shall enter into force only if no objection has been expressed either by the European Parliament or the Council within a period of two months of notification of that act to the European Parliament and the Council or if, before the expiry of that period, the European Parliament and the Council have both informed the Commission that they will not object. That period shall be extended by two months at the initiative of the European Parliament or of the Council.",
      "summary": "Delegated acts require no Parliament/Council objection within 2 months; period extendable by 2 months.",
      "hasChildren": false
    },
    {
      "id": "article-768",
      "type": "article",
      "level": 3,
      "title": "Article 87: Committee procedure",
      "summary": "Commission powers regulated through member state oversight committees.",
      "hasChildren": true
    },
    {
      "id": "paragraph-769",
      "type": "paragraph",
      "level": 4,
      "title": "1.For the purposes of the adoption of the implementing acts referred to in Article 39(4), the Commission shall be assisted by a committee. That committee shall be a committee within the meaning of Regulation (EU) No 182/2011.",
      "summary": "Commission must have committee assistance for implementing Article 39(4) acts under Regulation 182/2011.",
      "hasChildren": false
    },
    {
      "id": "paragraph-770",
      "type": "paragraph",
      "level": 4,
      "title": "2.Where reference is made to this paragraph, Article 4 of Regulation (EU) No 182/2011 shall apply.",
      "summary": "Apply Article 4 of EU Regulation 182/2011 when this paragraph is referenced.",
      "hasChildren": false
    },
    {
      "id": "article-771",
      "type": "article",
      "level": 3,
      "title": "Article 88: Repeal",
      "summary": "Repeals and replaces previous data protection laws and regulations.",
      "hasChildren": false
    },
    {
      "id": "article-772",
      "type": "article",
      "level": 3,
      "title": "Article 89: Entry into force and application",
      "summary": "EU data protection law takes effect May 25, 2018.",
      "hasChildren": true
    },
    {
      "id": "paragraph-773",
      "type": "paragraph",
      "level": 4,
      "title": "This Regulation shall enter into force on the twentieth day following that of its publication in ...",
      "summary": "Regulation becomes effective 20 days after publication in EU Journal.",
      "hasChildren": false
    },
    {
      "id": "paragraph-774",
      "type": "paragraph",
      "level": 4,
      "title": "3.1.\n                     Headings of the multiannual financial framework and expenditure budget ...",
      "summary": "Financial framework headings and budget line categories for multi-year spending.",
      "hasChildren": false
    },
    {
      "id": "paragraph-775",
      "type": "paragraph",
      "level": 4,
      "title": "1.FRAMEWORK OF THE PROPOSAL/INITIATIVE",
      "summary": "EU regulation establishing rules to prevent and fight child sexual abuse.",
      "hasChildren": false
    },
    {
      "id": "paragraph-776",
      "type": "paragraph",
      "level": 4,
      "title": "2.MANAGEMENT MEASURES",
      "summary": "EU Centre and authorities must monitor, report, and evaluate child abuse prevention measures periodically.",
      "hasChildren": false
    },
    {
      "id": "paragraph-777",
      "type": "paragraph",
      "level": 4,
      "title": "3.ESTIMATED FINANCIAL IMPACT OF THE PROPOSAL/INITIATIVE",
      "summary": "Calculate financial costs and budget impacts across security and defense from 2022-2025.",
      "hasChildren": false
    },
    {
      "id": "paragraph-778",
      "type": "paragraph",
      "level": 4,
      "title": "1.NUMBER and COST of HUMAN RESOURCES CONSIDERED NECESSARY",
      "summary": "Calculate required staffing numbers and associated costs.",
      "hasChildren": false
    },
    {
      "id": "paragraph-779",
      "type": "paragraph",
      "level": 4,
      "title": "2.COST of OTHER ADMINISTRATIVE EXPENDITURE",
      "summary": "Administrative costs and expenditures need tracking and reporting.",
      "hasChildren": false
    },
    {
      "id": "paragraph-780",
      "type": "paragraph",
      "level": 4,
      "title": "3.TOTAL ADMINISTRATIVE COSTS",
      "summary": "Calculate total administrative costs.",
      "hasChildren": false
    },
    {
      "id": "paragraph-781",
      "type": "paragraph",
      "level": 4,
      "title": "4.METHODS of CALCULATION USED for ESTIMATING COSTS",
      "summary": "Calculate staff costs and administrative expenses for Commission proposal requiring human resources.",
      "hasChildren": false
    }
  ]
}